{
  "metadata": {
    "length": 141,
    "arabic": {
      "title": "مشكاة المصابيح",
      "author": "الإمام الكاتب التبريزي",
      "introduction": "كتاب الفتن"
    },
    "english": {
      "title": "Mishkat al-Masabih",
      "author": "Al-Khatib Al-Tabrizi",
      "introduction": "Fitan"
    }
  },
  "hadiths": [
    {
      "id": 1,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "عَن حُذَيْفَة قَالَ: قَامَ فِينَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَقَامًا مَا تَرَكَ شَيْئًا يَكُونُ فِي مقَامه إِلَى قِيَامِ السَّاعَةِ إِلَّا حَدَّثَ بِهِ حَفِظَهُ مَنْ حَفِظَهُ وَنَسِيَهُ مَنْ نَسِيَهُ قَدْ عَلِمَهُ أَصْحَابِي هَؤُلَاءِ وَإِنَّهُ لَيَكُونُ مِنْهُ الشَّيْءُ قَدْ نَسِيتُهُ فَأَرَاهُ فَأَذْكُرُهُ كَمَا يَذْكُرُ الرَّجُلُ وَجْهَ الرَّجُلِ إِذَا غَابَ عَنْهُ ثُمَّ إِذَا رَآهُ عرفه. مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "Hudhaifa said:",
        "text": "God's messenger gave us an address on which occasion he left out nothing that would happen up to the last hour without telling of it. Some remembered and some forgot, and these companions of mine have known it. Some of it I have forgotten, but when I see it, I remember it, just as a man remembers another's face when he is away and recognizes him when he sees him. \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5379",
        "url": "https://sunnah.com/mishkat:5379"
      },
      "grade": "مُتَّفق عَلَيْهِ (الألباني)"
    },
    {
      "id": 2,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \n\" تُعْرَضُ الْفِتَنُ عَلَى الْقُلُوبِ كَالْحَصِيرِ عُودًا عُودًا فَأَيُّ قَلْبٍ أُشْرِبَهَا نَكَتَتْ فِيهِ نُكْتَةً سَوْدَاءَ وَأَيُّ قَلْبٍ أَنْكَرَهَا نُكِتَتْ فيهِ نُكْتَةٌ بَيْضَاءُ حَتَّى يَصِيرَ عَلَى قَلْبَيْنِ: أَبْيَضُ بِمثل الصَّفَا فَلَا تَضُرُّهُ فِتْنَةٌ مَا دَامَتِ السَّمَاوَاتُ وَالْأَرْضُ وَالْآخَرُ أَسْوَدُ مِرْبَادًّا كَالْكُوزِ مُجْخِيًّا لَا يَعْرِفُ مَعْرُوفًا وَلَا يُنْكِرُ مُنْكَرًا إِلَّا مَا أشْرب من هَوَاهُ \" رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "He told that he heard God's messenger say, \"Temptations will be presented to men's hearts as a reed mat is woven stick by stick, and any heart which is impregnated by them will have a black mark put in it, but any heart which rejects, them will have a white mark put in it. The result is that hearts will be of two kinds, one white like a white stone which will not be harmed by temptation as long as the heavens and the earth endure, and the other black and dust-colored like a vessel which is upset, not recognizing what is reputable or rejecting what is disreputable, but being impregnated with its passion.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5380",
        "url": "https://sunnah.com/mishkat:5380"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 3,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: حَدَّثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثَيْنِ رَأَيْتُ أَحَدَهُمَا وَأَنَا أَنْتَظِرُ الْآخَرَ: حَدَّثَنَا: «إِنَّ الْأَمَانَةَ نَزَلَتْ فِي جَذْرِ قُلُوبِ الرِّجَالِ ثُمَّ عَلِمُوا مِنَ الْقُرْآنِ ثُمَّ عَلِمُوا مِنَ السُّنَّةِ» . وَحَدَّثَنَا عَنْ رَفْعِهَا قَالَ: \n\" يَنَامُ الرَّجُلُ النَّوْمَةَ فَتُقْبَضُ الْأَمَانَةُ مِنْ قَلْبِهِ أَثَرُهَا مِثْلُ أَثَرِ الْوَكْتِ ثُمَّ يَنَامُ النَّوْمَةَ قتقبض فَيَبْقَى أَثَرُهَا مِثْلَ أَثَرِ الْمَجْلِ كَجَمْرٍ دَحْرَجْتَهُ عَلَى رِجْلِكَ فَنَفِطَ فَتَرَاهُ مُنْتَبِرًا وَلَيْسَ فِيهِ شَيْءٌ وَيُصْبِحُ النَّاسُ يَتَبَايَعُونَ وَلَا يَكَادُ أَحَدٌ يُؤَدِّي الْأَمَانَةَ فَيُقَالُ: إِنَّ فِي بَنِي فُلَانٍ رَجُلًا أَمِينًا وَيُقَالُ لِلرَّجُلِ: مَا أَعْقَلَهُ وَمَا أَظْرَفَهُ وَمَا أَجْلَدُهُ وَمَا فِي قَلْبِهِ مِثْقَالُ حَبَّةٍ مِنْ خَرْدَلٍ مِنْ إِيمَانٍ \". مُتَّفَقٌ عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "He said that God's messenger told them two traditions one of which he had seen happen and was looking forward to the other. He told them that faith had come down into the roots of men's hearts, then they gained knowledge from the Qur'an, then gained knowledge from the sunnah. He also told about its removal, saying, \"A man will sleep and faith will be taken from his heart, but its mark will remain like the mark of a spot. He will sleep again, and it will be taken away, its mark remaining like the mark of a blister, as when you drop live coals over your foot a water blister is produced and you see it swollen with nothing in it. People will make business agreements with one another and scarcely one will fulfil his trust. It will then be said that among the B. so and so there is a trustworthy man. People will remark how intelligent, excellent, and resolute a man is while he has not as much faith in his heart as a grain of mustard seed.\" \n1. Fitan pl of fitnah. There are different meanings, e.g., temptation, seduction; discord, commotion, civil war; testing, trial; impiety, unbelief. \n2. This may either be understood literally, or as a figure of speech for carelessness.\n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5381",
        "url": "https://sunnah.com/mishkat:5381"
      },
      "grade": "مُتَّفق عَلَيْهِ (الألباني)"
    },
    {
      "id": 4,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: كَانَ النَّاسُ يَسْأَلُونَ رَسُول الله صلى الله عَلَيْهِ وَسلم عَن الْخَيْرِ وَكُنْتُ أَسْأَلُهُ عَنِ الشَّرِّ مَخَافَةَ أَنْ يُدْرِكَنِي قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ إِنَّا كُنَّا فِي جَاهِلِيَّةٍ وَشَرٍّ فَجَاءَنَا اللَّهُ بِهَذَا الْخَيْرِ فَهَلْ بَعْدَ هَذَا الْخَيْرِ مِنْ شَرٍّ؟ قَالَ: «نَعَمْ» قُلْتُ: وَهَلْ بَعْدَ ذَلِكَ الشَّرِّ مِنْ خَيْرٍ؟ قَالَ: «نَعَمْ وَفِيهِ دَخَنٌ» . قُلْتُ: وَمَا دَخَنُهُ؟ قَالَ: «قَوْمٌ يَسْتَنُّونَ بِغَيْرِ سُنَّتِي وَيَهْدُونَ بِغَيْرِ هَدْيِي تَعْرِفُ مِنْهُمْ وَتُنْكِرُ» . قُلْتُ: فَهَلْ بَعْدَ ذَلِكَ الْخَيْرِ مِنْ شَرٍّ؟ قَالَ: «نَعَمْ دُعَاةٌ عَلَى أَبْوَابِ جَهَنَّمَ مَنْ أَجَابَهُمْ إِلَيْهَا قَذَفُوهُ فِيهَا» . قُلْتُ: يَا رَسُولَ اللَّهِ صِفْهُمْ لَنَا. قَالَ: «هُمْ مِنْ جِلْدَتِنَا وَيَتَكَلَّمُونَ بِأَلْسِنَتِنَا» . قُلْتُ: فَمَا تَأْمُرُنِي إِنْ أَدْرَكَنِي ذَلِكَ؟ قَالَ: «تَلْزَمُ جَمَاعَةَ الْمُسْلِمِينَ وَإِمَامَهُمْ» . قُلْتُ: فَإِنْ لَمْ يَكُنْ لَهُمْ جَمَاعَةٌ وَلَا إِمَامٌ؟ قَالَ: «فَاعْتَزِلْ تِلْكَ الْفِرَقَ كُلَّهَا وَلَوْ أَنْ تَعَضَّ بِأَصْلِ شَجَرَةٍ حَتَّى يُدْرِكَكَ الْمَوْتُ وَأَنْتَ عَلَى ذَلِكَ» . مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ لِمُسْلِمٍ: قَالَ: «يَكُونُ بَعْدِي أَئِمَّةٌ لَا يَهْتَدُونَ بِهُدَايَ وَلَا يَسْتَنُّونَ بِسُنَتِي وَسَيَقُومُ فِيهِمْ رِجَالٌ قُلُوبُهُمْ قُلُوبُ الشَّيَاطِينِ فِي جُثْمَانِ إِنْسٍ» . قَالَ حُذَيْفَةُ: قُلْتُ: كَيْفَ أَصْنَعُ يَا رَسُولَ اللَّهِ إِنْ أَدْرَكْتُ ذَلِكَ؟ قَالَ: تَسْمَعُ وَتُطِيعُ الْأَمِيرَ وَإِنْ ضَرَبَ ظهرك وَأخذ مَالك فاسمع وأطع \"",
      "english": {
        "narrator": "He said:",
        "text": "People used to ask God's messenger about good, but I used to ask him about evil from fear that it might overtake me. I said, \"Messenger of God, we were in a state of ignorance and evil, then God brought us this good. After this good will any evil come?\" On his replying that there would, I asked whether after that evil any good would come, and he replied that there would but that it would contain some duskiness. I asked what that would consist of and he replied, \"People will follow a sunnah other than mine and give guidance other than mine, so you will find in them both something to acknowledge and something to reject.\" I asked whether there would be any evil after that good and he replied, `Yes, there will be people who summon others at the gates of Jahannam into which they will cast those who respond to them.\" I asked God's messenger to describe them to us and he said, \"They will be of our stock and speak like us.\" I asked, what command he had to give me if that happened in my time and he replied, \"You must adhere to the community and the leader of the Muslims.\" I asked what I should do if they had neither community nor leader and he replied, \"Withdraw from all those factions even though you should have to cleave to the root of a tree till death overtakes you in that state.\" \n\n(Bukhari and Muslim.)\n\nIn a version by Muslim he said, \"After my death there will be leaders who follow neither my guidance nor my sunnah, among whom will arise men whose hearts will be the hearts of devils in human bodies.\" Hudhaifa said he asked God's messenger how he should act if he reached that time and he replied, \"You must hear and obey the ruler, and if he beats your back and takes your property you must still hear and obey.\"\n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5382",
        "url": "https://sunnah.com/mishkat:5382"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 5,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عَلَيْهِ وَسلم: «بَادرُوا بِالْأَعْمَالِ فِتناً كَقِطَعِ اللَّيْلِ الْمُظْلِمِ يُصْبِحُ الرَّجُلُ مُؤْمِنًا وَيُمْسِي كَافِرًا وَيُمْسِي مُؤْمِنًا وَيُصْبِحُ كَافِرًا يَبِيعُ دِينَهُ بِعرْض من الدُّنْيَا» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported God's messenger as saying, \"Do good deeds before trials come like portions of a dark night when a man will be a believer in the morning and an infidel in the evening, and a believer in the evening and an infidel in the morning, selling his religion for some worldly goods\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5383",
        "url": "https://sunnah.com/mishkat:5383"
      },
      "grade": "صَحِيحٌ (الألباني)"
    },
    {
      "id": 6,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «سَتَكُونُ فِتَنٌ الْقَاعِدُ فِيهَا خَيْرٌ مِنَ الْقَائِمِ وَالْقَائِمُ فِيهَا خَيْرٌ من الْمَاشِي والماشي فِيهِ خَيْرٌ مِنَ السَّاعِي مَنْ تَشَرَّفَ لَهَا تَسْتَشْرِفْهُ فَمن وجد ملْجأ أَو معَاذًا فليَعُذْ بِهِ» . مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ لِمُسْلِمٍ: قَالَ: «تَكُونُ فِتْنَةٌ النَّائِمُ فِيهَا خَيْرٌ مِنَ الْيَقْظَانِ واليقظانُ خَيْرٌ مِنَ الْقَائِمِ وَالْقَائِمُ فِيهَا خَيْرٌ مِنَ السَّاعِي فَمن وجد ملْجأ أومعاذا فليستعذ بِهِ»",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"There will be periods of commotion in which the one who sits will be better than the one who stands, the one who stands better than the one who walks and the one who walks better than the one who runs. He who contemplates them will be drawn by them, so he who finds a refuge or shelter should go to it.\" \n\n(Bukhari and Muslim.)\n\nIn a version by Muslim he said, \"There will be a commotion in which he who sleeps will be better than he who is awake, he who wakes will be better than he who stands up and he who stands up better than he who runs, so he who finds a refuge or shelter should go to it.\"\n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5384",
        "url": "https://sunnah.com/mishkat:5384"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 7,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي بَكْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّهَا سَتَكُونُ فِتَنٌ أَلَا ثُمَّ تَكُونُ فِتنٌ أَلا ثمَّ تكونُ فتنةٌ القاعدُ خَيْرٌ مِنَ الْمَاشِي فِيهَا وَالْمَاشِي فِيهَا خَيْرٌ مِنَ السَّاعِي إِلَيْهَا أَلَا فَإِذَا وَقَعَتْ فَمَنْ كَانَ لَهُ إِبل فَلْيَلْحَقْ بِإِبِلِهِ وَمَنْ كَانَ لَهُ غَنَمٌ فَلْيَلْحَقْ بغنمه وَمن كَانَت لَهُ أرضٌ فَلْيَلْحَقْ بِأَرْضِهِ» فَقَالَ رَجُلٌ: يَا رَسُولَ اللَّهِ أَرَأَيْتَ مَنْ لَمْ يَكُنْ لَهُ إِبِلٌ وَلَا غَنَمٌ وَلَا أَرْضٌ؟ قَالَ: «يَعْمِدُ إِلَى سَيْفِهِ فَيَدُقُّ عَلَى حَدِّهِ بِحَجَرٍ ثُمَّ لِيَنْجُ إِنِ اسْتَطَاعَ النَّجَاءَ اللَّهُمَّ هَلْ بَلَّغْتُ؟» ثَلَاثًا فَقَالَ: رَجُلٌ: يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ أُكْرِهْتُ حَتَّى ينْطَلق بِي إِلَى أحدالصفين فَضَرَبَنِي رَجُلٌ بِسَيْفِهِ أَوْ يَجِيءُ سَهْمٌ فَيَقْتُلُنِي؟ قَالَ: «يَبُوءُ بِإِثْمِهِ وَإِثْمِكَ وَيَكُونُ مِنْ أَصْحَابِ النَّار» رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Abu Bakra reported God's messenger as saying, \"Commotions will arise after which other commotions will arise, and then there will be a period of commotion in which the one who sits will be better than the one who walks and the one who walks better than the one who runs to it. When it happens, he who has camels should remain with his camels, he who has sheep should remain with his sheep, and he who has land should remain in his land.\" A man said, \"Tell us, messenger of God, about the one who has no camels, sheep or land,\" and he replied, \"He should go to his sword, strike its edge on a stone, and then escape if he can,\" adding three times, \"0 God, have I conveyed Thy message?\" A man then said, \"Tell me, messenger of God, suppose I am taken by force and made to join one of the ranks, and a man strikes me with his sword, or an arrow comes and kills me?\" He replied, \"He will bear the punishment of his sin and yours and go to hell.\" \n*This may be translated as \"I have conveyed,\" some grammarians saying that the particle hal is originally equivalent in meaning to qad. Cf. W. Wright, A grammar of the Arabic language, 2:309 C.\n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5385",
        "url": "https://sunnah.com/mishkat:5385"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 8,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يُوشِكُ أَنْ يَكُونَ خيرَ مالِ المسلمِ غنمٌ يتبع بهَا شغف الْجِبَالِ وَمَوَاقِعَ الْقَطْرِ يَفِرُّ بِدِينِهِ مِنَ الْفِتَنِ» . رَوَاهُ البُخَارِيّ",
      "english": {
        "narrator": "",
        "text": "Abu Sa'id reported God's messenger as saying, \"A Muslim's best property will soon be sheep which he will take to the tops of the mountains and the places where the rain falls, fleeing with his religion from civil strife.\" \n\nBukhari transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5386",
        "url": "https://sunnah.com/mishkat:5386"
      },
      "grade": "صَحِيحٌ (الألباني)"
    },
    {
      "id": 9,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أُسَامَةَ بْنِ زَيْدٍ قَالَ: أَشْرَفَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَى أُطُمٍ مِنْ آطَامِ الْمَدِينَةِ فَقَالَ: \" هَلْ تَرَوْنَ مَا أَرَى؟ قَالُوا: لَا. قَالَ: «فَإِنِّي لأرى الْفِتَن خلال بُيُوتكُمْ كوقع الْمَطَر» . مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Usama b. Zaid told that the Prophet looked down on one of the fortresses of Medina and asked, \"Do you see what I see?\" When his hearers replied that they did not, he said, \"I see civil commotions occurring among your houses like rain falling.\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5387",
        "url": "https://sunnah.com/mishkat:5387"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 10,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ\nأَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَلَكَةُ أُمَّتِي عَلَى يَدَي غِلْمةٍ مِنْ قُرْيشٍ» . رَوَاهُ البُخَارِيّ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported God's messenger as saying, \"The destruction of my people will be at the hands of young men of Quraish.\" \n\nBukhari transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5388",
        "url": "https://sunnah.com/mishkat:5388"
      },
      "grade": "صَحِيحٌ (الألباني)"
    },
    {
      "id": 11,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَتَقَارَبُ الزَّمَانُ وَيُقْبَضُ الْعِلَمُ وَتَظْهَرُ الْفِتَنُ وَيُلْقَى الشُّحُّ وَيَكْثُرُ الْهَرْجُ» قَالُوا: وَمَا الْهَرْجُ؟ قَالَ: «الْقَتْلُ» . مُتَّفَقٌ عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"When the time becomes short \n1. Literally, `when time is contracted'. The reference is to the approach of the last hour. \n2. Harj, meaning 'turmoil' or 'Rioting, a state of affairs which leads ta people being killed.\n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5389",
        "url": "https://sunnah.com/mishkat:5389"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 12,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" وَالَّذِي نَفْسِي بِيَدِهِ لَا تَذْهَبُ الدُّنْيَا حَتَّى يَأْتِي يَوْمٌ لَا يَدْرِي الْقَاتِلُ فِيمَ قَتَلَ؟ وَلَا الْمَقْتُولُ فِيمَ قُتِلَ؟ فَقِيلَ: كَيْفَ يَكُونُ ذَلِكَ؟ قَالَ: «الْهَرْجُ الْقَاتِلُ وَالْمَقْتُولُ فِي النَّارِ» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"By Him in whose hand my soul is, the world will not pass away till a day comes to mankind when the killer will not know why he killed, or the one who is killed why he was killed.\" He was asked how that could be and replied, \"There will be turmoil, and the killer and the one who is killed will go to hell.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5390",
        "url": "https://sunnah.com/mishkat:5390"
      },
      "grade": null
    },
    {
      "id": 13,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ مَعْقِلِ بْنِ يَسَارٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ «الْعِبَادَةُ فِي الْهَرْجِ كَهِجْرَةٍ إِلَيَّ» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Ma'qil b. Yasar reported God's messenger as saying, \"The reward for engaging in worship during the turmoil will be like that for coming to me as emigrants.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5391",
        "url": "https://sunnah.com/mishkat:5391"
      },
      "grade": null
    },
    {
      "id": 14,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنِ الزُّبَيْرِ بْنِ عَدِيٍّ قَالَ: أَتَيْنَا أَنَسَ بْنَ مَالِكٍ فَشَكَوْنَا إِلَيْهِ مَا نَلْقَى مِنَ الْحَجَّاجِ. فَقَالَ: «اصْبِرُوا فَإِنَّهُ لَا يَأْتِي عَلَيْكُمْ زمَان إِلَّا الَّذِي بعده أشرمنه حَتَّى تَلْقَوْا رَبَّكُمْ» . سَمِعْتُهُ مِنْ نَبِيِّكُمْ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. رَوَاهُ الْبُخَارِيُّ",
      "english": {
        "narrator": "Az-Zubair b. `Adi said:",
        "text": "We went to Anas b. Malik and complained to him of what we were suffering from al-Hajjaj, and he replied, \"Show endurance, for no time will come to you which will not be followed by one that is worse till you meet your Lord. I heard this from your Prophet.\"\n\nBukhari transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5392",
        "url": "https://sunnah.com/mishkat:5392"
      },
      "grade": null
    },
    {
      "id": 15,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "عَنْ حُذَيْفَةَ قَالَ: وَاللَّهِ مَا أَدْرِي أَنَسِيَ أَصْحَابِي أَمْ تَنَاسَوْا؟ وَاللَّهِ مَا تَرَكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ قَائِدِ فِتْنَةٍ إِلَى أَنْ تَنْقَضِيَ الدُّنْيَا يَبْلُغُ مَنْ مَعَهُ ثَلَاثَمِائَةٍ فَصَاعِدًا إِلَّا قَدْ سَمَّاهُ لَنَا بِاسْمِهِ وَاسْمِ أَبِيهِ واسمِ قبيلتِه. رَوَاهُ أَبُو دَاوُد",
      "english": {
        "narrator": "Hudhaifa said:",
        "text": "I swear by God that I do not know whether my companions have forgotten or have pretended to forget. I swear by God that God's messenger did not omit a leader of a wrong belief up to the end of the world whose followers reach the number of three hundred and upwards without mentioning to us his name, his father's name and the name of his tribe.\"\n\nAbu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5393",
        "url": "https://sunnah.com/mishkat:5393"
      },
      "grade": null
    },
    {
      "id": 16,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ ثَوْبَانَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّمَا أَخَافُ عَلَى أُمَّتِي الْأَئِمَّةَ الْمُضِلِّينَ وَإِذَا وُضِعَ السَّيْفُ فِي أُمَّتِي لَمْ يُرْفَعْ عَنْهُمْ إِلَى يَوْمِ الْقِيَامَةِ» . رَوَاهُ أَبُو دَاوُد والترمذيُّ",
      "english": {
        "narrator": "",
        "text": "Thauban reported God's messenger as saying, \"I fear for my people only the leaders who lead men astray, for when the sword is used among my people it will not be withdrawn from them till the day of resurrection.\" \n\nAbu Dawud and Tirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5394",
        "url": "https://sunnah.com/mishkat:5394"
      },
      "grade": null
    },
    {
      "id": 17,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَن سفينة قَالَ: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «الْخِلَافَةُ ثَلَاثُونَ سَنَةً ثُمَّ تَكُونُ مُلْكًا» . ثُمَّ يَقُولُ سَفِينَةُ: أَمْسِكْ: خِلَافَةَ أَبِي بَكْرٍ سَنَتَيْنِ وَخِلَافَةَ عُمَرَ عَشْرَةً وَعُثْمَانَ اثْنَتَيْ عَشْرَةَ وَعَلِيٍّ سِتَّةً. رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَأَبُو دَاوُدَ",
      "english": {
        "narrator": "Safina told that he heard the Prophet say, \"The Caliphate will last thirty years, then there will be a kingdom.\" Then Safina was saying:",
        "text": "Calculate Abu Bakr's Caliphate as two years, `Umar's as ten, `Uthman's as twelve, and `Ali's as six. \n\nAhmad, Tirmidhi and Abu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5395",
        "url": "https://sunnah.com/mishkat:5395"
      },
      "grade": null
    },
    {
      "id": 18,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ حُذَيْفَةَ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ أَيَكُونُ بَعْدَ هَذَا الْخَيْرِ شَرٌّ كَمَا كَانَ قَبْلَهُ شَرٌّ؟ قَالَ: «نَعَمْ» قُلْتُ: فَمَا الْعِصْمَةُ؟ قَالَ: «السَّيْفُ» قُلْتُ: وَهَلْ بَعْدَ السَّيْفِ بَقِيَّةٌ؟ قَالَ: «نعمْ تكونُ إِمارةٌ على أَقْذَاءٍ وَهُدْنَةٌ عَلَى دَخَنٍ» . قُلْتُ: ثُمَّ مَاذَا؟ قَالَ: «ثُمَّ يَنْشَأُ دُعَاةُ الضَّلَالِ فَإِنْ كَانَ لِلَّهِ فِي الْأَرْضِ خَلِيفَةٌ جَلَدَ ظَهْرَكَ وَأَخَذَ مَالَكَ فَأَطِعْهُ وَإِلَّا فَمُتْ وَأَنْتَ عَاضٌّ عَلَى جَذْلِ شَجَرَةٍ» . قُلْتُ: ثُمَّ مَاذَا؟ قَالَ: «ثُمَّ يَخْرُجُ الدَّجَّالُ بَعْدَ ذَلِكَ مَعَهُ نَهْرٌ وَنَارٌ فَمَنْ وَقَعَ فِي نَارِهِ وَجَبَ أَجْرُهُ وَحُطَّ وِزْرُهُ وَمَنْ وَقَعَ فِي نَهْرِهِ وَجَبَ وِزْرُهُ وحظ أَجْرُهُ» . قَالَ: قُلْتُ: ثُمَّ مَاذَا؟ قَالَ: «ثُمَّ يُنْتَجُ الْمُهْرُ فَلَا يُرْكَبُ حَتَّى تَقُومَ السَّاعَةُ» وَفِي رِوَايَة: «هُدْنَةٌ عَلَى دَخَنٍ وَجَمَاعَةٌ عَلَى أَقْذَاءٍ» . قُلْتُ: يَا رَسُولَ اللَّهِ الْهُدْنَةُ عَلَى الدَّخَنِ مَا هِيَ؟ قَالَ: «لَا ترجع قُلُوب أَقوام كَمَا كَانَتْ عَلَيْهِ» . قُلْتُ: بَعْدَ هَذَا الْخَيْرِ شَرٌّ؟ قَالَ: «فِتْنَةٌ عَمْيَاءُ صَمَّاءُ عَلَيْهَا دُعَاةٌ عَلَى أَبْوَابِ النَّارِ فَإِنْ مُتَّ يَا حُذَيْفَةُ وَأَنْتَ عَاضٌّ عَلَى جَذْلٍ خَيْرٌ لَكَ مِنْ أَنْ تتبع أحدا مِنْهُم» . رَوَاهُ أَبُو دَاوُد",
      "english": {
        "narrator": "",
        "text": "Hudhaifa told that he asked God's messenger whether there would be evil after this good just as there was evil before it, and when he was told that there would he asked wherein protection lay and was told that it lay in the sword. He asked if any would be spared after the use of the sword and he replied, \"Yes, there will be an amirate with specks in its eye and an illusory truce1.\" He asked what would come next and he replied, \"Then people who summon men to error will arise; and if God has in the earth a Caliph who flays your back and takes your property, obey him; otherwise die holding on to the stump of a tree.\" He asked what would come next and he replied, \"Then the dajjal will come forth accompanied by a river and a fire. He who falls into his fire will certainly get his reward and have his load taken off him, but he who falls into his river will have his load retained and his reward taken off him.\" He asked what would come next and he replied, \"Then a foal will be born but not ridden before the last hour comes.\" In a version he said, \"An illusory truce and a community with specks in its eye.\" He asked God's messenger what the illusory truce meant and he replied, \"The hearts of people will not return to their former condition.\" He asked whether there would be evil after that good and he replied, \"There will be wrong belief which will blind and deafen men to the truth2 in which there will be summoners at the gates of hell. If you, Hudhaifa, die adhering to a stump, it will be better for you than following any of them.\" \n\nAbu Dawud transmitted it.\n\n This is a free translation of the words hudna 'ala dakhan which mean literally \"a trace upon malice (or, evil disposition),\" indicating a trace which is liable to ho broken at any time. \n\n Literally, 'blind and deaf, wrong belief."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5396",
        "url": "https://sunnah.com/mishkat:5396"
      },
      "grade": null
    },
    {
      "id": 19,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَن أبي ذَر قَالَ: كُنْتُ رَدِيفًا خَلْفَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمًا علىحمار فَلَمَّا جَاوَزْنَا بُيُوتَ الْمَدِينَةِ قَالَ: «كَيْفَ بِكَ يَا أَبَا ذَرٍّ إِذَا كَانَ بِالْمَدِينَةِ جُوعٌ تَقُومُ عَنْ فِرَاشِكَ وَلَا تَبْلُغُ مَسْجِدَكَ حَتَّى يُجْهِدَكَ الْجُوعُ؟» قَالَ: قُلْتُ: اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: «تَعَفَّفْ يَا أَبَا ذَرٍّ» . قَالَ: «كَيْفَ بِكَ يَا أَبَا ذَرٍّ إِذَا كَانَ بِالْمَدِينَةِ مَوْتٌ يَبْلُغُ الْبَيْتَ الْعَبْدُ حَتَّى إِنَّهُ يُبَاعُ الْقَبْرُ بِالْعَبْدِ؟» . قَالَ: قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: «تَصْبِرُ يَا أَبَا ذَرٍّ» . قَالَ: «كَيْفَ بِكَ يَا أَبَا ذَرٍّ إِذَا كَانَ بِالْمَدِينَةِ قَتْلٌ تَغْمُرُ الدِّمَاءُ أَحْجَارَ الزَّيْتِ؟» قَالَ: قُلْتُ: اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: «تَأْتِي مَنْ أَنْتَ مِنْهُ» . قَالَ: قُلْتُ: وَأَلْبَسُ السِّلَاحَ؟ قَالَ: «شَارَكْتَ الْقَوْمَ إِذًا» . قُلْتُ: فَكَيْفَ أَصْنَعُ يَا رَسُولَ اللَّهِ؟ قَالَ: «إِنْ خَشِيتَ أَنْ يَبْهَرَكَ شُعَاعُ السَّيْفِ فَأَلْقِ نَاحِيَةَ ثَوْبِكَ عَلَى وَجْهِكَ لِيَبُوءَ بإِثمك وإِثمه» . رَوَاهُ أَبُو دَاوُد",
      "english": {
        "narrator": "Abu Dharr said:",
        "text": "One day I was riding behind God's messenger on a donkey, and when we had got beyond the houses of Medina he asked, \"How will you do, Abu Dharr, when there is famine in Medina and you get up from your bed but do not reach your mosque before being overcome by hunger?\" When I replied that God and His messenger knew best, he said, \"Restrain yourself, Abu Dharr.\" He then asked, \"How will you do, Abu Dharr, when there will be death in Medina and a house will be covered with blood?\" When I replied that God and His messenger knew best he said, \"You must go to those who are like-minded with you.\" I asked whether I should arm myself and replied, \"You would then associate yourself with the people.\" So I asked God's messenger how I should act and he replied, \"If you are afraid the gleam of the sword may dazzle you put the end of your garment over your face in order that [the one who kills you may bear the punishment of your sin and his.\" \n Used figuratively for a grave, the meaning being made more explicit in the words which follow.\n Ahjar Az-Zait, an area outside of Al Madinah.\n\nAbu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5397",
        "url": "https://sunnah.com/mishkat:5397"
      },
      "grade": null
    },
    {
      "id": 20,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ عَبْدِاللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كَيْفَ بِكَ إِذَا أُبْقِيتَ فِي حُثَالَةٍ مِنَ النَّاسِ مَرَجَتْ عُهُودُهُمْ وَأَمَانَاتُهُمْ؟ وَاخْتَلَفُوا فَكَانُوا هَكَذَا؟» وَشَبَّكَ بَيْنَ أَصَابِعِهِ. قَالَ: فَبِمَ تَأْمُرُنِي؟ قَالَ: «عَلَيْكَ بِمَا تَعْرِفُ وَدَعْ مَا تُنْكِرُ وَعَلَيْكَ بِخَاصَّةِ نَفْسِكَ وَإِيَّاكَ وَعَوَامِّهِمْ» . وَفِي رِوَايَةٍ: «الْزَمْ بَيْتَكَ وَأَمْلِكْ عَلَيْكَ لِسَانَكَ وَخُذْ مَا تَعْرِفُ وَدَعْ مَا تُنْكِرُ وَعَلَيْكَ بِأَمْرِ خَاصَّةِ نَفْسِكَ ودع أَمر الْعَامَّة» . رَوَاهُ التِّرْمِذِيّ وَصَححهُ",
      "english": {
        "narrator": "",
        "text": "`Abdallah b. `Amr b. al- `As reported the Prophet as saying, \"How will you do when you are left among dregs of mankind whose covenants and guarantees have been impaired, who have disagreed and become thus?\" intertwining his fingers. He asked what he ordered him to do and he replied, \"Keep to what you approve, abandon what you disapprove, attend to your own affairs and avoid the generality.\" A version has, \"Keep to your house, control your tongue, accept what you approve, abandon what you disapprove, attend to your own affairs and leave alone the affairs of the generality.\" \n\nTirmidhi transmitted it, calling it sahih."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5398",
        "url": "https://sunnah.com/mishkat:5398"
      },
      "grade": null
    },
    {
      "id": 21,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي مُوسَى عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهُ قَالَ: «إِنَّ بَيْنَ يَدَيِ السَّاعَةِ فِتَنًا كَقِطَعِ اللَّيْلِ الْمُظْلِمِ يُصْبِحُ الرَّجُلُ مُؤْمِنًا وَيُمْسِي كَافِرًا وَيُمْسِي مُؤْمِنًا وَيُصْبِحُ كَافِرًا الْقَاعِد خير من الْقَائِم والماشي خَيْرٌ مِنَ السَّاعِي فَكَسِّرُوا فِيهَا قِسِيَّكُمْ وَقَطِّعُوا فِيهَا أَوْتَارَكُمْ وَاضْرِبُوا سُيُوفَكُمْ بِالْحِجَارَةِ فَإِنْ دُخِلَ عَلَى أَحَدٍ مِنْكُمْ فَلْيَكُنْ كَخَيْرِ ابْنَيْ آدَمَ» . رَوَاهُ أَبُو دَاوُد. وَفِي رِوَايَة لَهُ (ضَعِيف)\n: «ذَكَرَ إِلَى قَوْلِهِ» خَيْرٌ مِنَ السَّاعِي \n\" ثُمَّ قَالُوا: فَمَا تَأْمُرُنَا؟ قَالَ: كُونُوا أَحْلَاسَ بُيُوتِكُمْ \". وَفِي رِوَايَةِ التِّرْمِذِيِّ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي الْفِتْنَةِ: «كَسِّرُوا فِيهَا قِسِيَّكُمْ وَقَطِّعُوا فِيهَا أَوْتَارَكُمْ وَالْزَمُوا فِيهَا أَجْوَافَ بُيُوتِكُمْ وَكُونُوا كَابْنِ آدَمَ» . وَقَالَ: هَذَا حديثٌ صحيحٌ غريبٌ",
      "english": {
        "narrator": "",
        "text": "Abu Musa reported the Prophet as saying, \"Before the last hour there will be commotions like pieces of a dark night in which a man will be a believer in the morning and an infidel in the evening, or a believer in the evening and an infidel in the morning. He who sits during them will be better than he who gets up and he who walks during them will be better than he who runs. So, break your bows during them, cut your bowstrings during them, and strike your swords on stones. If people then come in to one of you, let him be like the better of Adam's sons.\" A version by him has the same up to \"better than he who runs.\" It then says the people asked what he ordered them to do and he replied, \"Keep to your houses\".\n*The reference is to Abel who was killed by his brother Cain. \n\nAbu Dawud transmitted it.\n\nTirmidhi's version states that God's messenger said about the commotion, \"Break your bows during it, cut your bowstrings during it, keep to the inside of your houses during it, and be like Adam's son.\"\n \nTirmidhi transmitted it. He said this is a sahih gharib tradition."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5399",
        "url": "https://sunnah.com/mishkat:5399"
      },
      "grade": null
    },
    {
      "id": 22,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَن أم مَالك البهزية قَالَتْ: ذَكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِتْنَةً فَقَرَّبَهَا. قُلْتُ: يَا رَسُولَ اللَّهِ مَنْ خَيْرُ النَّاسِ فِيهَا؟ قَالَ: «رَجُلٌ فِي مَاشِيَتِهِ يُؤَدِّي حَقَّهَا وَيَعْبُدُ رَبَّهُ وَرَجُلٌ أَخَذَ برأسٍ فرأسه يخيف الْعَدو ويخوفونه» . رَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "Umm Malik al-Bahziya told that when God's messenger mentioned civil strife and its nearness she asked him who would be the best of the people during it and he replied, \"A man with his cattle who pays the zakat due on them and worships his Lord, and a man who holds his horse's head and causes fear to the enemy while they are causing him fear.\" \n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5400",
        "url": "https://sunnah.com/mishkat:5400"
      },
      "grade": null
    },
    {
      "id": 23,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ عَبْدِاللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «سَتَكُونُ فِتْنَةٌ تَسْتَنْظِفُ الْعَرَبَ قَتْلَاهَا فِي النَّارِ اللِّسَانُ فِيهَا أَشَدُّ مِنْ وَقْعِ السَّيْفِ» . رَوَاهُ التِّرْمِذِيُّ وَابْن مَاجَه",
      "english": {
        "narrator": "",
        "text": "`Abdallah b. `Amr reported God's messenger as saying, \"There will be civil strife which will wipe out the Arabs, and their slain will go to hell. During it the tongue will be more severe than blows of the sword.\"\n\nTirmidhi and Ibn Majah transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5401",
        "url": "https://sunnah.com/mishkat:5401"
      },
      "grade": null
    },
    {
      "id": 24,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «سَتَكُونُ فِتْنَةٌ صَمَّاءُ بكماء عمياءُ مَنْ أَشْرَفَ لَهَا اسْتَشْرَفَتْ لَهُ وَإِشْرَافُ اللِّسَانِ فِيهَا كوقوع السَّيْف» . رَوَاهُ أَبُو دَاوُد",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported God's messenger as saying, \"There will be civil strife which will render people deaf, dumb, and blind regarding what is right. Those who contemplate it will be drawn by it, and giving rein to the tongue during it will be like smiting with the sword.\" \n\nAbu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5402",
        "url": "https://sunnah.com/mishkat:5402"
      },
      "grade": null
    },
    {
      "id": 25,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ قَالَ: كُنَّا قُعُودًا عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَذَكَرَ الْفِتَنَ فَأَكْثَرَ فِي ذِكْرِهَا حَتَّى ذَكَرَ فِتْنَةَ الْأَحْلَاسِ فَقَالَ قَائِلٌ: وَمَا فِتْنَةُ الْأَحْلَاسِ. قَالَ: \n\" هِيَ هَرَبٌ وَحَرَبٌ ثُمَّ فِتْنَةُ السَّرَّاءِ دَخَنُهَا مِنْ تَحْتِ قَدَمَيْ رَجُلٍ مِنْ أَهْلِ بَيْتِي يَزْعُمُ أَنَّهُ مِنِّي وَلَيْسَ مِنِّي إِنَّمَا أَوْلِيَائِي الْمُتَّقُونَ ثُمَّ يَصْطَلِحُ النَّاسُ عَلَى رَجُلٍ كورك على ضلع ثمَّ فتْنَة الدهماء لَا تَدَعُ أَحَدًا مِنْ هَذِهِ الْأُمَّةِ إِلَّا لَطْمَتْهُ لَطْمَةً فَإِذَا قِيلَ: انْقَضَتْ تَمَادَتْ يُصْبِحُ الرَّجُلُ فِيهَا مُؤْمِنًا وَيُمْسِي كَافِرًا حَتَّى يَصِيرَ النَّاسُ إِلَى فُسْطَاطَيْنِ: فُسْطَاطِ إِيمَانٍ لَا نِفَاقَ فِيهِ وَفُسْطَاطِ نِفَاقٍ لَا إِيمَانَ فِيهِ. فَإِذَا كَانَ ذَلِكَ فَانْتَظِرُوا الدَّجَّالَ مِنْ يَوْمِهِ أَوْ من غده \". رَوَاهُ أَبُو دَاوُد",
      "english": {
        "narrator": "`Abdallah b. `Amr said:",
        "text": "When we were sitting with the Prophet he mentioned periods of commotion, mentioning many of them, and when he mentioned the one when people should keep to their houses someone asked him the meaning of that and he replied, \"It will be flight and plunder. Then will come a testing which is pleasing, its murkiness being due to the fact that it is raised by a man from the people of my house who will assert that he belongs to me whereas he does not, for my friends are only the God-fearing. Then the people will unite under a man who will be like a hip-bone on a rib. Then there will be the little black commotion which will leave none of this people without giving him a slap, and when people say it is finished it will be extended. During it a man will be a believer in the morning and an infidel in the evening, so that the people will be in two camps, the camp of faith which will contain no hypocrisy and the camp of hypocrisy which will contain no faith. When that happens, expect the dajjal that day or the next.\" \n*A figure of speech indicating instability.\n\nAbu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5403",
        "url": "https://sunnah.com/mishkat:5403"
      },
      "grade": null
    },
    {
      "id": 26,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «وَيْلٌ لِلْعَرَبِ مِنْ شَرٍّ قَدِ اقْتَرَبَ أَفْلَحَ مَنْ كَفَّ يَدَهُ» . رَوَاهُ أَبُو دَاوُد",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported the Prophet as saying, \"Woe to the Arabs because of evil which has drawn near! He will escape who restrains his hand.\" \n\nAbu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5404",
        "url": "https://sunnah.com/mishkat:5404"
      },
      "grade": null
    },
    {
      "id": 27,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَن الْمِقْدَاد بن الْأسود قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ السَّعِيدَ لَمَنْ جُنِّبَ الْفِتَنَ إِنَّ السَّعِيدَ لَمَنْ جُنِّبَ الْفِتَنَ إِنَّ السَّعِيدَ لَمَنْ جُنِّبَ الْفِتَنَ وَلَمَنِ ابْتُلِيَ فَصَبَرَ فَوَاهًا» . رَوَاهُ أَبُو دَاوُد",
      "english": {
        "narrator": "",
        "text": "Al-Miqdad b. al-Aswad told that he heard God's messenger say, \"The happy man is he who avoids dissensions; the happy man is he who avoids dissensions; the happy man is he who avoids dissensions; but how fine is the man who is afflicted and shows endurance.\" \n\nAbu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5405",
        "url": "https://sunnah.com/mishkat:5405"
      },
      "grade": null
    },
    {
      "id": 28,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ ثَوْبَانَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا وُضِعَ السَّيْفُ فِي أُمَّتِي لَمْ يُرْفَعْ عَنْهَا إِلَى يَوْمِ الْقِيَامَةِ وَلَا تَقُومُ السَّاعَةُ حَتَّى تَلْحَقَ قَبَائِلُ مِنْ أُمَّتِي بِالْمُشْرِكِينَ وَحَتَّى تَعْبُدَ قَبَائِلُ مِنْ أُمَّتِي الْأَوْثَانَ وَإِنَّهُ سَيَكُونُ فِي أُمَّتِي كَذَّابُونَ ثَلَاثُونَ كُلُّهُمْ يَزْعُمُ أَنَّهُ نَبِيُّ اللَّهِ وَأَنَا خَاتَمُ النَّبِيين لَا نَبِيَّ بِعْدِي وَلَا تَزَالُ طَائِفَةٌ مِنْ أُمَّتِي عَلَى الْحَقِّ ظَاهِرِينَ لَا يَضُرُّهُمْ مَنْ خَالَفَهُمْ حَتَّى يَأْتِيَ أَمْرُ اللَّهِ» . رَوَاهُ أَبُو دَاوُدَ",
      "english": {
        "narrator": "",
        "text": "Thauban reported God's messenger as saying, \"When the sword is used among my people it will not be withdrawn from them till the day of resurrection, and the last hour will not come before tribes of my people attach themselves to the polytheists and tribes of my people worship idols. There will be among my people thirty great liars each of them asserting that he is God's prophet, whereas I am the seal of the prophets after whom there will be no prophet; but a section of my people will continue to hold to the truth till God's command comes and will prevail and will not be injured by those who oppose them.\" \n\nAbu Dawud and Tirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5406",
        "url": "https://sunnah.com/mishkat:5406"
      },
      "grade": null
    },
    {
      "id": 29,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «تَدُورُ رَحَى الْإِسْلَامِ لِخَمْسٍ وَثَلَاثِينَ أَوْ سِتٍّ وَثَلَاثِينَ أَوْ سَبْعٍ وَثَلَاثِينَ فَإِنْ يَهْلِكُوا فَسَبِيلُ مَنْ هَلَكَ وَإِنْ يَقُمْ لَهُمْ دِينُهُمْ يَقُمْ لَهُمْ سَبْعِينَ عَامًا» . قُلْتُ: أَمِمَّا بَقِيَ أَوْ مِمَّا مَضَى؟ قَالَ: «مِمَّا مضى» . رَوَاهُ أَبُو دَاوُد",
      "english": {
        "narrator": "",
        "text": "`Abdallah b. Mas'ud reported the Prophet as saying, \"The mill of Islam will go round till the year 35, or 36, or 37, then if they perish, they will have followed the path of those who perished before them, but if their religion is maintained for them, it will be maintained for them for seventy years.\" He asked him whether that meant seventy years more or seventy altogether, and he replied that it meant seventy altogether. \n\nAbu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5407",
        "url": "https://sunnah.com/mishkat:5407"
      },
      "grade": null
    },
    {
      "id": 30,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "عَن أبي واقدٍ اللَّيْثِيّ: أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَمَّا خَرَجَ إِلَى غَزْوَةِ حُنَيْنٍ مَرَّ بِشَجَرَةٍ لِلْمُشْرِكِينَ كَانُوا يُعَلِّقُونَ عَلَيْهَا أَسْلِحَتَهُمْ يُقَالُ لَهَا: ذَاتُ أَنْوَاطٍ. فَقَالُوا: يَا رَسُولَ اللَّهِ اجْعَلْ لَنَا ذَاتَ أَنْوَاطٍ كَمَا لَهُمْ ذَاتُ أَنْوَاطٍ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «سُبْحَانَ اللَّهِ هَذَا كَمَا قَالَ قَوْمُ مُوسَى (اجْعَل لنا إِلَهًا كَمَا لَهُم آلهةٌ)\nوَالَّذِي نَفْسِي بِيَدِهِ لَتَرْكَبُنَّ سُنَنَ مَنْ كَانَ قبلكُمْ» . رَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "Abu Waqid al-Laithi told that when God's messenger went out to the battle of Hunain, he passed a tree called Dhat Anwat belonging to the polytheists on which they hung their weapons. The people asked him to appoint a Dhat Anwat for them just as those people had one, to which God's messenger replied, \"Glory be to God! This is like what the people of Moses said when they asked him to appoint them a god just as other peoples had gods. By Him in whose hand my soul is, you will certainly follow the practices of your predecessors.\"\n*The tree was an object of pagan worship. Its name means that it had things hung on it. \n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5408",
        "url": "https://sunnah.com/mishkat:5408"
      },
      "grade": null
    },
    {
      "id": 31,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَن ابْن الْمسيب قَالَ: وَقَعَتِ الْفِتْنَةُ الْأُولَى - يَعْنِي مَقْتَلَ عُثْمَانَ - فَلَمْ يَبْقَ مِنْ أَصْحَابٍ بَدْرٍ أَحَدٌ ثُمَّ وَقَعَتِ الْفِتْنَةُ الثَّانِيَةُ - يَعْنِي الْحَرَّةَ - فَلَمْ يَبْقَ مِنْ أَصْحَابِ الْحُدَيْبِيَةِ أَحَدٌ ثُمَّ وَقَعَتِ الْفِتْنَةُ الثَّالِثَةُ فَلَمْ تَرْتَفِعْ وَبِالنَّاسِ طَبَاخٌ. رَوَاهُ الْبُخَارِيُّ",
      "english": {
        "narrator": "Ibn al-Musayyib said:",
        "text": "When the first civil strife occurred, i.e., the assassination of `Uthman, not one of those who had been at Badr remained; when the second occurred, i.e., the Harra, not one of those who had been at al-Hudaibiya remained; and the third \n\n1. Probably a reference to 'Abdallah b. az-Zubair who claimed the Caliphate and was killed in 73 A.H. when al-Hajjaj stormed Mecca. \n2. See Bukhari, Maghazi, 12, where the wording is slightly different. Qastallani remarks that tabakh means `intelligence,' but some say 'strength' and also `remains of good in the religion'. I have used the meaning he prefers, but one might use 'strength' which is said to be the basic meaning. Lane gives 'firmness,' 'soundness,' `strength and fatness', 'intelligence' and `good,' Cf. Mirqat. v, 153.\n\nBukhari transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5409",
        "url": "https://sunnah.com/mishkat:5409"
      },
      "grade": null
    },
    {
      "id": 32,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم قا ل: \n\" لَا تَقُومُ السَّاعَةُ حَتَّى تَقْتَتِلَ فِئَتَانِ عَظِيمَتَانِ تَكُونُ بَيْنَهُمَا مَقْتَلَةٌ عَظِيمَةٌ دَعَوَاهُمَا وَاحِدَةٌ وَحَتَّى يبْعَث دجالون كذابون قريب مِنْ ثَلَاثِينَ كُلُّهُمْ يَزْعُمُ أَنَّهُ رَسُولُ اللَّهِ وَحَتَّى يُقْبَضَ الْعِلْمُ وَتَكْثُرَ الزَّلَازِلُ وَيَتَقَارَبَ الزَّمَانُ وَيظْهر الْفِتَنُ وَيَكْثُرَ الْهَرْجُ وَهُوَ الْقَتْلُ وَحَتَّى يَكْثُرَ فِيكُمُ الْمَالُ فَيَفِيضَ حَتَّى يُهِمَّ رَبَّ الْمَالِ مَنْ يَقْبَلُ صَدَقَتَهُ وَحَتَّى يَعْرِضَهُ فَيَقُولُ الَّذِي يعرضه عَلَيْهِ: لَا أَرَبَ لِي بِهِ وَحَتَّى يَتَطَاوَلَ النَّاسُ فِي الْبُنْيَانِ وَحَتَّى يَمُرَّ الرَّجُلُ بِقَبْرِ الرَّجُلِ فَيَقُولُ: يَا لَيْتَنِي مَكَانَهُ وَحَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا فَإِذَا طَلَعَتْ وَرَآهَا النَّاسُ آمَنُوا أَجْمَعُونَ فَذَلِكَ حِينَ (لَا يَنْفَعُ نَفْسًا إِيمَانُهَا لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ أَوْ كَسَبَتْ فِي إِيمَانِهَا خَيْرًا)\nوَلَتَقُومَنَّ السَّاعَةُ وَقَدْ نَشَرَ الرَّجُلَانِ ثَوْبَهُمَا بَيْنَهُمَا فَلَا يَتَبَايَعَانِهِ وَلَا يَطْوِيَانِهِ وَلَتَقُومَنَّ السَّاعَةُ وَقَدِ انْصَرَفَ الرَّجُلُ بِلَبَنِ لِقْحَتِهِ فَلَا يَطْعَمُهُ وَلَتَقُومَنَّ السَّاعَةُ وَهُوَ يُلِيطُ حَوْضَهُ فَلَا يَسْقِي فِيهِ وَلَتَقُومَنَّ السَّاعَةُ وَقَدْ رَفَعَ أُكْلَتَهُ إِلَى فِيهِ فَلَا يطْعمهَا \". مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported God's messenger as saying, \"The last hour will not come before two parties which make the same profession fight together and a great slaughter results, before about thirty lying dajjals are sent forth each of them asserting that he is God's messenger, before knowledge is withheld, earthquakes are abundant, the time becomes short, dissensions appear, and there is much harj, which means slaughter, before wealth is abundant and overflowing among you, before one who possesses property is anxious to find someone who will accept his sadaqa, before he offers it and the one to whom it is offered says he has no need of it, before people try to outstrip one another in building, before a man passes another's grave and expresses the desire that he were in his place, and before the sun rises in its place of setting. Then when it rises and people see it, they will all believe, but that is a time when a soul will not be benefited by faith it did not have before, or acquire any good from its faith. The last hour will certainly come when two men have spread out their garment between them, but they will not complete the transaction or fold up the garment; the last hour will certainly come when a man has gone off with the milk of his milch camel, but he will not taste it; the last hour will certainly come when a man is repairing his tank, but he will not water his camels from it; and the last hour will certainly come when one has raised his food to his mouth, but he will not taste it.\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5410",
        "url": "https://sunnah.com/mishkat:5410"
      },
      "grade": "مُتَّفق عَلَيْهِ (الألباني)"
    },
    {
      "id": 33,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَقُومُ السَّاعَةُ حَتَّى تُقَاتِلُوا قَوْمًا نِعَالُهُمُ الشَّعْرُ وَحَتَّى تُقَاتِلُوا التُّرْكَ صِغَارَ الْأَعْيُنِ حُمْرَ الْوُجُوهِ ذُلْفَ الْأُنُوفِ كأنَّ وجوهَهُم المجَانُّ المُطْرَقة» . مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"The last hour will not come before you fight with a people whose sandals are of hair, and before you fight with the Turks who have small eyes, red faces, short noses, whose faces look as if they were shields covered with skin.\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5411",
        "url": "https://sunnah.com/mishkat:5411"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 34,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَقُومُ السَّاعَةُ حَتَّى تُقَاتِلُوا خُوزًا وَكِرْمَانَ مِنَ الْأَعَاجِمِ حُمْرَ الْوُجُوهِ فُطْسَ الْأُنُوفِ صِغَارَ الْأَعْيُنِ وُجُوهُهُمُ الْمَجَانُّ الْمُطْرَقَةُ نِعَالُهُمُ الشّعْر» . رَوَاهُ البُخَارِيّ\nوَفِي راوية لَهُ وَعَن عَمْرو بن تغلب: «عراض الْوُجُوه»",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"The last hour will not come before you fight with Khuz and Kirman who are foreigners with red faces, snub noses and small eyes, whose faces look as if they were shields covered with skin and whose sandals are of hair.\" \n*Yaqut, Mu'jam, ii, 494, says Khuz is used both of Khuzistan and of its people. The districts mentioned are in what is now Iran. \n\nBukhari transmitted it. A version of his on the authority of `Amr b. Taghlib has ``broad faces.\""
      },
      "reference": {
        "text": "Mishkat al-Masabih 5412, 5413",
        "url": "https://sunnah.com/mishkat:5412"
      },
      "grade": "صَحِيحٌ, لم تتمّ دراسته (الألباني)"
    },
    {
      "id": 35,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" لَا تَقُومُ السَّاعَةُ حَتَّى يُقَاتِلَ الْمُسْلِمُونَ الْيَهُودَ فَيَقْتُلُهُمُ الْمُسْلِمُونَ حَتَّى يختبئ الْيَهُودِيُّ مِنْ وَرَاءِ الْحَجَرِ وَالشَّجَرِ فَيَقُولُ الْحَجَرُ وَالشَّجَرُ: يَا مُسْلِمُ يَا عَبْدَ اللَّهِ هَذَا يَهُودِيٌّ خَلْفِي فَتَعَالَ فَاقْتُلْهُ إِلَّا الْغَرْقَدَ فَإِنَّهُ من شجر الْيَهُود \". رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"The last hour will not come before the Muslims fight the Jews and the Muslims kill them, so that Jews will hide behind stones and trees and the stone and the tree will say, `O Muslim, O servant of God, there is a Jew behind me; come and kill him.' The only exception will be the box-thorn, for it is one of the trees of the Jews.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5414",
        "url": "https://sunnah.com/mishkat:5414"
      },
      "grade": "صَحِيحٌ (الألباني)"
    },
    {
      "id": 36,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَقُومُ السَّاعَةُ حَتَّى يَخْرُجَ رَجُلٌ مِنْ قَحْطَانَ يَسُوقُ النَّاسَ بعصاه» . مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"The last hour will not come before a man of Qahtan comes forth driving people with his stick.\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5415",
        "url": "https://sunnah.com/mishkat:5415"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 37,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" لَا تَذْهَبُ الْأَيَّامُ وَاللَّيَالِي حَتَّى يَمْلِكَ رَجُلٌ يُقَالُ لَهُ: الْجَهْجَاهُ \". وَفِي رِوَايَةٍ: \" حَتَّى يَمْلِكَ رَجُلٌ مِنَ الْمَوَالِي يُقَالُ لَهُ: الجَهجاه \". رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"Days and nights will not pass away before a man called al-Jahjah rules.\" A version has \"Before one of the clients called al-Jahjah rules.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5416",
        "url": "https://sunnah.com/mishkat:5416"
      },
      "grade": "صَحِيحٌ (الألباني)"
    },
    {
      "id": 38,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَتَفْتَحَنَّ عِصَابَةٌ مِنَ الْمُسْلِمِينَ كَنْزَ آلِ كِسْرَى الَّذِي فِي الْأَبْيَض» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Jabir b. Samura told that he heard God's messenger say, \"A band of the Muslims will certainly gain the treasure of the family of Kisra which is in al-Abyad.\" *\n*A fortress in the Persian capital al-Mada'in.  \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5417",
        "url": "https://sunnah.com/mishkat:5417"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 39,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَلَكَ كِسْرَى فَلَا يَكُونُ كِسْرَى بَعْدَهُ وَقَيْصَرُ لِيَهْلِكَنَّ ثُمَّ لَا يَكُونُ قَيْصَرُ بَعْدَهُ وَلَتُقْسَمَنَّ كُنُوزُهُمَا فِي سَبِيلِ اللَّهِ» وَسَمَّى «الْحَرْبُ خُدْعَةٌ» . مُتَّفَقٌ عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported God's messenger as saying, \"Kisra will perish and there will be no Kisra after him, Qaisar will certainly perish and there will be no Qaisar after him, and their treasures will certainly be divided in God's path.\" He also called war a method of deceit. \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5418",
        "url": "https://sunnah.com/mishkat:5418"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 40,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ نَافِعِ بْنِ عُتْبَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَغْزُونَ جَزِيرَةَ الْعَرَبِ فَيَفْتَحُهَا اللَّهُ ثُمَّ فَارِسَ فَيَفْتَحُهَا اللَّهُ ثُمَّ تَغْزُونَ الرُّومَ فَيَفْتَحُهَا اللَّهُ ثُمَّ تَغْزُونَ الدَّجَّال فيفتحه الله» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Nafi' b. `Utba reported God's messenger as saying, \"You will attack Arabia and God will conquer it; then Persia and God will conquer it; then you will attack the Byzantines and God will conquer them; then you will attack the dajjal and God will conquer him.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5419",
        "url": "https://sunnah.com/mishkat:5419"
      },
      "grade": null
    },
    {
      "id": 41,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَن عَوْف بن مَالك قَالَ: أَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي غَزْوَةٍ تَبُوكَ وَهُوَ فِي قُبَّةٍ مِنْ أَدَمٍ فَقَالَ: \n\" اعْدُدْ سِتًّا بَيْنَ يَدَيِ السَّاعَةِ: مَوْتِي ثُمَّ فَتْحُ بَيْتِ الْمَقْدِسِ ثُمَّ مُوتَانٌ يَأْخُذُ فِيكُمْ كَقُعَاصِ الْغَنَمِ ثُمَّ اسْتِفَاضَةُ الْمَالِ حَتَّى يُعْطَى الرَّجُلُ مِائَةَ دِينَارٍ فَيَظَلُّ سَاخِطًا ثُمَّ فِتْنَةٌ لَا يَبْقَى بَيْتٌ مِنَ الْعَرَبِ إِلَّا دَخَلَتْهُ ثُمَّ هُدْنَةٌ تَكُونُ بَيْنَكُمْ وَبَيْنَ بَنِي الْأَصْفَرِ فَيَغْدِرُونَ فَيَأْتُونَكُمْ تَحْتَ ثَمَانِينَ غَايَةً تَحْتَ كُلِّ غَايَةٍ اثْنَا عَشَرَ أَلْفًا \". رَوَاهُ البُخَارِيّ",
      "english": {
        "narrator": "'Auf b. Malik said :",
        "text": "I came to the Prophet at the expedition to Tabuk when he was in a leather tent, and he said, \"Count six signs before the last hour comes: my death, then the conquest of Jerusalem, then a mortal disease which will affect you like qu'as in sheep, then a superabundance of wealth so that when a man is given a hundred dinars he will remain displeased, then a civil strife which will leave no house of the Arabs without entering it, then a truce between you and the Greeks who will act treacherously and come to you under eighty banners with twelve thousand under each.\" \n*A disease affecting sheep and goats which causes an exudation from the nose and results in speedy death. \n\nBukhari transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5420",
        "url": "https://sunnah.com/mishkat:5420"
      },
      "grade": null
    },
    {
      "id": 42,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" لَا تَقُومُ السَّاعَةُ حَتَّى يَنْزِلَ الرُّومُ بِالْأَعْمَاقِ أَوْ بِدَابِقَ فَيَخْرُجُ إِلَيْهِمْ جَيْشٌ مِنَ الْمَدِينَةِ مِنْ خِيَارِ أَهْلِ الْأَرْضِ يَوْمَئِذٍ فَإِذَا تَصَافُّوا قَالَتِ الرُّومُ: خَلُّوا بَيْنَنَا وَبَيْنَ الَّذِينَ سَبَوْا مِنَّا نُقَاتِلْهُمْ فَيَقُولُ الْمُسْلِمُونَ: لَا وَاللَّهِ لَا نُخَلِّي بَيْنَكُمْ وَبَيْنَ إِخْوَانِنَا فَيُقَاتِلُونَهُمْ فَيَنْهَزِمُ ثُلُثٌ لَا يَتُوبُ اللَّهُ عَلَيْهِمْ أَبَدًا وَيُقْتَلُ ثُلُثُهُمْ أَفْضَلُ الشُّهَدَاءِ عِنْدَ اللَّهِ وَيَفْتَتِحُ الثُّلُثُ لَا يُفْتَنُونَ أَبَدًا فَيَفْتَتِحُونَ قسطنطينية فَبينا هُمْ يَقْتَسِمُونَ الْغَنَائِمَ قَدْ عَلَّقُوا سُيُوفَهُمْ بِالزَّيْتُونِ إِذْ صَاحَ فِيهِمُ الشَّيْطَانُ: إِنَّ الْمَسِيحَ قَدْ خَلَفَكُمْ فِي أَهْلِيكُمْ فَيَخْرُجُونَ وَذَلِكَ بَاطِلٌ فَإِذَا جاؤوا الشامَ خرجَ فَبينا هُمْ يُعِدُّونَ لِلْقِتَالِ يُسَوُّونَ الصُّفُوفَ إِذْ أُقِيمَتِ الصَّلَاة فَينزل عِيسَى بن مَرْيَمَ فَأَمَّهُمْ فَإِذَا رَآهُ عَدُوُّ اللَّهِ ذَابَ كَمَا يَذُوبُ الْمِلْحُ فِي الْمَاءِ فَلَوْ تَرَكَهُ لَانْذَابَ حَتَّى يَهْلِكَ وَلَكِنْ يَقْتُلُهُ اللَّهُ بِيَدِهِ فيريهم دَمه فِي حربته \". رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported God's messenger as saying, \"The last hour will not come before the Byzantines alight in al-A`maq or in Dabiq were to leave him he would dissolve completely; but God will kill him by his hand and he will show them his blood on his spear.\" \n Mirqat, 5:159. quotes the view that al-A'maq is on the outskirts of Medina and that L'abiq (or Dabaq) is a market-place in Medina. Yaqut, iii, 513. says Dabiq is a village near Aleppo, and (1:316) al-A'maq is a district near Dabiq between Aleppo and Antioch. \n  i.e., Jesus. \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5421",
        "url": "https://sunnah.com/mishkat:5421"
      },
      "grade": null
    },
    {
      "id": 43,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: إِنَّ الساعةَ لَا تقومُ حَتَّى لَا يُقْسَمَ ميراثٌ وَلَا يُفْرَحَ بِغَنِيمَةٍ. ثُمَّ قَالَ: عَدُوٌّ يَجْمَعُونَ لِأَهْلِ الشَّامِ وَيَجْمَعُ لَهُمْ أَهْلُ الْإِسْلَامِ (يَعْنِي الرّوم)\nفيتشرَّطُ الْمُسْلِمُونَ شُرْطَةً لِلْمَوْتِ لَا تَرْجِعُ إِلَّا غَالِبَةً فَيَقْتَتِلُونَ حَتَّى يَحْجِزَ بَيْنَهُمُ اللَّيْلُ فَيَفِيءُ هَؤُلَاءِ وَهَؤُلَاء كل غير غَالب وتفنى الشرطة ثمَّ يَتَشَرَّطُ الْمُسْلِمُونَ شُرْطَةً لِلْمَوْتِ لَا تَرْجِعُ إِلَّا غالبة فيقتتلون حت يَحْجِزَ بَيْنَهُمُ اللَّيْلُ فَيَفِيءُ هَؤُلَاءِ وَهَؤُلَاءِ كُلٌّ غير غَالب وتفنى الشرطة ثمَّ يشْتَرط الْمُسْلِمُونَ شُرْطَةً لِلْمَوْتِ لَا تَرْجِعُ إِلَّا غَالِبَةً فيقتتلون حَتَّى يُمْسُوا فَيَفِيءُ هَؤُلَاءِ وَهَؤُلَاءِ كُلٌّ غَيْرُ غَالِبٍ وَتَفْنَى الشُّرْطَةُ فَإِذَا كَانَ يَوْمُ الرَّابِعِ نَهَد إِليهم بقيةُ أهلِ الإِسلام فيجعلُ الله الدَبَرةَ عَلَيْهِم فيقتلون مَقْتَلَةً لَمْ يُرَ مِثْلُهَا حَتَّى إِنَّ الطَّائِرَ ليمر يجنابتهم فَلَا يُخَلِّفُهُمْ حَتَّى يَخِرَّ مَيِّتًا فَيَتَعَادَّ بَنُو الْأَبِ كَانُوا مِائَةً فَلَا يَجِدُونَهُ بَقِيَ مِنْهُمْ إِلَّا الرَّجُلُ الْوَاحِدُ فَبِأَيِّ غَنِيمَةٍ يُفْرَحُ أَوْ أيّ مِيرَاث يقسم؟ فَبينا هُمْ كَذَلِكَ إِذْ سَمِعُوا بِبَأْسٍ هُوَ أَكْبَرُ مِنْ ذَلِكَ فَجَاءَهُمُ الصَّرِيخُ: أَنَّ الدَّجَّالَ قَدْ خَلَفَهُمْ فِي ذَرَارِيِّهِمْ فَيَرْفُضُونَ مَا فِي أَيْدِيهِمْ وَيُقْبِلُونَ فَيَبْعَثُونَ عَشْرَ فَوَارِسَ طَلِيعَةً \". قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنِّي لَأَعْرِفُ أَسْمَاءَهُمْ وَأَسْمَاءَ آبَائِهِمْ وَأَلْوَانَ خُيُولِهِمْ هُمْ خَيْرُ فَوَارِسَ أَوْ مِنْ خَيْرِ فَوَارِسَ عَلَى ظَهْرِ الأَرْض يَوْمئِذٍ» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "Abdallah b. Mas'ud said:",
        "text": "The last hour will not come before an inheritance cannot be divided and people do not rejoice over spoil. Then an enemy will equip itself against the people of Syria and the Islamic people will equip themselves against them, meaning the Byzantines. The Muslims will then prepare a suicide squad which will return only if victorious and they will fight till the night intervenes. Both sides will return not having gained the victory, but the squad will be wiped out. The Muslims will again prepare a suicide squad which will return only if victorious and they will fight till the night intervenes. Both sides will return not having gained the victory, but the squad will be wiped out. The Muslims will again prepare a suicide squad which will return only if victorious and they will fight till the evening. Both sides will return not having gained the victory, but the squad will be wiped out. On the fourth day the remainder of the people of Islam will arise against them and God will decree that the enemy should be routed. They will then fight such a battle as has never been seen before, so that if a bird were to pass their flanks it would fall down dead before reaching the end of them. When count is taken of a hundred men who were related it will be found that only one has survived; so over what spoil can there be rejoicing, and what inheritance can be divided? Then when things are so they will hear of a war greater than that and a cry will reach them, \"The dajjal has taken your place among your offspring.\" They will therefore cast away what is in their hands and go forward sending ten horsemen as a scouting party. God's messenger said, \"I know their names, their fathers' names, and the colour of their horses. They will be the best horsemen (or, among the best horsemen) on the face of the earth at that time.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5422",
        "url": "https://sunnah.com/mishkat:5422"
      },
      "grade": null
    },
    {
      "id": 44,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «هَلْ سَمِعْتُمْ بِمَدِينَةٍ جَانِبٌ مِنْهَا فِي الْبَرِّ وَجَانِبٌ مِنْهَا فِي الْبَحْرِ؟» قَالُوا: نَعَمْ يَا رَسُولَ اللَّهِ قَالَ: \" لَا تَقُومُ السَّاعَةُ حَتَّى يَغْزُوَهَا سَبْعُونَ أَلْفًا مِنْ بني إِسحاق فَإِذا جاؤوها نَزَلُوا فَلَمْ يُقَاتِلُوا بِسِلَاحٍ وَلَمْ يَرْمُوا بِسَهْمٍ قَالَ: لَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ فَيَسْقُطُ أحدُ جانبيها. - قالَ ثورُ بنُ يزِيد الرَّاوِي: لَا أَعْلَمُهُ إِلَّا قَالَ -: \" الَّذِي فِي الْبَحْر يَقُولُونَ الثَّانِيَةَ: لَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ فَيَسْقُطُ جَانِبُهَا الْآخَرُ ثُمَّ يَقُولُونَ الثَّالِثَةَ: لَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ فَيُفَرَّجُ لَهُم فيدخلونها فيغنمون فَبينا هُمْ يَقْتَسِمُونَ الْمَغَانِمَ إِذْ جَاءَهُمُ الصَّرِيخُ فَقَالَ: إِنَّ الدَّجَّالَ قَدْ خَرَجَ فَيَتْرُكُونَ كُلَّ شَيْءٍ ويرجعون \". رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported the Prophet as saying, \"Have you heard of a city part of which is on the land and part in the sea?\" On receiving the reply, \"Yes, messenger of God,\" he said, \"The last hour will not come before seventy thousand of the descendants of Isaac attack it. When they come to it, they will dismount and will not fight with weapons or shoot arrows, but will say, `There is no god but God' and `God is most great,' whereupon one of its sides will fall down. (Thaur b. Yazid the transmitter remarked that he thought he said the part which was in the sea.) Then they will say a second time, `There is no god but God' and `God is most great,' whereupon the other side will fall down. A third time they will say, `There is no god but God' and `God is most great,' whereupon a breach will be made for them and they will enter it and take booty; but while they are dividing the spoils a cry will reach them to the effect that the dajjal has come forth, and they will abandon everything and go back.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5423",
        "url": "https://sunnah.com/mishkat:5423"
      },
      "grade": null
    },
    {
      "id": 45,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "عَنْ مُعَاذِ بْنِ جَبَلٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «عُمْرَانُ بَيْتِ الْمَقْدِسِ خَرَابُ يَثْرِبَ وَخَرَابُ يَثْرِبَ خُرُوجُ الْمَلْحَمَةِ وَخُرُوجُ الْمَلْحَمَةِ فَتْحُ قُسْطَنْطِينِيَّةَ وَفَتْحُ قُسْطَنْطِينِيَّةَ خُرُوجُ الدَّجَّال» . رَوَاهُ أَبُو دَاوُد",
      "english": {
        "narrator": "",
        "text": "Mu'adh b. Jabal reported God's messenger as saying, \"The flourishing state of Jerusalem will be when Yathrib is in ruins, the ruined state of Yathrib will be when the great war comes, the outbreak of the great war will be at the conquest of Constantinople, and the conquest of Constantinople when the dajjal comes forth.\" \n\nAbu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5424",
        "url": "https://sunnah.com/mishkat:5424"
      },
      "grade": null
    },
    {
      "id": 46,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «الملحمة الْعُظْمَى وَفتح القسطنطينة وَخُرُوجُ الدَّجَّالِ فِي سَبْعَةِ أَشْهُرٍ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"The greatest war, the conquest of Constantinople, and the coming forth of the dajjal will take place within a period of seven months.\" \n\nTirmidhi and Abu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5425",
        "url": "https://sunnah.com/mishkat:5425"
      },
      "grade": null
    },
    {
      "id": 47,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَن عبد الله بن بُسر أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «بَيْنَ الْمَلْحَمَةِ وَفَتْحِ الْمَدِينَةِ سِتُّ سِنِينَ وَيَخْرُجُ الدَّجَّالُ فِي السَّابِعَةِ» . رَوَاهُ أَبُو دَاوُدَ وَقَالَ: هَذَا أصح",
      "english": {
        "narrator": "",
        "text": "`Abdallah b. Busr reported God's messenger as saying, \"The time between the great war and the conquest of the city will be six years, and the dajjal will come forth in the seventh.\" \n* This could be Medina, but is more probably a reference to Constantinople.\n\nAbu Dawud transmitted it, saying this is sounder."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5426",
        "url": "https://sunnah.com/mishkat:5426"
      },
      "grade": null
    },
    {
      "id": 48,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنِ ابْنِ عُمَرَ قَالَ: يُوشِكُ الْمُسْلِمُونَ أَنْ يُحَاصَرُوا إِلَى الْمَدِينَةِ حَتَّى يَكُونَ أَبْعَدَ مَسَالِحِهِمْ سَلَاحٌ وَسَلَاحٌ: قَرِيبٌ مِنْ خَيْبَرَ. رَوَاهُ أَبُو دَاوُد",
      "english": {
        "narrator": "Ibn `Umar said:",
        "text": "The Muslims will soon be besieged up to Medina, so that their most distant frontier outpost will be Salah which is near Khaibar. \n\nAbu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5427",
        "url": "https://sunnah.com/mishkat:5427"
      },
      "grade": null
    },
    {
      "id": 49,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَن ذِي مِخبَرٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \n\" سَتُصَالِحُونَ الرُّومَ صُلْحًا آمِنًا فَتَغْزُونَ أَنْتُمْ وَهُمْ عَدُوًّا مِنْ وَرَائِكُمْ فَتُنْصَرُونَ وَتَغْنَمُونَ وَتَسْلَمُونَ ثُمَّ تَرْجِعُونَ حَتَّى تَنْزِلُوا بِمَرْجٍ ذِي تُلُولٍ فَيَرْفَعُ رَجُلٌ مِنْ أَهْلِ النَّصْرَانِيَّةِ الصَّلِيبَ\nفَيَقُولُ: غَلَبَ الصَّلِيبُ\nفَيَغْضَبُ رَجُلٌ مِنَ الْمُسْلِمِينَ فَيَدُقُّهُ فَعِنْدَ ذَلِكَ تَغْدِرُ الرُّومُ وَتَجْمَعُ لِلْمَلْحَمَةِ \" وَزَادَ بَعْضُهُمْ: «فَيَثُورُ الْمُسْلِمُونَ إِلَى أَسْلِحَتِهِمْ فَيَقْتَتِلُونَ فيكرم الله تِلْكَ الْعِصَابَة بِالشَّهَادَةِ» . رَوَاهُ أَبُو دَاوُد",
      "english": {
        "narrator": "",
        "text": "Dhu Mikhbar told that he heard God's messenger say, \"You will make a secure peace with the Byzantines, then you and they will fight an enemy behind you, and you will be victorious, take booty, and be safe. You will then return and alight in a meadow with mounds and one of the Christians will raise the cross and say, `The cross has conquered!' One of the Muslims will become angry and smash it, and the Byzantines will act treacherously and prepare for battle.\" Some transmitters added, \"The Muslims will then make for their weapons and will fight, and God will honour that band with martyrdom.\" \n\nAbu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5428",
        "url": "https://sunnah.com/mishkat:5428"
      },
      "grade": null
    },
    {
      "id": 50,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «اتْرُكُوا الْحَبَشَةَ مَا تَرَكُوكُمْ فَإِنَّهُ لَا يَسْتَخْرِجُ كَنْزَ الْكَعْبَةِ إِلَّا ذُو السُّوَيْقَتَيْنِ مِنَ الْحَبَشَةِ» . رَوَاهُ أَبُو دَاوُد",
      "english": {
        "narrator": "",
        "text": "`Abdallah b. `Amr reported the Prophet as saying, \"Leave the Abyssinians alone as long as they leave you alone, for it is only the Abyssinian with short legs who will seek to take out the treasure of the Ka'ba.\"\n\nAbu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5429",
        "url": "https://sunnah.com/mishkat:5429"
      },
      "grade": null
    },
    {
      "id": 51,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ رَجُلٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «دَعُوا الْحَبَشَةَ مَا وَدَعُوكُمْ وَاتْرُكُوا التُّرْكَ مَا تَرَكُوكُمْ» . رَوَاهُ أَبُو دَاوُدَ وَالنَّسَائِيّ",
      "english": {
        "narrator": "One of the Prophet's companions said:",
        "text": "Let the Abyssinians alone as long as they let you alone, and leave the Turks alone as long as they leave you alone. \n\nAbu Dawud and Nasai transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5430",
        "url": "https://sunnah.com/mishkat:5430"
      },
      "grade": null
    },
    {
      "id": 52,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ بُرَيْدَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي حَدِيثٍ: «يُقَاتِلُكُمْ قَوْمٌ صِغَارُ الْأَعْيُنِ» يَعْنِي التّرْك. قَالَ: «تسوقونهم ثَلَاث مَرَّات حَتَّى تلحقوهم بِجَزِيرَة الْعَرَب فَأَما السِّيَاقَةِ الْأُولَى فَيَنْجُو مَنْ هَرَبَ مِنْهُمْ وَأَمَّا الثَّانِيَة فينجو بعض وَيهْلك بعض وَأما الثَّالِثَةِ فَيُصْطَلَمُونَ» أَوْ كَمَا قَالَ. رَوَاهُ أَبُو دَاوُد",
      "english": {
        "narrator": "",
        "text": "Buraida told that in the tradition telling that people with small eyes, i.e. the Turks, would fight with them, the Prophet said, \"You will drive them off three times till you catch up with them in Arabia. On the first occasion when you drive them off those who fly will be safe, on the second occasion some will be safe and some will perish, but on the third occasion they will be extirpated,\" or words to that effect. \n\nAbu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5431",
        "url": "https://sunnah.com/mishkat:5431"
      },
      "grade": null
    },
    {
      "id": 53,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَن أبي بكرَة أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" يَنْزِلُ أُنَاسٌ مِنْ أُمَّتِي بِغَائِطٍ يُسَمُّونَهُ الْبَصْرَةَ عِنْدَ نَهْرٍ يُقَالُ لَهُ: دِجْلَةُ يَكُونُ عَلَيْهِ جِسْرٌ يَكْثُرُ أَهْلُهَا وَيَكُونُ مِنْ أَمْصَارِ الْمُسْلِمِينَ وَإِذَا كَانَ فِي آخِرِ الزَّمَانِ جَاءَ بَنُو قَنْطُورَاءَ عِرَاضُ الْوُجُوهِ صِغَارُ الْأَعْيُنِ حَتَّى يَنْزِلُوا عَلَى شَطِّ النَّهْرِ فَيَتَفَرَّقُ أَهْلُهَا ثَلَاثَ فِرَقٍ فِرْقَةٌ يَأْخُذُونَ فِي أَذْنَابِ الْبَقَرِ وَالْبَرِّيَّةِ وَهَلَكُوا وَفِرْقَةٌ يَأْخُذُونَ لِأَنْفُسِهِمْ وَهَلَكُوا وَفِرْقَةٌ يَجْعَلُونَ ذَرَارِيَّهُمْ خَلْفَ ظُهُورِهِمْ وَيُقَاتِلُونَهُمْ وَهُمُ الشُّهَدَاءُ \". رَوَاهُ أَبُو دَاوُد",
      "english": {
        "narrator": "",
        "text": "Abu Bakra reported God's messenger as saying, \"Some of my people will alight in low-lying ground which they will call al-Basra beside a river called the Tigris over which there is a bridge. Its people will be numerous and it will be one of the capital cities of the Muslims. At the end of time the descendants of Qantura' will come with broad faces and small eyes and alight on the bank of the river. The town's inhabitants will then separate into three sections, one of which will follow cattle into the desert and perish, another of which will seek security for themselves and perish, but a third will put their children behind their backs and fight with the invaders, and they will be the martyrs.\" \n\nAbu Dawud transmitted it.\n\n* The common explanation by Arabic writers is that Qantura' was a slave girl of Abraham from whom the Turks were descended. (Cf. Genesis, 25:1, which says that Abraham took a wife named Keturah -- in Hebrew Qeturah.) Ibn al-Athir, an-Nihaya fi gharib al-hadith, 3:314, says the Turks and Chinese were descended from the offspring of Qanturs'. Lisan al-'Arab, 6:432, says her offspring were the Turks, and some say the negroes. Mirqat, 5:166 f., finds a difficulty because Abraham was a descendant of Shem and the Turks were descended from Japheth. It suggests that Qantura' was a descendant of Abraham who married a descendant of Japheth. Dr. J.A. Boyle of Manchester University has drawn my attention to an article in the Harvard Journal of Asiatic Studies, 12:287, which quotes an Armenian historian, Grigor of Akner (1250-1335 A.D.), as saying that Kendura, a handmaiden of Abraham, bore Imran who became the ancestor of the Parthians."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5432",
        "url": "https://sunnah.com/mishkat:5432"
      },
      "grade": "إِسْنَاده جيد (الألباني)"
    },
    {
      "id": 54,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" يَا أَنَسُ إِنَّ النَّاسَ يمصِّرون أمصاراً فَإِن مِصْرًا مِنْهَا يُقَالُ لَهُ: الْبَصْرَةُ فَإِنْ أَنْتَ مَرَرْتَ بِهَا أَوْ دَخَلْتَهَا فَإِيَّاكَ وَسِبَاخَهَا وَكَلَأَهَا ونخيلها وَسُوقَهَا وَبَابَ أُمَرَائِهَا وَعَلَيْكَ بِضَوَاحِيهَا فَإِنَّهُ يَكُونُ بهَا خَسْفٌ وقذفٌ ورجْفٌ وقومٌ يبيتُونَ ويصبحون قردة وَخَنَازِير \" رَوَاهُ أَبُو دَاوُد",
      "english": {
        "narrator": "",
        "text": "Anas reported God's messenger as saying, \"The people will establish cities, Anas, and one of them will be called al-Basra. If you should pass by it or enter it, avoid its salt-marshes, its river front, its palm trees, its market, and the gate of its commanders, and keep to its environs, for the earth will swallow some people up, pelting rain will fall and earthquakes will take place in it, and there will be people who will spend the night in it and become apes and swine in the morning.\" \n\n. . . transmitted it. (The name of the source is omitted in the text. The tradition is in Abu Dawud, Malahim, 10)."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5433",
        "url": "https://sunnah.com/mishkat:5433"
      },
      "grade": null
    },
    {
      "id": 55,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَن صَالح بن دِرْهَم يَقُولُ: انْطَلَقْنَا حَاجِّينَ فَإِذَا رَجُلٌ فَقَالَ لَنَا: إِلَى جَنْبِكُمْ قَرْيَةٌ يُقَالُ لَهَا: الْأُبُلَّةُ؟ قُلْنَا: نَعَمْ. قَالَ: مَنْ يَضْمَنُ لِي مِنْكُمْ أَنْ يُصَلِّيَ لِي فِي مَسْجِدِ الْعَشَّارِ رَكْعَتَيْنِ أَوْ أَرْبَعًا وَيَقُولُ هَذِهِ لِأَبِي هُرَيْرَةَ؟ سَمِعْتُ خَلِيلِي أَبَا الْقَاسِمِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ اللَّهَ عَزَّ وَجَلَّ يَبْعَثُ مِنْ مَسْجِدِ الْعَشَّارِ يَوْمَ الْقِيَامَةِ شُهَدَاءَ لَا يَقُومُ مَعَ شُهَدَاءِ بَدْرٍ غَيْرُهُمْ» . رَوَاهُ أَبُو دَاوُدَ. وَقَالَ: هَذَا الْمَسْجِدُ مِمَّا يَلِي النَّهْرَ\nوَسَنَذْكُرُ حَدِيثَ أَبِي الدَّرْدَاءِ: «إِنَّ فُسْطَاطَ الْمُسْلِمِينَ» فِي بَابِ: «ذِكْرِ الْيَمَنِ وَالشَّامِ» . إِنْ شَاءَ اللَّهُ تَعَالَى",
      "english": {
        "narrator": "Salih b. Dirham said:",
        "text": "We went on pilgrimage and met a man who asked whether there was a town near us called al-Ubulla. On our replying that there was he asked if any of us would undertake to pray two or four rak'as on his behalf in the mosque of al- `Ashshar, stating that they were on behalf of Abu Huraira, for he had heard his friend Abul Qasim say, \"On the day of resurrection God who is great and glorious will raise martyrs from the mosque of al-'Ashshar who will be the only ones to rise along with the martyrs of Badr.\" \n\nAbu Dawud transmitted it, saying this mosque is near the river."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5434",
        "url": "https://sunnah.com/mishkat:5434"
      },
      "grade": null
    },
    {
      "id": 56,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "عَن شَقِيق عَن حُذَيْفَة قَالَ: كُنَّا عِنْدَ عُمَرَ فَقَالَ: أَيُّكُمْ يَحْفَظُ حَدِيثِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي الْفِتْنَةِ؟ فَقُلْتُ: أَنَا أَحْفَظُ كَمَا قَالَ: قَالَ: هَاتِ إِنَّكَ لِجَرِيءٌ وَكَيْفَ؟ قَالَ: قُلْتُ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ «فِتْنَةُ الرَّجُلِ فِي أَهْلِهِ وَمَالِهِ وَنَفْسِهِ وَوَلَدِهِ وَجَارِهِ يُكَفِّرُهَا الصِّيَامُ وَالصَّلَاةُ وَالصَّدَقَةُ وَالْأَمْرُ بِالْمَعْرُوفِ وَالنَّهْيُ عَنِ الْمُنْكَرِ» فَقَالَ عُمَرُ: لَيْسَ هَذَا أُرِيدُ إِنَّمَا أُرِيدُ الَّتِي تَمُوجُ كَمَوْجِ الْبَحْر. قَالَ: مَا لَكَ وَلَهَا يَا أَمِيرَ الْمُؤْمِنِينَ؟ إِنَّ بَيْنَكَ وَبَيْنَهَا بَابًا مُغْلَقًا. قَالَ: فَيُكْسَرُ الْبَابُ أويفتح؟ قَالَ: قُلْتُ: لَا بَلْ يُكْسَرُ. قَالَ: ذَاكَ أَحْرَى أَنْ لَا يُغْلَقَ أَبَدًا. قَالَ: فَقُلْنَا لحذيفةَ: هَل كَانَ عمر يعلم مَنِ البابُ؟ قَالَ: نَعَمْ كَمَا يَعْلَمُ أَنَّ دُونَ غَدٍ لَيْلَةٌ إِنِّي حَدَّثْتُهُ حَدِيثًا لَيْسَ بِالْأَغَالِيطِ قَالَ: فَهِبْنَا أَنْ نَسْأَلَ حُذَيْفَةَ مَنِ الْبَابُ؟ فَقُلْنَا لِمَسْرُوقٍ: سَلْهُ. فَسَأَلَهُ فَقَالَ: عُمَرُ. مُتَّفَقٌ عَلَيْهِ",
      "english": {
        "narrator": "Shaqiq quoted Hudhaifa as saying:",
        "text": "When we were with `Umar he asked which of us remembered the tradition of God's messenger about the fitna, and I replied that I remembered it just as he had uttered it. Telling me to relate it, and remarking that I was daring, he asked how he had spoken and I replied that I had heard God's messenger say, \"A man's fitna concerns his family, his property, his person, his children and his neighbour for any shortcoming in which atonement made by fasting, prayer, sadaqah recommending what is reputable and reproving what is disreputable. I asked the commander of the faithful what he had to do with it, for between him and it there was a closed door. He asked whether the door would be broken down or opened, and when I replied that it would be broken down, he said it would never likely be closed. Hudhaifa was asked if `Umar knew who the door was and he replied that he knew it as well as he knew that a night comes before tomorrow, adding that he had told him a tradition which included no misleading language. They were afraid to ask Hudhaifa who the door was, so they asked Masruq to ask him, and when he did so he replied that it was `Umar.3 \n A man who has these responsibilities may fall short of what is due from him, but can make atonement for his shortcoming. \n Contention which leads to strife and warfare. \n The point of the tradition is that the fitna would not occur in `Umar's lifetime, but that as he was to be assassinated there was no hope of peaceful conditions ever returning. The opening of the door indicates a natural death and the breaking down of the door a violent death.\n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5435",
        "url": "https://sunnah.com/mishkat:5435"
      },
      "grade": "مُتَّفق عَلَيْهِ (الألباني)"
    },
    {
      "id": 57,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَن أنسٍ قَالَ: فَتْحُ القسطنطينة مَعَ قِيَامِ السَّاعَةِ. رَوَاهُ التِّرْمِذِيُّ. وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ",
      "english": {
        "narrator": "",
        "text": "Anas said the conquest of Constantinople would be associated with the coming of the last hour. \n\nTirmidhi transmitted it, saying this is a gharib tradition."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5436",
        "url": "https://sunnah.com/mishkat:5436"
      },
      "grade": null
    },
    {
      "id": 58,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "عَنْ أَنَسٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ يُرْفَعَ الْعِلْمُ وَيَكْثُرَ الْجَهْلُ وَيَكْثُرَ الزِّنا ويكثُرَ شُربُ الخمرِ ويقِلَّ الرِّجالُ وتكثُرَ النِّسَاءُ حَتَّى يَكُونَ لِخَمْسِينَ امْرَأَةً الْقَيِّمُ الْوَاحِدُ» . وَفِي رِوَايَةٍ: «يَقِلُّ الْعِلْمُ وَيَظْهَرُ الْجَهْلُ» . مُتَّفَقٌ عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Anas told that he heard God's messenger say, \"Among the signs of the last hour will be the removal of knowledge, the abundance of ignorance, the prevalence of fornication, the prevalence of wine-drinking, the small number of men and the large number of women, so that fifty women will have one man to look after them.\" A version has \"the small amount of knowledge and the presence of ignorance.\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5437",
        "url": "https://sunnah.com/mishkat:5437"
      },
      "grade": "مُتَّفق عَلَيْهِ (الألباني)"
    },
    {
      "id": 59,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ جَابِرِ بْنِ سَمُرَةَ قَالَ: سَمِعْتُ رَسُولَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ بَيْنَ يَدَيِ السَّاعَةِ كَذَّابِينَ فَاحْذَرُوهُمْ» . رَوَاهُ مُسْلِمٌ",
      "english": {
        "narrator": "",
        "text": "Jabir b. Samura told that he heard the Prophet say, \"Before the last hour there will be great liars, so beware of them.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5438",
        "url": "https://sunnah.com/mishkat:5438"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 60,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَن أبي هريرةَ قَالَ: بَيْنَمَا كَانَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُحَدِّثُ إِذْ جَاءَ أَعْرَابِيٌّ فَقَالَ: مَتَى السَّاعَةُ؟ قَالَ: «إِذَا ضُيِّعَتِ الْأَمَانَةُ فَانْتَظِرِ السَّاعَةَ» . قَالَ: كَيْفَ إِضَاعَتُهَا؟ قَالَ: «إِذَا وُسِّدَ الْأَمْرُ إِلَى غَيْرِ أَهْلِهِ فَانْتَظِرِ السَّاعَةَ» . رَوَاهُ الْبُخَارِيُّ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira told that while the Prophet was talking a nomadic Arab came and asked when the last hour would come, to which he replied, \"When the practice of honouring a trust is lost expect the last hour.\" He asked how it could be lost and he replied, \"When rule is given to people who are unworthy of it, expect the last hour.\" \n\nBukhari transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5439",
        "url": "https://sunnah.com/mishkat:5439"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 61,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «لَا تَقُومُ السَّاعَةُ حَتَّى يَكْثُرَ الْمَالُ وَيَفِيضَ حَتَّى يُخْرِجَ الرَّجُلُ زَكَاةَ مَالِهِ فَلَا يَجِدُ أَحَدًا يَقْبَلُهَا مِنْهُ وَحَتَّى تَعُودَ أَرْضُ الْعَرَبِ مُرُوجًا وَأَنْهَارًا» رَوَاهُ مُسْلِمٌ. وَفِي رِوَايَة: قَالَ: «تبلغ المساكن إهَاب أَو يهاب»",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"The last hour will not come before wealth is abundant and overflowing, before a man brings the zakat on his property and cannot find anyone to accept it from him, and before the land of the Arabs becomes meadows and rivers.\" In a version by him he said, \"the dwellings reach to Ihab or Yihab.\" \n*Either two places in the neighbourhood of Medina, or alternative names for the same place. Cf, Yaqut, \nMu'jam, 1:408. \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5440",
        "url": "https://sunnah.com/mishkat:5440"
      },
      "grade": "صَحِيحٌ (الألباني)"
    },
    {
      "id": 62,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَكُونُ فِي آخِرِ الزَّمَانِ خَلِيفَةٌ يُقَسِّمُ الْمَالَ وَلَا يَعُدُّهُ» . وَفِي رِوَايَةٍ: قَالَ: «يَكُونُ فِي آخِرِ أُمَّتِي خَلِيفَةٌ يَحْثِي الْمَالَ حَثْيًا وَلَا يَعُدُّهُ عَدًّا» . رَوَاهُ مُسْلِمٌ",
      "english": {
        "narrator": "",
        "text": "Jabir reported God's messenger as saying, \"In the last days there will be a Caliph who will distribute wealth without reckoning it.\" In a version he said, \"Among the last of my people there will be a Caliph who will pour out wealth without counting it.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5441",
        "url": "https://sunnah.com/mishkat:5441"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 63,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يُوشِكُ الْفُرَاتُ أَنْ يَحْسِرَ عَنْ كَنْزٍ مِنْ ذَهَبٍ فَمَنْ حَضَرَ فَلَا يَأْخُذْ مِنْهُ شَيْئًا» . مُتَّفَقٌ عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported God's messenger as saying, \"The Euphrates is soon to uncover a treasure of gold, but those who are present must not take any of it.\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5442",
        "url": "https://sunnah.com/mishkat:5442"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 64,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" لَا تَقُومُ السَّاعَةُ حَتَّى يَحْسِرَ الْفُرَاتُ عَنْ جَبَلٍ مِنْ ذَهَبٍ يَقْتَتِلُ النَّاسُ عَلَيْهِ فَيُقْتَلُ مَنْ كُلِّ مِائَةٍ تِسْعَةٌ وَتِسْعُونَ وَيَقُولُ كُلُّ رَجُلٍ مِنْهُمْ: لَعَلِّي أَكُونُ أَنَا الَّذِي أنجُو \". رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"The last hour will not come before the Euphrates uncovers a mountain of gold for which people will fight, ninety-nine out of each hundred of whom will be killed; but every man among them will say that perhaps he will be the one who will escape.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5443",
        "url": "https://sunnah.com/mishkat:5443"
      },
      "grade": "صَحِيحٌ (الألباني)"
    },
    {
      "id": 65,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" تَقِيءُ الْأَرْضُ أَفْلَاذَ كَبِدِهَا أَمْثَالَ الْأُسْطُوَانَةِ مِنَ الذَّهَبِ وَالْفِضَّةِ فَيَجِيءُ الْقَاتِلُ فَيَقُولُ: فِي هَذَا قَتَلْتُ وَيَجِيءُ الْقَاطِعُ فَيَقُولُ: فِي هَذَا قَطَعْتُ رَحِمِي. وَيَجِيءُ السَّارِقُ فَيَقُولُ: فِي هَذَا قُطِعت يَدي ثمَّ يَد عونه فَلَا يَأْخُذُونَ من شَيْئا \". رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"The earth will vomit oblong `pieces of its liver like columns of gold and silver, and the murderer will come and say it was for this he committed murder, the breaker of family ties will come and say it was for this he broke them, and the thief will come and say it was for this his hand was cut off. They will then leave it and not take any of it.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5444",
        "url": "https://sunnah.com/mishkat:5444"
      },
      "grade": "صَحِيحٌ (الألباني)"
    },
    {
      "id": 66,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" وَالَّذِي نَفْسِي بِيَدِهِ لَا تَذْهَبُ الدُّنْيَا حَتَّى يَمُرَّ الرَّجُلُ عَلَى الْقَبْرِ فَيَتَمَرَّغُ عَلَيْهِ ويقولُ: يَا لَيْتَني مَكَانَ صَاحِبِ هَذَا الْقَبْرِ وَلَيْسَ بِهِ الدِّينُ إِلَّا الْبلَاء \". رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"By Him in whose hand my soul is, the world will not pass away before a man comes by a grave and rolls on it saying he wishes he were, in the place of the occupant of that grave, not for religious reasons, but because of tribulation.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5445",
        "url": "https://sunnah.com/mishkat:5445"
      },
      "grade": "صَحِيحٌ (الألباني)"
    },
    {
      "id": 67,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَقُومُ السَّاعَةُ حَتَّى تَخْرُجَ نَارٌ مِنْ أَرْضِ الْحِجَازِ تُضِيءُ أعناقَ الإِبلِ ببُصْرى» . مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"The last hour will not come before there issues from the land of the Hijaz a fire which will illuminate the necks of the camels in Busra.\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5446",
        "url": "https://sunnah.com/mishkat:5446"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 68,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَوَّلُ أَشْرَاطِ السَّاعَةِ نَارٌ تَحْشُرُ النَّاسَ مِنَ الْمَشْرِقِ إِلَى الْمَغْرِبِ» . رَوَاهُ الْبُخَارِيُّ",
      "english": {
        "narrator": "",
        "text": "Anas reported God's messenger as saying, \"The least of the signs of the last hour will be a fire which will gather mankind from the East to the West.\" \n\nBukhari transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5447",
        "url": "https://sunnah.com/mishkat:5447"
      },
      "grade": null
    },
    {
      "id": 69,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "عَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَقُومُ السَّاعَةُ حَتَّى يتقاربَ الزَّمانُ فتكونُ السَّنةُ كالشهرِ والشَّهرُ كالجمعةِ وتكونُ الجمعةُ كاليومِ وَيَكُونُ الْيَوْمُ كَالسَّاعَةِ وَتَكُونُ السَّاعَةُ كَالضَّرْمَةِ بِالنَّارِ» . رَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "Anas reported God's messenger as saying, \"The last hour will not come before time contracts, a year being like a month, a month like a week, a week like a day, a day like an hour, and an hour like the kindling of a fire.\" \n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5448",
        "url": "https://sunnah.com/mishkat:5448"
      },
      "grade": null
    },
    {
      "id": 70,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَن عبدِ الله بنِ حوالةَ قَالَ: بعثَنا رَسُول الله صلى اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِنَغْنَمَ عَلَى أَقْدَامِنَا فَرَجَعْنَا فَلَمْ نَغْنَمْ شَيْئًا وَعَرَفَ الْجَهْدَ فِي وجوهِنا فقامَ فِينَا فَقَالَ: «اللَّهُمَّ لَا تَكِلْهُمْ إِلَيَّ فَأَضْعُفَ عَنْهُمْ وَلَا تَكِلْهُمْ إِلَى أَنْفُسِهِمْ فَيَعْجِزُوا عَنْهَا وَلَا تَكِلْهُمْ إِلَى النَّاسِ فَيَسْتَأْثِرُوا عَلَيْهِمْ» ثُمَّ وَضَعَ يَدَهُ عَلَى رَأْسِي ثُمَّ قَالَ: «يَا ابْنَ حَوَالَةَ إِذَا رَأَيْتَ الْخِلَافَةَ قَدْ نَزَلَتِ الْأَرْضَ الْمُقَدَّسَةَ فَقَدْ دَنَتِ الزَّلَازِلُ وَالْبَلَابِلُ وَالْأُمُورُ الْعِظَامُ وَالسَّاعَةُ يَوْمَئِذٍ أَقْرَبُ مِنَ النَّاسِ مِنْ يَدِي هَذِه إِلَى رَأسك» . رَوَاهُ أَبُو دَاوُد",
      "english": {
        "narrator": "`Abdallah b. Hawala said:",
        "text": "God's messenger sent us on foot to get spoil, but we returned without getting any. When he saw the signs of distress on our faces, he stood up among us and said, \"0 God, do not put them under my care, for I would be too weak to care for them; do not put them in care of themselves, for they would be incapable of that; and do not put them in the care of men, for they would choose the best things for themselves.\" He then placed his hand on my head and said, \"Ibn Hawala, when you see the Caliphate has settled in the holy land, earthquakes, sorrows and serious matters will have drawn near, and on that day the last hour will be nearer to mankind than this hand of mine is to your head.\"\n\n . . .transmitted it.\n*The name of the source is omitted in the text. The tradition is in Ahmad b. Hanbal, Musnad (Cairo, 1313), vol. 5 p. 288, and Abu Dawud, Jihad, 35."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5449",
        "url": "https://sunnah.com/mishkat:5449"
      },
      "grade": null
    },
    {
      "id": 71,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا اتُّخِذَ الْفَيْءُ دِوَلًا وَالْأَمَانَةُ مَغْنَمًا وَالزَّكَاةُ مَغْرَمًا وَتُعُلِّمَ لِغَيْرِ الدِّينِ وَأَطَاعَ الرَّجُلُ امْرَأَتَهُ وَعَقَّ أُمَّهُ وَأَدْنَى صَدِيقَهُ وَأَقْصَى أَبَاهُ وَظَهَرَتِ الْأَصْوَاتُ فِي الْمَسَاجِدِ وَسَادَ الْقَبِيلَةَ فَاسِقُهُمْ وَكَانَ زَعِيمُ الْقَوْمِ أَرْذَلَهُمْ وَأُكْرِمَ الرَّجُلُ مَخَافَةَ شَرِّهِ وَظَهَرَتِ الْقَيْنَاتُ وَالْمَعَازِفُ وشُربتِ الخمورُ وَلَعَنَ آخِرُ هَذِهِ الْأُمَّةِ أَوَّلَهَا فَارْتَقِبُوا عِنْدَ ذَلِكَ رِيحًا حَمْرَاءَ وَزَلْزَلَةً وَخَسْفًا وَمَسْخًا وَقَذْفًا وَآيَاتٍ تَتَابَعُ كَنِظَامٍ قُطِعَ سِلْكُهُ فَتَتَابَعَ» . رَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported God's messenger as saying, ``When the booty is taken in turn, property given in trust is treated as spoil, zakat is looked on as a fine, learning is acquired for other than a religious purpose, a man obeys his wife and is unfilial towards his mother, brings his friend near and drives his father far off, voices are raised in the mosques, the most wicked member of a tribe becomes its ruler, the most worthless member of a people becomes its leader, a man is honoured through fear of the evil he may do, singing-girls and stringed instruments make their appearance, wines are drunk, and the last members of this people curse the first ones, look at that time for a violent wind, an earthquake, being swallowed Up by the earth, metamorphosis, pelting rain, and signs following one another like bits of a necklace falling one after the other when its string is cut.\" \n*Cf. Quran, 59:7\n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5450",
        "url": "https://sunnah.com/mishkat:5450"
      },
      "grade": null
    },
    {
      "id": 72,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا فَعَلَتْ أُمَّتِي خَمْسَ عَشْرَةَ خَصْلَةً حَلَّ بِهَا الْبَلَاءُ» وَعَدَّ هَذِهِ الْخِصَالَ وَلَمْ يَذْكُرْ «تُعُلِّمَ لِغَيْرِ الدِّينِ» قَالَ: «وَبَرَّ صَدِيقَهُ وَجَفَا أَبَاهُ» وَقَالَ: «وَشُرِبَ الْخَمْرُ وَلُبِسَ الْحَرِيرُ» . رَوَاهُ التِّرْمِذِيُّ",
      "english": {
        "narrator": "",
        "text": "\"Ali reported God's messenger as saying, \"When my people do fifteen things trial will alight on them.\" He enumerated these things, but did not mention that learning would be acquired for other than a religious purpose. He said, \"shows kindness to his friend and repulses his father.\" He also said, \"wine is drunk and silk is worn.\" \n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5451",
        "url": "https://sunnah.com/mishkat:5451"
      },
      "grade": null
    },
    {
      "id": 73,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَذْهَبُ الدُّنْيَا حَتَّى يَمْلِكَ الْعَرَبَ رَجُلٌ مِنْ أهلِ بَيْتِي يُواطِىءُ اسمُه اسْمِي» رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ.\nوَفِي رِوَايَةٍ لَهُ: «لَوْ لَمْ يَبْقَ مِنَ الدُّنْيَا إِلَّا يَوْمٌ لَطَوَّلَ اللَّهُ ذَلِكَ الْيَوْمَ حَتَّى يَبْعَثَ اللَّهُ فِيهِ رَجُلًا مِنِّي - أَوْ مِنْ أَهْلِ بَيْتِي - يُوَاطِئُ اسْمُهُ اسْمِيَ وَاسْمُ أَبِيهِ اسْمَ أَبِي يَمْلَأُ الْأَرْضَ قِسْطًا وَعَدْلًا كَمَا مُلِئَتْ ظُلْمًا وجورا»",
      "english": {
        "narrator": "",
        "text": "`Abdallah b. Mas'ud reported God's messenger as saying, \"The world will not pass away before the Arabs are ruled by a man of my family whose name will be the same as mine.' \n\nTirmidhi and Abu Dawud transmitted it.\n\nIn a version by the latter he said, \"If only one day of this world remained God would lengthen that day till He raised up in it a man who belongs to me (or, to my family) whose name is the same as mine and whose fathers name is the same as my father's, who will fill the earth with equity and justice as it has been filled with oppression and tyranny.\" \n\nAba Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5452",
        "url": "https://sunnah.com/mishkat:5452"
      },
      "grade": null
    },
    {
      "id": 74,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أُمِّ سَلَمَةَ قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «الْمَهْدِيُّ مِنْ عِتْرَتِي مِنْ أَوْلَادِ فَاطِمَة» . رَوَاهُ أَبُو دَاوُد",
      "english": {
        "narrator": "",
        "text": "Umm Salama told that she heard God's messenger say, \"The Mahdi will be of my family, of the descendants of Fatima.\"\n\nAba Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5453",
        "url": "https://sunnah.com/mishkat:5453"
      },
      "grade": null
    },
    {
      "id": 75,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْمَهْدِيُّ مِنِّي أجلى الْجَبْهَة وأقنى الْأَنْفِ يَمْلَأُ الْأَرْضَ قِسْطًا وَعَدْلًا كَمَا مُلِئَتْ ظُلْمًا وَجَوْرًا يَمْلِكُ سَبْعَ سِنِينَ» . رَوَاهُ أَبُو دَاوُد",
      "english": {
        "narrator": "",
        "text": "Abu Sa'id al-Khudri reported God's messenger as saying, \"The Mahdi will be of my stock and will have a broad forehead and a prominent nose. He will fill the earth with equity and justice as it was filled with oppression and tyranny, and will rule for seven years.\" \n\nAbu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5454",
        "url": "https://sunnah.com/mishkat:5454"
      },
      "grade": null
    },
    {
      "id": 76,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قِصَّةِ الْمَهْدِيِّ قَالَ: \n\" فَيَجِيءُ إِلَيْهِ الرَّجُلُ فَيَقُولُ: يَا مَهْدِيُّ أَعْطِنِي أَعْطِنِي. قَالَ: فَيَحْثِي لَهُ فِي ثَوْبِهِ مَا اسْتَطَاعَ أَنْ يَحْمِلَهُ \". رَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "He reported the Prophet as saying in the course of the story about the Mahdi that a man will come to him and say, \"Give me, give me, Mahdi,\" and he will pour into His garment as much as he is able to carry. \n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5455",
        "url": "https://sunnah.com/mishkat:5455"
      },
      "grade": null
    },
    {
      "id": 77,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أُمِّ سَلَمَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَكُونُ اخْتِلَافٌ عِنْدَ مَوْتِ خَلِيفَةٍ فَيَخْرُجُ رَجُلٌ مِنْ أَهْلِ الْمَدِينَةِ هَارِبًا إِلى مكةَ فيأتيه الناسُ من أهل مَكَّة فيخرجوه وَهُوَ كَارِه فيبايعونه بَين الرُّكْن وَالْمقَام يبْعَث إِلَيْهِ بَعْثٌ مِنَ الشَّامِ فَيُخْسَفُ بِهِمْ بِالْبَيْدَاءِ بَيْنَ مَكَّةَ وَالْمَدِينَةِ فَإِذَا رَأَى النَّاسُ ذَلِكَ أَتَاهُ أَبْدَالُ الشَّامِ وَعَصَائِبُ أَهْلِ الْعِرَاقِ فَيُبَايِعُونَهُ ثُمَّ يَنْشَأُ رَجُلٌ مِنْ قُرَيْشٍ أَخْوَالُهُ كَلْبٌ فَيَبْعَثُ إِلَيْهِمْ بَعْثًا فَيَظْهَرُونَ عَلَيْهِمْ وَذَلِكَ بَعَثُ كلب وَيعْمل النَّاسِ بِسُنَّةِ نَبِيِّهِمْ وَيُلْقِي الْإِسْلَامُ بِجِرَانِهِ فِي الْأَرْضِ فَيَلْبَثُ سَبْعَ سِنِينَ ثُمَّ يُتَوَفَّى وَيُصَلِّي عَلَيْهِ الْمُسلمُونَ» . رَوَاهُ أَبُو دَاوُد",
      "english": {
        "narrator": "",
        "text": "Umm Salama reported the Prophet as saying, \"Disagreement will occur at the death of a Caliph and a man of the people of Medina will come forth flying to Mecca. Some of the people of Mecca will come to him, bring him out against his will, and swear allegiance to him between the Corner will remain seven years, then die, and the Muslims will pray over him.\" \n1. The corner of the Ka'ba containing the black stone. \n2. i.e., Maqam Ibrahim. \n3. The word is abdāl. These are righteous people whose number never diminishes, as each one is replaced when he dies. Abdal is the plural of badal which ordinarily means a substitute. I have used a free translation because a literal translation of the word would not convey any conception of the meaning. \n4. i.e., the Mahdi.\n\nAbu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5456",
        "url": "https://sunnah.com/mishkat:5456"
      },
      "grade": null
    },
    {
      "id": 78,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي سَعِيدٍ قَالَ: ذَكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «بَلَاءً يُصِيبُ هَذِهِ الْأُمَّةَ حَتَّى لَا يَجِدَ الرَّجُلُ مَلْجَأً يَلْجَأُ إِلَيْهِ مِنَ الظُّلْمِ فَيَبْعَثُ اللَّهُ رَجُلًا مِنْ عِتْرَتِي وَأَهْلِ بَيْتِي فَيَمْلَأُ بِهِ الْأَرْضَ قِسْطًا وَعَدْلًا كَمَا مُلِئَتْ ظُلْمًا وَجَوْرًا يَرْضَى عَنْهُ سَاكِنُ السَّمَاءِ وَسَاكِنُ الْأَرْضِ لَا تَدَعُ السَّمَاءُ مِنْ قَطْرِهَا شَيْئًا إِلَّا صَبَّتْهُ مِدْرَارًا وَلَا تَدَعُ الْأَرْضُ مِنْ نَبَاتِهَا شَيْئًا إِلَّا أَخْرَجَتْهُ حَتَّى يَتَمَنَّى الْأَحْيَاءُ الْأَمْوَاتَ يَعِيشُ فِي ذَلِكَ سبعَ سِنِين أَو ثمانَ سِنِين أَو تسع سِنِين» . رَوَاهُ",
      "english": {
        "narrator": "",
        "text": "Abu Sa'id told that God's messenger mentioned a trial which would afflict this people so that a man would find no place of refuge to which he could go from oppression, saying, \"God will then send a man of my stock and family by whom He will fill the earth with equity and justice as it had been filled with oppression and tyranny. Those who dwell in heaven and those who dwell on earth will be pleased with him. The sky will not cease to give any of its rain, but will pour it forth copiously and the earth will not cease to produce any of its plants, but will bring them forth so that the living will wish the dead were alive in that period of seven, eight, or nine years.\" \n\nAl-Hakim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5457",
        "url": "https://sunnah.com/mishkat:5457"
      },
      "grade": null
    },
    {
      "id": 79,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" يَخْرُجُ رَجُلٌ مِنْ وَرَاءِ النَّهْرِ يُقَالُ لَهُ: الْحَارِثُ حَرَّاثٌ عَلَى مُقَدِّمَتِهِ رَجُلٌ يُقَالُ لَهُ: مَنْصُورٌ يُوَطِّنُ أَوْ يُمَكِّنُ لِآلِ مُحَمَّدٍ كَمَا مَكَّنَتْ قُرَيْشٌ لِرَسُولِ اللَّهِ وَجَبَ عَلَى كُلِّ مُؤْمِنٍ نَصْرُهُ - أَوْ قَالَ: إِجَابَتُهُ - \". رَوَاهُ أَبُو دَاوُدَ",
      "english": {
        "narrator": "",
        "text": "`Ali reported God's messenger as saying, \"A man called al-Harith, a farmer, will come forth from Ma \nWara' an-Nahr whose army will be led by a man called Mansur who will establish (or, consolidate) things for Muhammad's family as Quraish consolidated them for God's messenger. Every believer must help him.\" Or he said, \"respond to his summons.\" \n\nAbu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5458",
        "url": "https://sunnah.com/mishkat:5458"
      },
      "grade": null
    },
    {
      "id": 80,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَالَّذِي نَفْسِي بِيَدِهِ لَا تَقُومُ السَّاعَةُ حَتَّى تُكَلِّمَ السِّبَاعُ الْإِنْسَ وَحَتَّى تُكَلِّمَ الرَّجُلَ عَذَبَةُ سَوْطِهِ وَشِرَاكُ نَعْلِهِ وَيُخْبِرَهُ فَخِذُهُ بِمَا أَحْدَثَ أَهْلُهُ بَعْدَهُ» . رَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "Abu Sa'id al-Khudri reported God's messenger as saying, \"By Him in whose hand my soul is, the last hour will not come before wild beasts speak to men, the end of a man's whip and the thong of his sandal speak to him, and his thigh informs him what his family have done since he left them.\" \n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5459",
        "url": "https://sunnah.com/mishkat:5459"
      },
      "grade": null
    },
    {
      "id": 81,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "عَنْ أَبِي قَتَادَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: الْآيَاتُ بَعْدَ الْمِائَتَيْنِ \". رَوَاهُ ابْن مَاجَه",
      "english": {
        "narrator": "",
        "text": "Abu Qatada reported God's messenger as saying, \"The signs will come after the end of the second century.'' \n\nIbn Majah transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5460",
        "url": "https://sunnah.com/mishkat:5460"
      },
      "grade": null
    },
    {
      "id": 82,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ ثَوْبَانَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِذَا رَأَيْتُمُ الرَّايَاتِ السُّودَ قَدْ جَاءَتْ مِنْ قِبَلِ خُرَاسَانَ فَأْتُوهَا فَإِنَّ فِيهَا خَلِيفَةَ اللَّهِ الْمَهْدِيَّ» . رَوَاهُ أَحْمَدُ وَالْبَيْهَقِيُّ فِي «دَلَائِل النبوَّة»",
      "english": {
        "narrator": "",
        "text": "Thauban reported God's messenger as saying, \"When you see the black standards have come from the direction of Khurasan go to them, for God's khalifa the Mahdi will be among them.\" \n\nAhmad and Baihaqi, in Dala'il an-nubuwa, transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5461",
        "url": "https://sunnah.com/mishkat:5461"
      },
      "grade": null
    },
    {
      "id": 83,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَن أبي إِسحاق قَالَ: قَالَ عَلِيٌّ وَنَظَرَ إِلَى ابْنِهِ الْحَسَنِ قَالَ: إِنَّ ابْنِي هَذَا سَيِّدٌ كَمَا سَمَّاهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَسَيَخْرُجُ مِنْ صُلْبِهِ رَجُلٌ يُسَمَّى بِاسْمِ نَبِيِّكُمْ يُشْبِهُهُ فِي الْخَلْقِ - ثُمَّ ذَكَرَ قِصَّةَ - يَمْلَأُ الْأَرْضَ عَدْلًا. رَوَاهُ أَبُو دَاوُدَ وَلَمْ يَذْكُرِ الْقِصَّةَ",
      "english": {
        "narrator": "",
        "text": "Abu Ishaq told that `Ali looked at his son al-Hasan and said, \"This son of mine is a sayyid as God's messenger named him, and from his loins will come forth a man who will be called by your Prophet's name and resemble him in nature but not in appearance.\" He then mentioned the story about his filling the earth with justice. \n\nAbu Dawud transmitted it, but did not mention the story."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5462",
        "url": "https://sunnah.com/mishkat:5462"
      },
      "grade": null
    },
    {
      "id": 84,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ قَالَ: فُقِدَ الْجَرَادُ فِي سَنَةٍ مِنْ سِنِي عُمَرَ الَّتِي تُوُفِّيَ فِيهَا فَاهْتَمَّ بِذَلِكَ هَمًّا شَدِيدًا فَبَعَثَ إِلَى الْيمن رَاكِبًا وراكبا إِلَى الْعرق وَرَاكِبًا إِلَى الشَّامِ يَسْأَلُ عَنِ الْجَرَادِ هَلْ أُرِيَ مِنْهُ شَيْئًا فَأَتَاهُ الرَّاكِبُ الَّذِي مِنْ قبل الْيمن بقبضة فنثرهابين يَدَيْهِ\nفَلَمَّا رَآهَا عُمَرُ كَبَّرَ\nوَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: إِنَّ اللَّهَ عَزَّ وَجَلَّ خَلَقَ أَلْفَ أُمَّةٍ سِتُّمِائَةٍ مِنْهَا فِي الْبَحْرِ وَأَرْبَعُمِائَةٍ فِي الْبَرِّ فَإِنَّ أَوَّلَ هَلَاكِ هَذِهِ الْأُمَّةِ الْجَرَادُ فَإِذَا هَلَكَ الْجَرَادُ تَتَابَعَتِ الْأُمَمُ كَنِظَامِ السِّلْكِ «. رَوَاهُ الْبَيْهَقِيُّ فِي» شُعَبِ الْإِيمَانِ \"",
      "english": {
        "narrator": "",
        "text": "Jabir b. `Abdallah told that no locusts were seen in one of the years of `Umar's Caliphate, the year in which he died, and becoming very anxious on this account he sent a rider to the Yemen, another to `Iraq and another to Syria to enquire whether any locusts had been seen. The rider who came from the Yemen brought him a handful and scattered it in front of him, and when `Umar saw it, he said, \"God is most great,\" and told that he had heard God's messenger say, \"God who is great and glorious created a thousand species, six hundred in the sea and four hundred on the land. The first species to perish will be the locusts, and when they perish the species will follow one another like beads on a string.\" \n\nBaihaqi transmitted it in Shu'ab al-iman"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5463",
        "url": "https://sunnah.com/mishkat:5463"
      },
      "grade": null
    },
    {
      "id": 85,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "عَن حذيفةَ بن أسيد الْغِفَارِيّ قَالَ: اطَّلَعَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَلَيْنَا وَنَحْنُ نَتَذَاكَرُ. فَقَالَ: «مَا تَذْكُرُونَ؟» . قَالُوا: نَذْكُرُ السَّاعَةَ. قَالَ: \n\" إِنَّهَا لَنْ تَقُومَ حَتَّى تَرَوْا قَبْلَهَا عَشْرَ آيَاتٍ فَذَكَرَ الدُّخَانَ وَالدَّجَّالَ وَالدَّابَّةَ وَطُلُوعَ الشَّمْسِ مِنْ مَغْرِبِهَا وَنُزُولَ عِيسَى بْنِ مَرْيَمَ وَيَأْجُوجَ وَمَأْجُوجَ وَثَلَاثَةَ خُسُوفٍ: خَسْفٌ بِالْمَشْرِقِ وَخَسْفٌ بِالْمَغْرِبِ وَخَسْفٌ بِجَزِيرَةِ الْعَرَبِ وَآخِرُ ذَلِكَ نَارٌ تَخْرُجُ مِنَ الْيَمَنِ تَطْرُدُ النَّاسَ إِلَى مَحْشَرِهِمْ \". وَفِي رِوَايَةٍ: «نَارٌ تَخْرُجُ مِنْ قَعْرِ عَدَنَ تَسُوقُ النَّاسَ إِلَى الْمَحْشَرِ» . وَفِي رِوَايَةٍ فِي الْعَاشِرَةِ «وَرِيحٌ تُلْقِي النَّاسَ فِي الْبَحْر» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Hudhaifa b. Asid al-Ghifari told that the Prophet once came on them when they were discussing and asked the subject of their discussion. On being told that they were discussing the last hour he said, \"It will not come till you have seen ten signs before it.\" He then mentioned the smoke, \"a wind will cast mankind into the sea.\" \n    Cf. Quran, 44:10.\n    Cf. Quran, 27:82. \n    Cf. Quran, 18:94; 21:96.\n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5464",
        "url": "https://sunnah.com/mishkat:5464"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 86,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «بَادِرُوا بِالْأَعْمَالِ سِتًّا. الدُّخَانَ وَالدَّجَّالَ وَدَابَّةَ الْأَرْضِ وَطُلُوعَ الشَّمْسِ مِنْ مَغْرِبِهَا وَأَمْرَ الْعَامَّةِ وَخُوَيْصَّةَ أَحَدِكُمْ» . رَوَاهُ مُسْلِمٌ",
      "english": {
        "narrator": "Abu Huraira reported God's messenger as saying, \"Hasten to do good deeds before six things happen:",
        "text": "the smoke, the dajjal, the beast of the earth, the rising of the sun in its place of setting, the trial which will affect all mankind, and the one which applies more particularly to one of you.\"\n*The Arabic is amr al-'amma which I prefer to explain as in the translation above. It could mean the rule in the hands of the common people.\n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5465",
        "url": "https://sunnah.com/mishkat:5465"
      },
      "grade": "صَحِيحٌ (الألباني)"
    },
    {
      "id": 87,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٌو قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّ أَوَّلَ الْآيَاتِ خُرُوجًا طُلُوعُ الشَّمْسِ مِنْ مَغْرِبِهَا وَخُرُوجُ الدَّابَّةِ عَلَى النَّاسِ ضُحًى وَأَيُّهُمَا مَا كَانَتْ قَبْلَ صَاحِبَتِهَا فَالْأُخْرَى على أَثَرهَا قَرِيبا» رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "`Abdallah b. `Amr told that he heard God's messenger say, \"The first of the signs to appear will be the rising of the sun in its place of setting and the coming forth of the beast against mankind in the forenoon. Whichever of them comes first will soon be followed by the other.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5466",
        "url": "https://sunnah.com/mishkat:5466"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 88,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «ثَلَاثٌ إِذَا خَرَجْنَ (لَا يَنْفَعُ نَفْسًا إِيمَانُهَا لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ أَوْ كَسَبَتْ فِي إِيمَانِهَا خَيْرًا)\nطُلُوعُ الشَّمْسِ مِنْ مَغْرِبِهَا وَالدَّجَّالُ وَدَابَّةُ الْأَرْضِ» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "Abu Huraira reported God's messenger as saying, \"When three things appear faith will not benefit anyone who has not previously believed or acquired any good from his faith:",
        "text": "the rising of the sun in its place of setting, the dajjal, and the beast of the earth.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5467",
        "url": "https://sunnah.com/mishkat:5467"
      },
      "grade": "صَحِيحٌ (الألباني)"
    },
    {
      "id": 89,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حِينَ غربت الشَّمْس: «أَيْن تذْهب؟» . قُلْتُ: اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: \n\" فَإِنَّهَا تَذْهَبُ حَتَّى تَسْجُدَ تَحْتَ الْعَرْشِ فَتَسْتَأْذِنُ فَيُؤْذَنُ لَهَا وَيُوشِكُ أَنْ تَسْجُدَ وَلَا يُقْبَلُ مِنْهَا وَتَسْتَأْذِنُ فَلَا يُؤْذَنُ لَهَا وَيُقَالُ لَهَا: ارْجِعِي مِنْ حَيْثُ جِئْتِ فَتَطْلُعُ مِنْ مَغْرِبِهَا فَذَلِكَ قَوْلُهُ تَعَالَى \" (والشمسُ تجْرِي لمستقرّ لَهَا)\nقَالَ: «مستقرها تَحت الْعَرْش» . مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Abu Dharr told that at sunset God's messenger asked him if he knew where the sun went and that when he replied that God and His messenger knew best he said, \"It goes and prostrates itself under the Throne, then asks permission to depart and this is granted; but it will soon prostrate itself and that will not be accepted from it, and will ask permission to depart and that will not be granted. It will be told to go back the way it came, and it will rise in its place of setting.\" That is the meaning of the words of Him who is exalted, \"The sun runs to a determined limit.\" He said that its determined limit is under the Throne. \n*Quran, 36:38\n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5468",
        "url": "https://sunnah.com/mishkat:5468"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 90,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «مَا بَيْنَ خَلْقِ آدَمَ إِلَى قِيَامِ السَّاعَةِ أَمْرٌ أكبر من الدَّجَّال» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "`Imran b. Husain told that he heard God's messenger say, \"Between the creation of Adam and the coming of the last hour there is no more serious matter than the dajjal.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5469",
        "url": "https://sunnah.com/mishkat:5469"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 91,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَن عَبْدُ اللَّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ لَا يَخْفَى عَلَيْكُمْ إِنَّ اللَّهَ تَعَالَى لَيْسَ بِأَعْوَرَ وَإِنَّ الْمَسِيحَ الدَّجَّالَ أَعْوَرُ عَيْنِ الْيُمْنَى كَأَنَّ عَيْنَهُ عنبة طافية» . مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "`Abdallah reported God's messenger as saying, \"God is not hidden from you, God most high is not one-eyed, but the antichrist is blind in the right eye, his eye looking like a floating grape.\" \n*i.e., Ibn Mas'ud\n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5470",
        "url": "https://sunnah.com/mishkat:5470"
      },
      "grade": "مُتَّفق عَلَيْهِ (الألباني)"
    },
    {
      "id": 92,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" مَا مِنْ نَبِيٍّ إِلَّا أَنْذَرَ أُمَّتَهُ الْأَعْوَرَ الْكَذَّابَ أَلَا إِنَّهُ أَعْوَرُ وَإِنَّ رَبَّكُمْ لَيْسَ بِأَعْوَرَ مَكْتُوبٌ بَيْنَ عَيْنَيْهِ: ك ف ر \". مُتَّفَقٌ عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Anas reported God's messenger as saying, \"There is no prophet who has not warned his people about the one-eyed liar. I tell you that he is one-eyed, but your Lord is not one-eyed. On his forehead are the letters k, f, r.\" * \n*Meaning kufr (infidelity) to which he summons people.\n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5471",
        "url": "https://sunnah.com/mishkat:5471"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 93,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِلَّا أحدثكُم حَدِيثا عَن الدَّجَّال ماحدث بِهِ نبيٌّ قومَه؟ : إِنَّه أعوَرُ وإِنَّه يَجِيءُ مَعَهُ بِمِثْلِ الْجَنَّةِ وَالنَّارِ فَالَّتِي يَقُولُ: إِنَّهَا الْجَنَّةُ هِيَ النَّارُ وَإِنِّي أُنْذِرُكُمْ كَمَا أنذر بِهِ نوح قومه \". مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported God's messenger as saying, \"Let me tell you something about the dajjal which no prophet has told his people. He is one-eyed, and will bring with him something like paradise and hell, but what he calls paradise will be hell. I warn you as Noah warned his people about him.\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5472",
        "url": "https://sunnah.com/mishkat:5472"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 94,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ حُذَيْفَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الدَّجَّالَ يَخْرُجُ وَإِنَّ مَعَهُ مَاءً وَنَارًا فَأَمَّا الَّذِي يَرَاهُ النَّاسُ مَاءً فَنَارٌ تَحْرِقُ وَأَمَّا الَّذِي يَرَاهُ النَّاسُ نَارًا فَمَاءٌ بَارِدٌ عَذْبٌ فَمَنْ أَدْرَكَ ذَلِكَ مِنْكُمْ فَلْيَقَعْ فِي الَّذِي يَرَاهُ نَارًا فَإِنَّهُ مَاءٌ عَذْبٌ طَيِّبٌ» . مُتَّفق عَلَيْهِ. وَزَاد مُسلم: «إِن الدجالَ ممسوحُ العينِ عَلَيْهَا ظفرةٌ غليظةٌ مَكْتُوب بَين عَيْنَيْهِ كَافِر يَقْرَؤُهُ كل مُؤمن كاتبٌ وَغير كَاتب»",
      "english": {
        "narrator": "",
        "text": "Hudhaifa reported the Prophet as saying, \"The dajjal will come forth having with him water and fire, and what mankind see as water will be fire which burns and what they see as fire will be cold, sweet water. Any of you who live till that time must fall into what they see as fire, for it is sweet, fresh water.\"\n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5473",
        "url": "https://sunnah.com/mishkat:5473"
      },
      "grade": "مُتَّفق عَلَيْهِ (الألباني)"
    },
    {
      "id": 95,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الدَّجَّالُ أَعْوَرُ الْعَيْنِ الْيُسْرَى جُفَالُ الشَّعَرِ مَعَهُ جَنَّتُهُ وَنَارُهُ فَنَارُهُ جِنَّةٌ وَجَنَّتُهُ نارٌ» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Muslim added, \"The dajjal will have an eye obliterated over which there will be a coarse film, and `Infidel' will be written on his forehead. Every Muslim who can write and those who cannot will read it.\" He reported God's messenger as saying, \"The dajjal is blind in the left eye and has a great quantity, of hair. He will have his paradise and his hell, but his hell will be paradise and his paradise hell.\" \n*kafir The word is written in full in the text. In the tradition of Anas above the alif indicating the long vowel is not written. \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5474",
        "url": "https://sunnah.com/mishkat:5474"
      },
      "grade": null
    },
    {
      "id": 96,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَن النوَّاس بن سمْعَان قَالَ: ذَكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الدَّجَّالَ فَقَالَ: «إِنْ يَخْرُجْ وَأَنَا فِيكُمْ فَأَنَا حَجِيجُهُ دُونَكُمْ وَإِنْ يَخْرُجْ وَلَسْتُ فِيكُمْ فَامْرُؤٌ حَجِيجُ نَفْسِهِ وَاللَّهُ خَلِيفَتِي عَلَى كُلِّ مُسْلِمٍ إِنَّهُ شَابٌّ قَطَطٌ عَيْنُهُ طَافِيَةٌ كَأَنِّي أُشَبِّهُهُ بِعَبْدِ الْعُزَّى بْنِ قَطَنٍ فَمَنْ أَدْرَكَهُ مِنْكُمْ فَلْيَقْرَأْ عَلَيْهِ فَوَاتِحَ سُورَةِ الْكَهْفِ» . وَفِي رِوَايَةٍ «فَلْيَقْرَأْ عَلَيْهِ بِفَوَاتِحِ سُورَةِ الْكَهْفِ فَإِنَّهَا جوارُكم من فتنته إِنَّه خَارج خلة بِي الشَّامِ وَالْعِرَاقِ فَعَاثَ يَمِينًا وَعَاثَ شِمَالًا يَا عِبَادَ اللَّهِ فَاثْبُتُوا» . قُلْنَا: يَا رَسُولَ اللَّهِ وَمَا لَبْثُهُ فِي الْأَرْضِ؟ قَالَ: «أَرْبَعُونَ يَوْمًا يَوْمٌ كَسَنَةٍ وَيَوْمٌ كَشَهْرٍ وَيَوْمٌ كَجُمُعَةٍ وَسَائِرُ أَيَّامِهِ كَأَيَّامِكُمْ» . قُلْنَا: يَا رَسُولَ اللَّهِ فَذَلِكَ الْيَوْمُ الَّذِي كَسَنَةٍ أَتَكْفِينَا فِيهِ صَلَاةُ يَوْمٍ. قَالَ: «لَا اقْدُرُوا لَهُ قَدَرَه» . قُلْنَا: يَا رسولَ اللَّهِ وَمَا إِسْرَاعُهُ فِي الْأَرْضِ؟ قَالَ: \" كَالْغَيْثِ اسْتَدْبَرَتْهُ الرِّيحُ فَيَأْتِي عَلَى الْقَوْمِ فَيَدْعُوهُمْ فَيُؤْمِنُونَ بِهِ فَيَأْمُرُ السَّمَاءَ فَتُمْطِرُ وَالْأَرْضَ فَتُنْبِتُ فَتَرُوحُ عَلَيْهِمْ سَارِحَتُهُمْ أَطْوَلَ مَا كَانَتْ ذُرًى وَأَسْبَغَهُ ضُرُوعًا وَأَمَدَّهُ خَوَاصِرَ ثُمَّ يَأْتِي الْقَوْمَ فَيَدْعُوهُمْ فَيَرُدُّونَ عَلَيْهِ قَوْله فَيَنْصَرِف عَنْهُم فيصبحون مملحين لَيْسَ بِأَيْدِيهِمْ شَيْءٌ مِنْ أَمْوَالِهِمْ وَيَمُرُّ بِالْخَرِبَةِ فَيَقُولُ لَهَا: أَخْرِجِي كُنُوزَكِ فَتَتْبَعُهُ كُنُوزُهَا كَيَعَاسِيبِ النَّحْلِ ثُمَّ يَدْعُو رَجُلًا مُمْتَلِئًا شَبَابًا فَيَضْرِبُهُ بِالسَّيْفِ فَيَقْطَعُهُ جَزْلَتَيْنِ رَمْيَةَ الْغَرَضِ ثُمَّ يَدْعُوهُ فَيُقْبِلُ وَيَتَهَلَّلُ وَجْهُهُ يَضْحَكُ فَبَيْنَمَا هُوَ كَذَلِكَ إِذْ بَعَثَ اللَّهُ الْمَسِيحَ بْنَ مَرْيَمَ فَيَنْزِلُ عِنْد المنارة الْبَيْضَاء شرقيّ دمشق بَين مهروذتين وَاضِعًا كَفَّيْهِ عَلَى أَجْنِحَةِ مَلَكَيْنِ إِذَا طَأْطَأَ رَأسه قطر وَإِذا رَفعه تحدرمنه مثل جُمان كَاللُّؤْلُؤِ فَلَا يحل لكافرٍ يَجِدَ مِنْ رِيحِ نَفَسِهِ إِلَّا مَاتَ وَنَفَسُهُ يَنْتَهِي حَيْثُ يَنْتَهِي طَرْفُهُ فَيَطْلُبُهُ حَتَّى يُدْرِكَهُ بِبَاب لُدٍّ فيقتُلُه ثمَّ يَأْتِي عِيسَى إِلى قَوْمٌ قَدْ عَصَمَهُمُ اللَّهُ مِنْهُ فَيَمْسَحُ عَنْ وُجُوهِهِمْ وَيُحَدِّثُهُمْ بِدَرَجَاتِهِمْ فِي الْجَنَّةِ فَبَيْنَمَا هُوَ كَذَلِكَ إِذْ أَوْحَى اللَّهُ إِلَى عِيسَى: أَنِّي قَدْ أَخْرَجْتُ عِبَادًا لِي لَا يَدَانِ لِأَحَدٍ بِقِتَالِهِمْ فَحَرِّزْ عِبَادِيَ إِلَى الطُّورِ وَيَبْعَثُ اللَّهُ يَأْجُوجَ وَمَأْجُوجَ (وَهُمْ مِنْ كُلِّ حَدَبٍ يَنْسِلُونَ)\nفَيَمُرُّ أَوَائِلُهُمْ عَلَى بُحَيْرَةِ طَبَرِيَّةَ فَيَشْرَبُونَ مَا فِيهَا ويمر آخِرهم وَيَقُول: لَقَدْ كَانَ بِهَذِهِ مَرَّةً مَاءٌ ثُمَّ يَسِيرُونَ حَتَّى يَنْتَهُوا إِلَى جَبَلِ الْخَمَرِ وَهُوَ جَبَلُ بَيْتِ الْمَقْدِسِ فَيَقُولُونَ لَقَدْ قَتَلْنَا مَنْ فِي الْأَرْضِ هَلُمَّ فَلْنَقْتُلْ مَنْ فِي السَّمَاءِ فَيَرْمُونَ بِنُشَّابِهِمْ إِلَى السَّمَاءِ فَيَرُدُّ اللَّهُ عَلَيْهِمْ نُشَّابَهُمْ مَخْضُوبَةً دَمًا وَيُحْصَرُ نَبِيُّ اللَّهِ وَأَصْحَابُهُ حَتَّى يَكُونَ رَأْسُ الثَّوْرِ لِأَحَدِهِمْ خَيْرًا مِنْ مِائَةِ دِينَارٍ لِأَحَدِكُمُ الْيَوْمَ فَيَرْغَبُ نَبِيُّ اللَّهِ عِيسَى وَأَصْحَابُهُ فَيُرْسِلُ اللَّهُ عَلَيْهِمُ النَّغَفَ فِي رِقَابِهِمْ فَيُصْبِحُونَ فَرْسَى كَمَوْتِ نَفْسٍ وَاحِدَةٍ ثُمَّ يَهْبِطُ نَبِيُّ اللَّهِ عِيسَى وَأَصْحَابُهُ إِلَى الْأَرْضِ فَلَا يَجِدُونَ فِي الْأَرْضِ مَوْضِعَ شِبْرٍ إِلَّا مَلَأَهُ زَهَمُهُمْ وَنَتْنُهُمْ فَيَرْغَبُ نَبِيُّ اللَّهِ عِيسَى وَأَصْحَابُهُ إِلَى اللَّهِ فَيُرْسِلُ اللَّهُ طَيْرًا كَأَعْنَاقِ الْبُخْتِ فَتَحْمِلُهُمْ فَتَطْرَحُهُمْ حَيْثُ شَاءَ اللَّهُ «. وَفِي رِوَايَةٍ» تَطْرَحُهُمْ بِالنَّهْبَلِ وَيَسْتَوْقِدُ الْمُسْلِمُونَ مِنْ قِسِيِّهِمْ وَنُشَّابِهِمْ وَجِعَابِهِمْ سَبْعَ سِنِينَ ثُمَّ يُرْسِلُ اللَّهُ مَطَرًا لَا يَكُنُّ مِنْهُ بَيْتُ مَدَرٍ وَلَا وَبَرٍ فَيَغْسِلُ الْأَرْضَ حَتَّى يَتْرُكَهَا كَالزَّلَفَةِ ثُمَّ يُقَالُ لِلْأَرْضِ: أَنْبِتِي ثَمَرَتَكِ وَرُدِّي بَرَكَتَكِ فَيَوْمَئِذٍ تَأْكُلُ الْعِصَابَةُ مِنَ الرُّمَّانَةِ وَيَسْتَظِلُّونَ بِقِحْفِهَا وَيُبَارَكُ فِي الرِّسْلِ حَتَّى إِنَّ اللِّقْحَةَ مِنَ الْإِبِلِ لَتَكْفِي الْفِئَامَ مِنَ النَّاسِ وَاللِّقْحَةَ مِنَ الْبَقَرِ لَتَكْفِي الْقَبِيلَةَ مِنَ النَّاسِ وَاللِّقْحَةَ مِنَ الْغَنَمِ لَتَكْفِي الْفَخْذَ مِنَ النَّاسِ فَبَيْنَا هُمْ كَذَلِكَ إِذْ بَعَثَ اللَّهُ رِيحًا طَيِّبَةً فَتَأْخُذُهُمْ تَحْتَ آبَاطِهِمْ فَتَقْبِضُ رُوحَ كُلِّ مؤمنٍ وكلِّ مسلمٍ وَيَبْقَى شِرَارُ النَّاسِ يَتَهَارَجُونَ فِيهَا تَهَارُجَ الْحُمُرِ فَعَلَيْهِمْ تَقُومُ السَّاعَةُ \" رَوَاهُ مُسْلِمٌ إِلَّا الرِّوَايَةَ الثَّانِيَةَ وَهِيَ قَوْلُهُ: \" تَطْرَحُهُمْ بِالنَّهْبَلِ إِلَى قَوْلِهِ: سبع سِنِين \". رَوَاهَا التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "An-Nawwas b. Sam`a.n told that God's messenger mentioned the dajjal saying, \"If he comes forth while I am among you I shall be the one who will dispute with him on your behalf, but if he comes forth when I am not among you a man must dispute on his own behalf, and God will take my place in looking after every Muslim. He will be a youth with curly hair and a floating eye whom I might compare to `Abd al- `Uzza b. Qatan. Those of you who live till his time should recite over him the opening verses of sura al-Kahf and the Muslims will burn their bows, arrows, and quivers for seven years.) God will then send a rain which no house of clay or camel's wool will keep out and it will wash the earth till it leaves it like a mirror. The earth will then be told to bring forth its fruit and restore its blessing, and on that day a company of people will eat a pomegranate and seek shelter in its skin, and the milk will be blessed so that a milch-camel will be sufficient for a number of people, a cow in milk will be sufficient for a tribe of men and a ewe will be sufficient for a clan of men. At that time God will send a pleasant wind which will take them under their arm pits and the spirit of every believer and every Muslim will be taken, but the wicked people will remain in the earth and will be disorderly like asses. Then the last hour will come to them.\" \n1-Quran, 18. \n2-Quran, 21:96. \n3-In the Arabic of this sentence the plural is used for 'first' and the singular for `last.' \n4-This appears as a proper name in the tradition, but Taj al-arus in the article hbl says this is an error for al-mahbal which means a great pit. Cf also Ibn al-Athir, Nihaya, 4:252.\n\n\n\nMuslim transmitted it, except for the second version which is \"They will throw them into an-Nahbal... seven years.\" That is transmitted by Tirmidhi."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5475",
        "url": "https://sunnah.com/mishkat:5475"
      },
      "grade": null
    },
    {
      "id": 97,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" يَخْرُجُ الدَّجَّالُ فَيَتَوَّجُهُ قِبَلَهُ رَجُلٌ مِنَ الْمُؤْمِنِينَ فَيَلْقَاهُ الْمَسَالِحُ مَسَالِحُ الدَّجَّالِ. فَيَقُولُونَ لَهُ: أَيْنَ تَعْمِدُ؟ فَيَقُولُ: أَعْمِدُ إِلَى هَذَا الَّذِي خَرَجَ. قَالَ: فَيَقُولُونَ لَهُ: أَو مَا تبَارك وَتَعَالَى ؤمن بِرَبِّنَا؟ فَيَقُولُ: مَا بِرَبِّنَا خَفَاءٌ. فَيَقُولُونَ: اقْتُلُوهُ. فَيَقُولُ بَعْضُهُمْ لِبَعْضٍ: أَلَيْسَ قَدْ نَهَاكُمْ رَبُّكُمْ أَنْ تَقْتُلُوا أَحَدًا دُونَهُ \". قَالَ: \" فَيَنْطَلِقُونَ بِهِ إِلَى الدَّجَّالِ فَإِذَا رَآهُ الْمُؤْمِنُ قَالَ: يَا أَيُّهَا النَّاسُ هَذَا الدَّجَّالُ الَّذِي ذَكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \". قَالَ: \" فَيَأْمُرُ الدَّجَّال بِهِ فَيُشَبَّحُ. فَيَقُولُ: خُذُوهُ وَشُجُّوهُ فَيُوسَعُ ظَهْرُهُ وَبَطْنُهُ ضَرْبًا \". قَالَ: \" فَيَقُول: أَوَ مَا تُؤْمِنُ بِي؟ \" قَالَ: \" فَيَقُولُ: أَنْتَ الْمَسِيحُ الْكَذَّابُ \". قَالَ: «فيؤْمر بِهِ فَيْؤشَرُ بالمنشارِ مِنْ مَفْرِقِهِ حَتَى يُفَرَّقَ بَيْنَ رِجْلَيْهِ» . قَالَ: \" ثُمَّ يَمْشِي الدَّجَّالُ بَيْنَ الْقِطْعَتَيْنِ ثُمَّ يَقُولُ لَهُ: أتؤمنُ بِي؟ فَيَقُول: مَا ازْدَدْتُ إِلَّا بَصِيرَةً \". قَالَ: \" ثُمَّ يَقُولُ: يَا أَيُّهَا النَّاسُ إِنَّهُ لَا يَفْعَلُ بَعْدِي بِأَحَدٍ مِنَ النَّاسِ \". قَالَ: «فَيَأْخُذُهُ الدَّجَّالُ لِيَذْبَحَهُ فَيُجْعَلُ مَا بَيْنَ رَقَبَتِهِ إِلَى تَرْقُوَتِهِ نُحَاسًا فَلَا يَسْتَطِيع إِليه سَبِيلا» قَالَ: «فَيَأْخذهُ بِيَدَيْهِ وَرِجْلَيْهِ فَيَقْذِفُ بِهِ فَيَحْسِبُ النَّاسُ أَنَّمَا قَذَفَهُ إِلَى النَّارِ وَإِنَّمَا أُلْقِيَ فِي الْجَنَّةُ» فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَذَا أَعْظَمُ النَّاسِ شَهَادَةً عِنْدَ رَبِّ الْعَالَمِينَ» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Abu Sa'id al-Khudri reported God's messenger as saying, \"When the dajjal comes forth one of the believers will go towards him, and the armed men, those of the dajjal, will meet him and ask him where he is making for. He will reply that he is making for this man who has come forth, whereupon they will ask him whether he does not believe in their lord, and when he replies, `There is nothing hidden about our Lord,' they will say, `Kill him.' But they will ask one another whether their lord has not forbidden them to kill anyone without his knowledge, and so they will take him to the dajjal; and when the believer sees him, he will say, `0 people, this is the dajjal whom God's messenger mentioned.' The dajjal will then order that he be stretched out, saying, `Take him and stretch him out.' After he has been given many blows on his back and stomach, he will ask him if he does not believe in him, but he will reply that he is the false Messiah. He will then order him to be sawn with a saw from the parting of his hair to between his legs, after which the dajjal will walk between the two pieces and tell him to get up. When he stands up he will ask him if he believes in him, to which he will reply that he has simply received more insight into his true nature, adding, `0 people, no one will be treated thus after me.' The dajjal will then seize him to cut his throat, but the space between bis neck and his collar-bone will be turned into copper and he will find no way by which he can kill him, so he will take him by the hands and feet and throw him into the air, and the people will think he has thrown him into hell, but he will simply have been thrown into paradise.\" God's messenger said, \"This will be the one who suffers the severest martyrdom in the sight of the Lord of the universe.\"\n \nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5476",
        "url": "https://sunnah.com/mishkat:5476"
      },
      "grade": null
    },
    {
      "id": 98,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَن أمّ شريكٍ قَالَتْ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيَفِرَّنَّ النَّاسُ مِنَ الدَّجَّالِ حَتَّى يَلْحَقُوا بِالْجِبَالِ» قَالَتْ أُمُّ شَرِيكٍ: قُلْتُ: يَا رَسُولَ اللَّهِ فَأَيْنَ الْعَرَبُ يَوْمَئِذٍ؟ قَالَ: «هُمْ قَلِيلٌ» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Umm Sharik reported God's messenger as saying, \"People will fly from the dajjal till they get to the mountains.\" She asked where the Arabs would be in that day, and he replied that they would be few. \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5477",
        "url": "https://sunnah.com/mishkat:5477"
      },
      "grade": null
    },
    {
      "id": 99,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَنَسٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَتْبَعُ الدَّجَّالَ مِنْ يَهُودِ أصفَهانَ سبعونَ ألفا عَلَيْهِم طيالسة» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Anas reported God's messenger as saying, \"The dajjal will be followed by seventy thousand Jews of Isfahan wearing Persian shawls.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5478",
        "url": "https://sunnah.com/mishkat:5478"
      },
      "grade": null
    },
    {
      "id": 100,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" يَأْتِي الدَّجَّالُ وَهُوَ مُحَرَّمٌ عَلَيْهِ أَنْ يَدْخُلَ نِقَابَ الْمَدِينَةِ فَيَنْزِلُ بَعْضَ السِّبَاخِ الَّتِي تَلِي الْمَدِينَةَ فَيَخْرُجُ إِلَيْهِ رَجُلٌ وَهُوَ خَيْرُ النَّاسِ أَوْ مِنْ خِيَارِ النَّاسِ فَيَقُولُ: أَشْهَدُ أَنَّكَ الدَّجَّالُ الَّذِي حَدَّثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدِيثَهُ فَيَقُولُ الدَّجَّالُ: أَرَأَيْتُمْ إِنْ قَتَلْتُ هَذَا ثُمَّ أَحْيَيْتُهُ هَلْ تَشُكُّونَ فِي الْأَمْرِ؟ فَيَقُولُونَ: لَا فَيَقْتُلُهُ ثُمَّ يُحْيِيهِ فَيَقُولُ: وَاللَّهِ مَا كُنْتُ فِيكَ أَشَدَّ بَصِيرَةً مِنِّي الْيَوْمَ فَيُرِيدُ الدَّجَّالُ أَنْ يَقْتُلَهُ فَلَا يُسَلَّطُ عَلَيْهِ \". مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Abu Sa'id al-Khudri reported God's messenger as saying, \"The dajjal will come but will not be allowed to enter the mountain passes of Medina, so he will alight in one of the salt tracts which are near Medina. A man who is the best (or, one of the best) of the people will go out to him, and will say he testifies that he is the dajjal the report of whom was given them by God's messenger. The dajjal will then ask the people to tell him whether, supposing he kills this man and brings him back to life, they will have any doubts about the matter, and when they reply that they will not he will kill him and afterwards bring him back to life. The man will then say, `I swear by God that I have had no clearer insight into your true nature than I have to-day.' The dajjal will therefore want to kill him, but will not be given power over him.\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5479",
        "url": "https://sunnah.com/mishkat:5479"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 101,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَأْتِي الْمَسِيحُ مِنْ قِبَلِ الْمَشْرِقِ هِمَّتُهُ الْمَدِينَةُ حَتَّى يَنْزِلَ دُبُرَ أُحُدٍ ثُمَّ تَصْرِفُ الْمَلَائِكَةُ وَجْهَهُ قِبَلَ الشامِ وهنالك يهلِكُ» . مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported God's messenger as saying, \"The Messiah will come from the East making for Medina and will alight behind Uhud, but the angels will then turn his face towards Syria and he will perish there.\" \n*i.e., the dajjal\n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5480",
        "url": "https://sunnah.com/mishkat:5480"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 102,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي بَكْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَدْخُلُ الْمَدِينَةَ رُعْبُ الْمَسِيحِ الدَّجَّالِ لَهَا يَوْمَئِذٍ سَبْعَةُ أَبْوَابٍ عَلَى كُلِّ بَابٍ مَلَكَانِ» رَوَاهُ البُخَارِيّ",
      "english": {
        "narrator": "",
        "text": "Abu Bakra reported the Prophet as saying, \"The terror of the antichrist will not enter Medina, which will on that day have seven gates with two angels at each gate.\" \n*i.e., the dajjal\n\nBukhari transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5481",
        "url": "https://sunnah.com/mishkat:5481"
      },
      "grade": null
    },
    {
      "id": 103,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَن فَاطِمَة بنت قيس قَالَتْ: سَمِعْتُ مُنَادِي رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمَّا قَضَى صَلَاتَهُ جَلَسَ عَلَى الْمِنْبَرِ وَهُوَ يَضْحَكُ فَقَالَ: «لِيَلْزَمْ كُلُّ إِنْسَانٍ مُصَلَّاهُ» . ثُمَّ قَالَ: «هَلْ تَدْرُونَ لِمَ جَمَعْتُكُمْ؟» . قَالُوا: اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: \" إِنِّي وَاللَّهِ مَا جَمَعْتُكُمْ لِرَغْبَةٍ وَلَا لِرَهْبَةٍ وَلَكِنْ جَمَعْتُكُمْ لِأَنَّ تَمِيمًا الدَّارِيَّ كَانَ رَجُلًا نَصْرَانِيًّا فَجَاءَ فَبَايَعَ وَأَسْلَمَ وَحَدَّثَنِي حَدِيثًا وَافَقَ الَّذِي كُنْتُ أُحَدِّثُكُمْ بِهِ عَنِ الْمَسِيحِ الدَّجَّالِ حَدَّثَنِي أَنَّهُ رَكِبَ فِي سَفِينَةٍ بَحْرِيَّةٍ مَعَ ثَلَاثِينَ رَجُلًا مِنْ لَخْمٍ وَجُذَامَ فَلَعِبَ بِهِمُ الْمَوْجُ شَهْرًا فِي الْبَحْر فأرفؤُوا إِلَى جَزِيرَةٍ حِينَ تَغْرُبُ الشَّمْسُ فَجَلَسُوا فِي أقرب سفينة فَدَخَلُوا الْجَزِيرَةَ فَلَقِيَتْهُمْ دَابَّةٌ أَهْلَبُ كَثِيرُ الشَّعَرِ لَا يَدْرُونَ مَا قُبُلُهُ مِنْ دُبُرِهِ مِنْ كَثْرَةِ الشَّعَرِ قَالُوا: وَيْلَكِ مَا أَنْتِ؟ قَالَتْ: أَنَا الْجَسَّاسَةُ قَالُوا: وَمَا الْجَسَّاسَةُ؟ قَالَتْ: أَيُّهَا الْقَوْمُ انْطَلِقُوا إِلَى هَذَا الرَّجُلِ فِي الدَّيْرِ فَإِنَّهُ إِلَى خَبَرِكُمْ بِالْأَشْوَاقِ قَالَ: لَمَّا سَمَّتْ لَنَا رَجُلًا فَرِقْنَا مِنْهَا أَنْ تَكُونَ شَيْطَانَةً قَالَ: فَانْطَلَقْنَا سِرَاعًا حَتَّى دَخَلْنَا الدَّيْرَ فَإِذَا فِيهِ أعظمُ إِنسان مَا رَأَيْنَاهُ قطُّ خَلْقاً وأشَدُّهُ وَثَاقاً مجموعةٌ يَده إِلَى عُنُقِهِ مَا بَيْنَ رُكْبَتَيْهِ إِلَى كَعْبَيْهِ بِالْحَدِيدِ. قُلْنَا: وَيْلَكَ مَا أَنْتَ؟ قَالَ: قَدْ قَدَرْتُمْ عَلَى خَبَرِي فَأَخْبِرُونِي مَا أَنْتُمْ؟ قَالُوا: نَحن أُناس من العربِ ركبنَا فِي سفينةٍ بحريّة فلعِبَ بِنَا الْبَحْر شهرا فَدَخَلْنَا الجزيرة فَلَقِيَتْنَا دَابَّةٌ أَهْلَبُ فَقَالَتْ: أَنَا الْجَسَّاسَةُ اعْمِدُوا إِلَى هَذَا فِي الدَّيْرِ فَأَقْبَلْنَا إِلَيْكَ سِرَاعًا وَفَزِعْنَا مِنْهَا وَلَمْ نَأْمَنْ أَنْ تَكُونَ شَيْطَانَةً فَقَالَ: أَخْبِرُونِي عَنْ نَخْلِ بَيْسَانَ قُلْنَا: عَنْ أَيِّ شَأْنِهَا تَسْتَخْبِرُ؟ قَالَ: أَسْأَلُكُمْ عَنْ نَخْلِهَا هَلْ تُثْمِرُ؟ قُلْنَا: نَعَمْ. قَالَ: أَمَا إِنَّهَا تُوشِكُ أَنْ لَا تُثْمِرَ. قَالَ: أَخْبِرُونِي عَنْ بُحَيْرَةِ الطَّبَرِيَّةِ قُلْنَا: عَنْ أَيِّ شَأْنِهَا تَسْتَخْبِرُ؟ قَالَ: هَلْ فِيهَا مَاءٌ؟ قُلْنَا هِيَ كَثِيرَةُ الْمَاءِ. قَالَ: أَمَا إِنَّ مَاءَهَا يُوشِكُ أَنْ يَذْهَبَ. قَالَ: أَخْبِرُونِي عَنْ عَيْنِ زُغَرَ. قَالُوا: وَعَنْ أَيِّ شَأْنِهَا تَسْتَخْبِرُ؟ قَالَ: هَلْ فِي الْعَيْنِ مَاءٌ؟ وَهَلْ يَزْرَعُ أَهْلُهَا بِمَاءِ الْعَيْنِ؟ قُلْنَا لَهُ: نعم هِيَ كَثِيرَة المَاء وَأَهله يَزْرَعُونَ مِنْ مَائِهَا. قَالَ: أَخْبِرُونِي عَنْ نَبِيِّ الْأُمِّيِّينَ مَا فَعَلَ؟ قُلْنَا: قَدْ خَرَجَ مِنْ مَكَّةَ وَنَزَلَ يَثْرِبَ. قَالَ: أَقَاتَلَهُ الْعَرَبُ؟ قُلْنَا: نَعَمْ. قَالَ: كَيْفَ صَنَعَ بِهِمْ؟ فَأَخْبَرْنَاهُ أَنَّهُ قَدْ ظَهَرَ عَلَى مَنْ يَلِيهِ مِنَ الْعَرَبِ وأطاعوهُ. قَالَ لَهُم: قد كانَ ذلكَ؟ قُلْنَا: نعم. قَالَ: أَمَا إِنَّ ذَلِكَ خَيْرٌ لَهُمْ أَنْ يُطِيعُوهُ وَإِنِّي مُخْبِرُكُمْ عَنِّي: إِنِّي أَنَا الْمَسِيحُ الدَّجَّالُ وَإِنِّي يُوشِكُ أَنْ يُؤْذَنَ لِي فِي الْخُرُوجِ فَأَخْرُجَ فَأَسِيرَ فِي الْأَرْضِ فَلَا أَدَعُ قَرْيَةً إِلَّا هَبَطْتُهَا فِي أَرْبَعِينَ لَيْلَةً غَيْرَ مَكَّةَ وَطَيْبَةَ هُمَا مُحَرَّمَتَانِ عَلَيَّ كِلْتَاهُمَا كُلَّمَا أَرَدْتُ أَنْ أَدْخُلَ وَاحِدَةً أَوْ وَاحِدًا مِنْهُمَا استقبلَني ملَكٌ بيدهِ السيفُ صَلْتًا يَصُدُّنِي عَنْهَا وَإِنَّ عَلَى كُلِّ نَقْبٍ مِنْهَا مَلَائِكَةً يَحْرُسُونَهَا. \" قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ - وَطَعَنَ بِمِخْصَرَتِهِ فِي الْمِنْبَرِ -: «هَذِه طَيْبَةُ هَذِهِ طَيْبَةُ هَذِهِ طَيْبَةُ» يَعْنِي الْمَدِينَةَ «أَلَا هَلْ كُنْتُ حَدَّثْتُكُمْ؟» فَقَالَ النَّاسُ: نَعَمْ فَإِنَّهُ أَعْجَبَنِي حَدِيثُ تَمِيمٍ أَنَّهُ وَافَقَ الَّذِي كُنْتُ أُحَدِّثُكُمْ عَنْهُ وَعَنِ الْمَدِينَةِ وَمَكَّةَ. أَلَا إِنه فِي بَحر الشَّأمِ أَو بحرِ اليمنِ لَا بل من قبل الْمشرق ماهو من قبل الْمشرق ماهو من قبل الْمشرق ماهو \" وَأَوْمَأَ بِيَدِهِ إِلَى الْمشرق. رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Fatima, daughter of Qais told that she had heard God's messenger's crier calling to congregational prayer, so she went out to the mosque and prayed along with God's messenger. When he had finished his prayer, he sat on the pulpit laughing and told everyone to remain where he had said the prayer. He then asked them if they knew why he had assembled them, and when they replied that God and His messenger knew best, he said, \"I swear by God that I have not assembled you for some pleasant purpose or because of fear, but I have assembled you because Tamim ad-Dari, a Christian who came and accepted Islam, told me something which agrees with what I was telling you about the antichrist. He told me that he had sailed in a ship along with thirty men of Lakhm and Judham and that they were storm-tossed for a month. They drew near to an island when the sun was setting and going into the ship's small boats they went ashore where they were met by a very hairy beast whose hair was so abundant that because of it they could not tell its front from its back. They said, `Woe to you! What can you be?' and it replied, `I am the Jassasa.1  Go to this man in the monastery, for he is anxious to get news of you.' He said that when it named a man to them, they were afraid of it lest it should be a she-devil so they went off quickly and entered the monastery where they found a man with the hugest and strongest frame they had ever seen with his hand joined to his neck and in irons from the knees to the ankles. They said, `Woe to you! Who are you?' and he replied that they had had the opportunity of knowing about him, so they must tell him who they were. They said they were Arabs who had sailed in a ship and after having been storm-tossed for a month had landed on the island where they were met by a very hairy beast which informed them that it was the jassasa and told them to go to this man in the monastery, so they had come to him quickly. He asked them to tell him about the palm trees of Baisan whether they were producing fruit, and when they told him that they were, he said they would soon cease to bear fruit. He asked them to tell him about the lake of Tiberias whether there was water in it, and when they replied that it contained a great quantity of water he said that its water, would soon disappear. He asked them to tell him about the spring of Zughar?\" On their replying that he had, he said, \"I assure you that he is in the Syrian sea or the Yemen Sea; no, on the contrary, it is towards the East that he is and he pointed his hand to the East. \n1. The name of a beast which is to seek for news to take to the dajjal.\n2. Different explanations are given of this name. It is said to have been a spring in the Balqa in Syria and    to have been connected with a daughter of Lot.\n3. A name for Medina.\n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5482",
        "url": "https://sunnah.com/mishkat:5482"
      },
      "grade": null
    },
    {
      "id": 104,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \" رَأَيْتُنِي اللَّيْلَةَ عِنْدَ الْكَعْبَةِ فَرَأَيْتُ رَجُلًا آدَمَ كَأَحْسَنِ مَا أَنْتَ رَاءٍ مِنْ أُدْمِ الرِّجَالِ لَهُ لِمَّةٌ كَأَحْسَنِ مَا أَنْتَ رَاءٍ مِنَ اللِّمَمِ قد رجَّلَها فَهِيَ تقطر مَاء متكأ عَلَى عَوَاتِقِ رَجُلَيْنِ يَطُوفُ بِالْبَيْتِ فَسَأَلْتُ: مَنْ هَذَا؟ فَقَالُوا: هَذَا الْمَسِيح بن مَرْيَمَ \" قَالَ: \" ثُمَّ إِذَا أَنَا بَرْجُلٍ جَعْدٍ قَطَطٍ أَعْوَرِ الْعَيْنِ الْيُمْنَى كَأَنَّ عَيْنَهُ عِنَبَةٌ طَافِيَةٌ كَأَشْبَهِ مَنْ رَأَيْتُ مِنَ النَّاسِ بِابْنِ قَطَنٍ وَاضِعًا يَدَيْهِ عَلَى مَنْكِبَيْ رَجُلَيْنِ يَطُوفُ بِالْبَيْتِ فَسَأَلْتُ مَنْ هَذَا؟ فَقَالُوا: هَذَا الْمَسِيحُ الدَّجَّالُ \". مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ: قَالَ فِي الدَّجَّالِ: «رَجُلٌ أَحْمَرُ جَسِيمٌ جَعْدُ الرَّأْسِ أَعْوَرُ عَيْنِ الْيُمْنَى أَقْرَبُ النَّاسِ بِهِ شَبَهًا ابْنُ قَطَنٍ»\nوَذَكَرَ حَدِيثَ أَبِي هُرَيْرَةَ: «لَا تَقُومُ السَّاعَةُ حَتَّى تَطْلُعَ الشَّمْسُ مِنْ مَغْرِبِهَا» فِي «بَابِ الْمَلَاحِمِ»\nوَسَنَذْكُرُ حَدِيثَ ابْنِ عُمَرَ: قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي النَّاس فِي «بَاب قصَّة ابْن الصياد» إِن شَاءَ الله تَعَالَى",
      "english": {
        "narrator": "",
        "text": "`Abdallah b. `Umar reported God's messenger as saying, \"Last night I found myself in a vision at the Ka`ba and saw a ruddy man like the most good-looking of that type that you can see with the most beautiful lock of hair you can see. He had combed it out, and it was dripping with water. He was leaning on the shoulders of two men and going round the House. When I asked who he was I was told that he was the Messiah, son of Mary. Then I saw a man with short, woolly hair who was blind in the right eye, his eye looking like a floating grape. I have never seen anyone more closely resembling Ibn Qatan. He was placing his hands on the shoulders of two men and going round the House. I asked who this man was and was told that he was the antichrist.\" In a version he said about the dajjal that he was a red, fleshy man with woolly hair, blind in the right eye, Ibn Qatan being the one who resembled him most closely. \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5483",
        "url": "https://sunnah.com/mishkat:5483"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 105,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ فِي حَدِيثِ تَمِيمٍ الدَّارِيِّ: قَالَتْ: قَالَ: فَإِذَا أَنَا بِامْرَأَةٍ تَجُرُّ شَعَرَهَا قَالَ: مَا أَنْتِ؟ قَالَتْ: أَنَا الْجَسَّاسَةُ اذْهَبْ إِلَى ذَلِكَ الْقَصْرِ فَأَتَيْتُهُ فَإِذَا رَجُلٌ يَجُرُّ شَعَرَهُ مُسَلْسَلٌ فِي الْأَغْلَالِ يَنْزُو فِيمَا بَيْنُ السَّمَاءِ وَالْأَرْضِ. فَقُلْتُ: مَنْ أَنْتَ؟ قَالَ: أَنا الدَّجَّال \". رَوَاهُ أَبُو دَاوُد",
      "english": {
        "narrator": "",
        "text": "Fatima, daughter of Qais told in the tradition of Tamim ad-Dari that he said, \"Then I saw a woman who was trailing her hair and asked who she was. She replied that she was the jassasa and told me to go to that castle. I went to it and found a man with trailing hair, bound in fetters, leaping between heaven and earth, and when I asked him who he was he replied that he was the dajjal.'' \n\nAbu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5484",
        "url": "https://sunnah.com/mishkat:5484"
      },
      "grade": null
    },
    {
      "id": 106,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ عُبَادَةَ بْنِ الصَّامِتِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنِّي حَدَّثْتُكُمْ عَنِ الدَّجَّالِ حَتَّى خَشِيتُ أَنْ لَا تَعْقِلُوا. إِنَّ الْمَسِيحَ الدَّجَّالَ قَصِيرٌ أَفْحَجُ جَعْدٌ أَعْوَرُ مَطْمُوسُ الْعَيْنِ لَيْسَتْ بِنَاتِئَةٍ وَلَا حَجْرَاءَ فَإِنْ أُلْبِسَ عَلَيْكُمْ فَاعْلَمُوا أَنَّ رَبَّكُمْ لَيْسَ بِأَعْوَرَ» رَوَاهُ أَبُو دَاوُد",
      "english": {
        "narrator": "",
        "text": "`Ubada b. as-Samit reported God's messenger as saying, \"I have told you so much about the dajjal that I am afraid you may not understand. The antichrist is short, hen-toed, woolly-haired, one-eyed, an eye sightless and neither protruding nor deep-seated. If you are confused about him, know that your Lord is not one-eyed.\" \n*It may also mean 'bandy-legged.\n\nAbu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5485",
        "url": "https://sunnah.com/mishkat:5485"
      },
      "grade": null
    },
    {
      "id": 107,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَن أَي عُبَيْدَةَ بْنِ الْجَرَّاحِ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّهُ لَمْ يَكُنْ نَبِيٌّ بَعْدَ نُوحٍ إِلَّا قَدْ أَنْذَرَ الدجالَ قومَه وإِني أُنذركموه» فرصفه لَنَا قَالَ: «لَعَلَّهُ سَيُدْرِكُهُ بَعْضُ مَنْ رَآنِي أَوْ سَمِعَ كَلَامِي» . قَالُوا: يَا رَسُولَ اللَّهِ فَكَيْفَ قُلُوبُنَا يَوْمَئِذٍ؟ قَالَ: «مِثْلُهَا» يَعْنِي الْيَوْمَ «أوخير» . رَوَاهُ التِّرْمِذِيّ وَأَبُو دَاوُد",
      "english": {
        "narrator": "",
        "text": "Abu `Ubaida b. al-Jarrah told that he heard God's-messenger say, \"There has been no prophet after Noah who has not warned his people about the dajjal, and I warn you of him.\" He then described him to them, saying, \"Perhaps some who have seen me or heard my words will live till his time.\" God's messenger was asked what the condition of their hearts would be on that day, and he replied, \"Like what they are (meaning at the time he was speaking), or better.'\n\nTirmidhi and Abu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5486",
        "url": "https://sunnah.com/mishkat:5486"
      },
      "grade": null
    },
    {
      "id": 108,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ عَمْرِو بْنِ حُرَيْثٍ عَنْ أَبِي بَكْرٍ الصّديق قَالَ: حَدَّثَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" الدَّجَّالُ يَخْرُجُ مِنْ أَرْضٍ بِالْمَشْرِقِ يُقَالُ لَهَا: خُرَاسَانُ يَتْبَعُهُ أَقْوَامٌ كَأَنَّ وُجُوهَهُمُ المجانّ المطرقة \". رَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "`Amr b. Huraith quoted Abu Bakr as-Siddiq as saying that God's messenger told them the dajjal would come forth from a land in the East called Khurasan followed by peoples whose faces resemble shields covered with skin. \n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5487",
        "url": "https://sunnah.com/mishkat:5487"
      },
      "grade": null
    },
    {
      "id": 109,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ سَمِعَ بالدجال فلينأ مِنْهُ فو الله إِنَّ الرَّجُلَ لَيَأْتِيهِ وَهُوَ يَحْسِبُ أَنَّهُ مُؤْمِنٌ فَيَتَّبِعُهُ مِمَّا يَبْعَثُ بِهِ مِنَ الشُّبُهَاتِ» رَوَاهُ أَبُو دَاوُد",
      "english": {
        "narrator": "",
        "text": "`Imran b. Husain reported God's messenger as saying, \"Let him who hears of the dajjal go far from him, for I swear by God that a man will come to him thinking he is a believer and follow him because of confused ideas which he rouses in him.\" \n\nAbu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5488",
        "url": "https://sunnah.com/mishkat:5488"
      },
      "grade": null
    },
    {
      "id": 110,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَن أَسمَاء بنت يزِيد بن السَّكن قَالَتْ: قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَمْكُثُ الدَّجَّالُ فِي الْأَرْضِ أَرْبَعِينَ سَنَةً السَّنَةُ كَالشَّهْرِ وَالشَّهْرُ كَالْجُمُعَةِ وَالْجُمُعَةُ كَالْيَوْمِ وَالْيَوْمُ كَاضْطِرَامِ السَّعَفَةِ فِي النَّارِ» . رَوَاهُ فِي «شَرْحِ السُّنَّةِ»",
      "english": {
        "narrator": "",
        "text": "Asma' daughter of Yazid b. as-Sakan reported the Prophet a saying, \"The dajjal will remain in the earth forty years, a year being like a month, a month like a week, a week like a day, and a day like the time it takes to burn a palm-branch.\" \n\nIt is transmitted in Sharh as sunna."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5489",
        "url": "https://sunnah.com/mishkat:5489"
      },
      "grade": null
    },
    {
      "id": 111,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَتْبَعُ الدَّجَّالَ مِنْ أُمَّتِي سَبْعُونَ أَلْفًا عَلَيْهِمُ السِّيجَانُ» . رَوَاهُ فِي \" شرح السّنة",
      "english": {
        "narrator": "",
        "text": "Abu Sa'id al-Khudri reported God's messenger as saying, \"The dajjal will be followed by seventy thousand of my people wearing dark cloaks.\" \n\nIt is transmitted in Sharh as-sunna."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5490",
        "url": "https://sunnah.com/mishkat:5490"
      },
      "grade": null
    },
    {
      "id": 112,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَن أسماءَ بنتِ يزيدَ قَالَتْ: كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي بَيْتِي فَذَكَرَ الدَّجَّالَ فَقَالَ: \" إِنَّ بَيْنَ يَدَيْهِ ثَلَاث سِنِين سنة تمسلك السَّمَاءُ فِيهَا ثُلُثَ قَطْرِهَا وَالْأَرْضُ ثُلُثَ نَبَاتِهَا. وَالثَّانِيَةُ تُمْسِكُ السَّمَاءُ ثُلُثَيْ قَطْرِهَا وَالْأَرْضُ ثُلُثَيْ نَبَاتِهَا. وَالثَّالِثَةُ تُمْسِكُ السَّمَاءُ قَطْرَهَا كُلَّهُ وَالْأَرْضُ نَبَاتَهَا كُلَّهُ. فَلَا يَبْقَى ذَاتُ ظِلْفٍ وَلَا ذَاتُ ضِرْسٍ مِنَ الْبَهَائِمِ إِلَّا هَلَكَ وَإِنَّ مِنْ أَشَدِّ فِتْنَتِهِ أَنَّهُ يَأْتِي الْأَعْرَابِيَّ فَيَقُولُ: أَرَأَيْتَ إِنْ أَحْيَيْتُ لَكَ إِبِلَكَ أَلَسْتَ تَعْلَمُ أَنِّي رَبُّكَ؟ فَيَقُولُ بَلَى فَيُمَثِّلُ لَهُ الشَّيْطَانَ نَحْوَ إِبِلِهِ كَأَحْسَنِ مَا يَكُونُ ضُرُوعًا وَأَعْظَمِهِ أَسْنِمَةً \". قَالَ: \" وَيَأْتِي الرَّجُلَ قَدْ مَاتَ أَخُوهُ وَمَاتَ أَبُوهُ فَيَقُولُ: أَرَأَيْتَ إِنْ أَحْيَيْتُ لَكَ أَبَاكَ وَأَخَاكَ أَلَسْتَ تَعْلَمُ أَنِّي رَبُّكَ؟ فَيَقُولُ: بَلَى فَيُمَثِّلُ لَهُ الشَّيَاطِينَ نَحْوَ أَبِيهِ وَنَحْوَ أَخِيهِ \". قَالَتْ: ثُمَّ خَرَجَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لِحَاجَتِهِ ثُمَّ رَجَعَ وَالْقَوْمُ فِي اهْتِمَامٍ وَغَمٍّ مِمَّا حَدَّثَهُمْ. قَالَتْ: فَأَخَذَ بِلَحْمَتَيِ الْبَابِ فَقَالَ: «مَهْيَمْ أَسْمَاءُ؟» قُلْتُ: يَا رَسُولَ اللَّهِ لَقَدْ خَلَعْتَ أَفْئِدَتَنَا بِذِكْرِ الدَّجَّالِ. قَالَ: «إِنْ يَخْرُجْ وَأَنَا حَيٌّ فَأَنَا حَجِيجُهُ وَإِلَّا فإِنَّ رَبِّي خليفتي علىكل مُؤْمِنٍ» فَقُلْتُ: يَا رَسُولَ اللَّهِ وَاللَّهِ إِنَّا لَنَعْجِنُ عَجِينَنَا فَمَا نَخْبِزُهُ حَتَّى نَجُوعَ فَكَيْفَ بِالْمُؤْمِنِينَ يَوْمَئِذٍ؟ قَالَ: «يُجْزِئُهُمْ مَا يُجْزِئُ أَهْلَ السماءِ من التسبيحِ والتقديسِ» . رَوَاهُ أَحْمد",
      "english": {
        "narrator": "Asma' daughter of Yazid said:",
        "text": "When God's messenger was in my house, he mentioned the dajjal saying, \n\"Before he comes there will be three years, one in which the heaven will withhold a third of its rain and the earth a third of its vegetation, the second in which the heaven will withhold two-thirds of its rain and the earth two-thirds of its vegetation, and the third in which the heaven will withhold all its rain and the earth all its vegetation, and every animal with hoof or fang will perish. One of the severest of his afflictions will be his coming to a nomadic Arab and saying, `Tell me, if I bring your camels to life for you, will you not know that I am your Lord?' and he will reply, `Certainly. He will then make the devils appear to him like his camels with the finest udders and the highest humps. He will come to a man whose brother and father have died and say, `Tell me, if I bring your father and your brother to life for you, will you not know that I am your Lord?' and he will reply, `Certainly.' He will then make the devils appear to him like his father and his brother.\" She said that God's messenger then went out to relieve himself and when he found on his return that the people were greatly upset over what he had told them, he put his hands on the sides of the door and said, \"What is the matter, Asma'?\" When she replied that their hearts were perturbed over them; mention of the dajjal, he said, \"If he comes forth when I am alive, I shall dispute with him, otherwise my Lord will take my place on behalf of every believer.\" She said, \"Messenger of God, I swear by God that when we knead our dough, we are hungry before we make it into bread. Now how will believers fare at that time?\" He replied, \"The glorifying of God and the declaration of His holiness which are enough for the angels will be enough for them.\"\n\n ...Transmitted it. The source of the tradition is omitted in the text. It occurs in Ahmad b. Hanbal, Musnad, vol. 6, p. 455 f. A form of the tradition is also given in Tayalisi's Musnad (Haidarabad, 1321), p. 227."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5491",
        "url": "https://sunnah.com/mishkat:5491"
      },
      "grade": null
    },
    {
      "id": 113,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ قَالَ: مَا سَأَلَ أَحَدٌ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَن الدجالِ أكثرَ مِمَّا سَأَلْتُهُ وَإِنَّهُ قَالَ لِي: «مَا يَضُرُّكَ؟» قُلْتُ: إِنَّهُمْ يَقُولُونَ: إِنَّ مَعَهُ جَبَلَ خُبْزٍ وَنَهَرَ مَاءٍ. قَالَ: هُوَ أَهْوَنُ عَلَى اللَّهِ من ذَلِك \". مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "Al-Mughira b. Shu'ba said:",
        "text": "No one asked God's messenger more about the dajjal than I did, and he assured me he would do me no harm. When I told him people were saying he would have with him a mountain of bread and a river of water, he replied that he was too insignificant in God's sight for that.\n*Mirqat, 5:213, says that this means either that he is too despicable to be able really to produce such things, or that such seeming marvels could cot mislead believers. Another explanation is that such things are allowed only because believers will have their faith increased and unbelievers, hypocrites and such like will provide more evidence of their unbelief.\n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5492",
        "url": "https://sunnah.com/mishkat:5492"
      },
      "grade": "مُتَّفق عَلَيْهِ (الألباني)"
    },
    {
      "id": 114,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَخْرُجُ الدَّجَّالُ عَلَى حِمَارٍ أَقْمَرَ مَا بَيْنَ أُذُنَيْهِ سَبْعُونَ بَاعًا» . رَوَاهُ الْبَيْهَقِيُّ فِي «كِتَابِ الْبَعْثِ وَالنُّشُورِ»",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported the Prophet as saying, \"The dajjal will come forth on a white ass with a space seventy times as wide as one can stretch between its ears.\" \n\nBaihaqi transmitted it in Kitab al-ba`th wan nushur"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5493",
        "url": "https://sunnah.com/mishkat:5493"
      },
      "grade": null
    },
    {
      "id": 115,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ أَنَّ عُمَرَ بن الْخطاب انْطَلَقَ مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي رَهْطٍ مِنْ أَصْحَابِهِ قِبَلَ ابْنِ الصياد حَتَّى وجدوهُ يلعبُ مَعَ الصّبيانِ فِي أُطُمِ بَنِي مَغَالَةَ وَقَدْ قَارَبَ ابْنُ صَيَّادٍ يَوْمَئِذٍ الْحُلُمَ فَلَمْ يَشْعُرْ حَتَّى ضَرَبَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ظَهْرَهُ بِيَدِهِ ثمَّ قَالَ: «أتشهدُ أَنِّي رسولُ الله؟» فَقَالَ: أَشْهَدُ أَنَّكَ رَسُولُ الْأُمِّيِّينَ. ثُمَّ قَالَ ابْنُ صَيَّادٍ: أَتَشْهَدُ أَنِّي رَسُولُ اللَّهِ؟ فَرَصَّهُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثُمَّ قَالَ: «آمَنت بِاللَّه وبرسلِه» ثمَّ قَالَ لِابْنِ صيَّاد: «مَاذَا تَرَى؟» قَالَ: يَأْتِينِي صَادِقٌ وَكَاذِبٌ. قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «خُلِّطَ عَلَيْكَ الْأَمْرُ» . قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنِّي خَبَّأْتُ لَكَ خَبِيئًا» وَخَبَّأَ لَه: (يومَ تَأتي السَّماءُ بدُخانٍ مُبينٍ)\nفَقَالَ: هُوَ الدُّخُّ. فَقَالَ: «اخْسَأْ فَلَنْ تَعْدُوَ قَدْرَكَ» . قَالَ عُمَرُ: يَا رَسُولَ اللَّهِ أَتَأْذَنُ لي فِي أَنْ أَضْرِبَ عُنُقَهُ؟ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنْ يَكُنْ هُوَ لَا تُسَلَّطْ عَلَيْهِ وَإِنْ لَمْ يَكُنْ هُوَ فَلَا خير لَك فِي قَتْلِهِ» . قَالَ ابْنُ عُمَرَ: انْطَلَقَ بَعْدَ ذَلِكَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بْنُ كَعْبٍ الْأَنْصَارِيُّ يَؤُمَّانِ النَّخْلَ الَّتِي فِيهَا ابْنُ صَيَّادٍ فَطَفِقَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَّقِي بِجُذُوعِ النَّخْلِ وَهُوَ يَخْتِلُ أنْ يسمعَ مِنِ ابْنِ صَيَّادٍ شَيْئًا قَبْلَ أَنْ يَرَاهُ وَابْنُ صَيَّادٍ مُضْطَجِعٌ عَلَى فِرَاشِهِ فِي قَطِيفَةٍ لَهُ فِيهَا زَمْزَمَةٌ فَرَأَتْ أُمُّ ابْنِ صَيَّادٍ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ يَتَّقِي بِجُذُوعِ النَّخْلِ. فَقَالَتْ: أَيْ صَافُ - وَهُوَ اسْمُهُ - هَذَا مُحَمَّدٌ. فَتَنَاهَى ابْنُ صَيَّادٍ. قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَوْ تَرَكَتْهُ بَيَّنَ» . قَالَ عَبْدُ اللَّهِ بْنُ عُمَرَ: قَامَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي النَّاسَ فَأَثْنَى عَلَى اللَّهِ بِمَا هُوَ أَهْلُهُ ثُمَّ ذَكَرَ الدَّجَّالَ فَقَالَ: «إِنِّي أُنْذِرُكُمُوهُ وَمَا مِنْ نَبِيٍّ إِلَّا وَقَدْ أَنْذَرَ قَوْمَهُ لَقَدْ أَنْذَرَ نُوحٌ قَوْمَهُ وَلَكِنِّي سَأَقُولُ لَكُمْ فِيهِ قَوْلًا لَمْ يَقُلْهُ نَبِيٌّ لِقَوْمِهِ تَعْلَمُونَ أَنَّهُ أَعْوَرُ وَأَنَّ اللَّهَ لَيْسَ بِأَعْوَرَ» . مُتَّفَقٌ عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "`Abdallah b. `Umar told that `Umar b. al-Khattab went with God's messenger and some of his companions to Ibn Sayyad and found him playing with the boys in the fortress of the B. Maghala, Ibn Sayyid at that time being near the age of puberty. Before he was aware God's messenger gave him a clap on the back and said, \"Do you testify that I am God's messenger?\" He looked at him and said, \"I testify that you are the messenger of the Gentiles,\" after which Ibn Sayyad said, \"Do you testify that I am God's messenger?\" The Prophet squeezed him and said, \"I believe in God and His messengers.\" He then asked Ibn Sayyad what visions he had, and when he replied, \"One who speaks the truth and one who lies comes to me,\" God's messenger said, \"You are confused.\" He then said, \"I have concealed something in my mind which I would like you to tell me\" (referring to \"the day when the sky will bring forth smoke (dukhan) clearly visible\"). On his replying, \"It is smoke (dukhkh),\" he said, \n\"Away with you! You cannot get farther than your rank.\" you will not be given power over him, and if he is not, you will not do well in killing him.\" Ibn `Umar told that sometime afterwards God's messenger and Ubayy b. Ka'b went towards the palm trees where Ibn Sayyid was, and God's messenger hid behind the palm trunks seeking stealthily to hear something from Ibn Sayyid before he could see him. Ibn Sayyid was lying on his bed in a wrapper from which a murmur issued, and when his mother saw the Prophet hiding behind the palm trunks she said, \"Saf '(that being his name), here is Muhammad,\" whereupon Ibn Sayyad stopped the murmuring, and God's messenger said, \"If you had left him alone, he would have made things clear.\" `Abdallah b. `Umar told that God's messenger stood up among the people, and when he had extolled God - in a fitting manner he mentioned the dajjal and said, \"I warn you of him, and there is no prophet who has not warned his people. Noah warned his people, but I shall tell you something about him which no prophet has told his people. You must know that he is one-eyed, whereas God is not one-eyed.\"\n1. Quran, 44:10. \n2. The idea is that Ibn Sayyid was being tested to see whether he had any supernatural knowledge of what the Prophet had in mind. His use of a different form of the word for smoke put him on the level of a kahin with a defective source of information. \n3. i.e., the dajjal. \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5494",
        "url": "https://sunnah.com/mishkat:5494"
      },
      "grade": "مُتَّفق عَلَيْهِ (الألباني)"
    },
    {
      "id": 116,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: لَقِيَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبُو بَكْرٍ وَعُمَرُ - يَعْنِي ابْنَ صَيَّادٍ - فِي بَعْضِ طُرُقِ الْمَدِينَةِ فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَتَشْهَدُ أَنِّي رَسُولُ اللَّهِ؟» فَقَالَ هُوَ: أَتَشْهَدُ أَنِّي رَسُولَ اللَّهِ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «آمَنْتُ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ مَاذَا تَرَى؟» قَالَ: أَرَى عَرْشًا عَلَى الْمَاءُ. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَرَى عَرْشَ إِبْلِيسَ عَلَى الْبَحْرِ وَمَا تَرَى؟» قَالَ: أَرَى صَادِقَيْنِ وَكَاذِبًا أَوْ كَاذِبَيْنِ وَصَادِقًا. فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لُبِسَ عَلَيْهِ فَدَعُوهُ» . رَوَاهُ مُسْلِمٌ",
      "english": {
        "narrator": "",
        "text": "Abu Sa'id al-Khudri told that God's messenger, Abu Bakr and `Umar met him, i.e., Ibn Sayyad, on one of the roads of Medina and God's messenger said to him, \"Do you testify that I am God's messenger?\" to which he retorted, \"Do you testify that I am God's messenger?\" To this God's messenger replied, \"I believe in God, His angels, His books, and His messengers. What visions do you have?\" He said, \"I see a throne on water.\" God's messenger told him that what he was seeing was the throne of Iblis on the sea, and asked him what else he saw. On his replying, \"I see two who tell the truth and one who lies, or two who lie and one who tells the truth,\" God's messenger said, \"He is confused, so leave him alone.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5495",
        "url": "https://sunnah.com/mishkat:5495"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 117,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْهُ أَنَّ ابْنَ صَيَّادٍ سَأَلَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ تُرْبَةِ الْجَنَّةِ. فَقَالَ: «در مَكَّة يبضاء ومسك خَالص» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "He told that Ibn Sayyad asked the Prophet about the soil of paradise and that he replied it was a white, sifted flour and pure musk. \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5496",
        "url": "https://sunnah.com/mishkat:5496"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 118,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ نَافِعٍ قَالَ: لَقِيَ ابْنُ عُمَرَ ابْنَ صَيَّادٍ فِي بَعْضِ طُرُقِ الْمَدِينَةِ فَقَالَ لَهُ قَوْلًا أَغْضَبَهُ فَانْتَفَخَ حَتَّى مَلَأَ السِّكَّةَ. فَدَخَلَ ابْنُ عُمَرَ عَلَى حَفْصَةَ وَقَدْ بَلَغَهَا فَقَالَتْ لَهُ: رَحِمَكَ اللَّهُ مَا أَرَدْتَ مِنِ ابْنِ صياد؟ أما علمت أَن رَسُول اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّمَا يَخْرُجُ مِنْ غضبةٍ يغضبها» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Nafi told that when Ibn 'Umar once met Ibn Sayyad on one of. the roads of Medina he said something to him which angered him and he swelled up till he filled the street. Ibn `Umar went in to visit Hafsa who had heard of the incident, and she said, \"God have mercy on you! What did you want with Ibn Sayyad? Do you not know that God s messenger said it would just be because of his being seized by a fit of anger that he would come forth?\" \n*i.e., the Dajjal.\n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5497",
        "url": "https://sunnah.com/mishkat:5497"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 119,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: صَحِبْتُ ابْنَ صياد إِلَى مَكَّة فَقَالَ: مَا لَقِيتُ مِنَ النَّاسِ؟ يَزْعُمُونَ أَنِّي الدَّجَّالُ أَلَسْتَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «إِنَّهُ لَا يُولَدُ لَهُ» . وَقَدْ وُلِدَ لِي أَلَيْسَ قَدْ قَالَ: «هُوَ كَافِرٌ» . وَأَنا مُسلم أَو لَيْسَ قَدْ قَالَ: «لَا يَدْخُلُ الْمَدِينَةَ وَلَا مَكَّةَ» ؟ وَقَدْ أَقْبَلْتُ مِنَ الْمَدِينَةِ وَأَنَا أُرِيدُ مَكَّةَ. ثُمَّ قَالَ لِي فِي آخِرِ قَوْلِهِ: أَمَا وَاللَّهِ إِنِّي لَأَعْلَمُ مَوْلِدَهُ وَمَكَانَهُ وَأَيْنَ هُوَ وَأَعْرِفُ أَبَاهُ وَأُمَّهُ قَالَ: فَلَبَسَنِي قَالَ: قُلْتُ لَهُ: تَبًّا لَكَ سَائِرَ الْيَوْمِ. قَالَ: وَقِيلَ لَهُ: أَيَسُرُّكَ أَنَّكَ ذَاكَ الرَّجُلُ؟ قَالَ: فَقَالَ: لَوْ عُرِضَ عَلَيَّ مَا كَرِهْتُ. رَوَاهُ مُسْلِمٌ",
      "english": {
        "narrator": "Aba Said al-Khudri said:",
        "text": "I accompanied Ibn Sayyad to Mecca and he exclaimed, \"What I have encountered from people who assert that I am the dajjal! Have you not heard God's messenger say he will have no children? But I have children. Has he not said that he will be an infidel? But I am a Muslim. Has he not said that he will enter neither Medina nor Mecca? But I have come from Medina and am on my way to Mecca.\" One of the last things he said to me was, \"I swear by God that I know when and where he was born and where he is just now, and I know his father and his mother.\" He made me feel doubtful, so I said, \"Confound you for the rest of the day!\" He told that when someone asked him if he would like to be that man he replied, \"If it were offered to me I would not object.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5498",
        "url": "https://sunnah.com/mishkat:5498"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 120,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنِ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: لَقِيتُهُ وَقَدْ نَفَرَتْ عَيْنُهُ فَقُلْتُ: مَتَى فَعَلَتْ عَيْنُكَ مَا أَرَى؟ قَالَ: لَا أَدْرِي. قُلْتُ: لَا تَدْرِي وَهِيَ فِي رَأْسِكَ؟ قَالَ: إِنْ شَاءَ اللَّهُ خَلَقَهَا فِي عَصَاكَ. قَالَ: فَنَخَرَ كأشد نخير حمَار سَمِعت. رَوَاهُ مُسلم",
      "english": {
        "narrator": "Ibn `Umar said:",
        "text": "I met him when his eye was inflamed and asked him when his eye had become infected with the trouble I noticed. On his replying that he did not know I said, \"You do not know, and yet it is in your head?\" He replied, \"If God will He will create it when you are unaware.\" He then snorted as loudly as I have ever heard an ass snort. \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5499",
        "url": "https://sunnah.com/mishkat:5499"
      },
      "grade": "صَحِيحٌ (الألباني)"
    },
    {
      "id": 121,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ قَالَ: رَأَيْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَحْلِفُ بِاللَّهِ أَنَّ ابْنَ الصَّيَّادِ الدَّجَّالُ. قُلْتُ: تَحْلِفُ بِاللَّهِ؟ قَالَ: إِنِّي سَمِعْتُ عُمَرَ يَحْلِفُ عَلَى ذَلِكَ عِنْدَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَلَمْ يُنْكِرْهُ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. مُتَّفَقٌ عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Muhammad b. al-Munkadir told that he saw Jabir b. `Abdallah swearing by God that Ibn as-Sayyad was the dajjal, and when he expressed surprise that he should, swear by God, he replied that he had heard `Umar swearing to that in the Prophet's presence without the Prophet making any objection to it. \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5500",
        "url": "https://sunnah.com/mishkat:5500"
      },
      "grade": "مُتَّفق عَلَيْهِ (الألباني)"
    },
    {
      "id": 122,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "عَنْ نَافِعٍ قَالَ: كَانَ ابْنُ عُمَرَ يَقُولُ: وَاللَّهِ مَا أَشُكُّ أَنَّ الْمَسِيحَ الدَّجَّالَ ابْنُ صيَّادٍ. رَوَاهُ أَبُو دَاوُدَ وَالْبَيْهَقِيُّ فِي «كِتَابِ الْبَعْثِ والنشور»",
      "english": {
        "narrator": "",
        "text": "Nafi' told that Ibn `Umar used to say, \"I swear by God that I do not doubt the antichrist is Ibn Sayyad.\" \n\nAbu Dawud and Baihaqi, in Kitab al-ba'th wan nushur, transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5501",
        "url": "https://sunnah.com/mishkat:5501"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 123,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ جَابِرٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَدْ فَقَدْنَا ابْنَ صَيَّادٍ يَوْمَ الْحَرَّةِ. رَوَاهُ أَبُو دَاوُد",
      "english": {
        "narrator": "",
        "text": "Jabir said they saw the last of Ibn Sayyad at the battle of the, harra. \n\nAbu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5502",
        "url": "https://sunnah.com/mishkat:5502"
      },
      "grade": "صَحِيحٌ (الألباني)"
    },
    {
      "id": 124,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي بَكْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «يمْكث أَبُو الدَّجَّالِ ثَلَاثِينَ عَامًا لَا يُولَدُ لَهُمَا وَلَدٌ ثُمَّ يُولَدُ لَهُمَا غُلَامٌ أَعْوَرُ أَضْرَسُ وَأَقَلُّهُ مَنْفَعَةً تَنَامُ عَيْنَاهُ وَلَا يَنَامُ قَلْبُهُ» . ثُمَّ نَعَتَ لَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَبَوَيْهِ فَقَالَ: «أَبُوهُ طُوَالٌ ضَرْبُ اللَّحْمِ كَأَنَّ أَنْفَهُ مِنْقَارٌ وَأُمُّهُ امْرَأَةٌ فِرْضَاخِيَّةٌ طَوِيلَةُ الْيَدَيْنِ» . فَقَالَ أَبُو بَكْرَةَ: فَسَمِعْنَا بِمَوْلُودٍ فِي الْيَهُود. فَذَهَبْتُ أَنَا وَالزُّبَيْرُ بْنُ الْعَوَّامِ حَتَّى دَخَلْنَا عَلَى أَبَوَيْهِ فَإِذَا نَعْتُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهِمَا فَقُلْنَا هَلْ لَكُمَا وَلَدٌ؟ فَقَالَا: مَكَثْنَا ثَلَاثِينَ عَامًا لَا يُولَدُ لَنَا وَلَدٌ ثُمَّ وُلِدَ لَنَا غُلَامٌ أَعْوَرُ أَضْرَسُ وَأَقَلُّهُ مَنْفَعَةً تَنَامُ عَيْنَاهُ وَلَا يَنَامُ قَلْبُهُ قَالَ فَخَرَجْنَا مِنْ عِنْدِهِمَا فَإِذَا هُوَ مجندل فِي الشَّمْسِ فِي قَطِيفَةٍ وَلَهُ هَمْهَمَةٌ فَكَشَفَ عَن رَأسه فَقَالَ: مَا قلتما: وَهَلْ سَمِعْتَ مَا قُلْنَا؟ قَالَ: نَعَمْ تَنَامُ عَيْنَايَ وَلَا ينَام قلبِي\nرَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "Abu Bakra reported God's messenger as saying, \"The parents of the dajjal will wait thirty years, without having any children born to them, then a boy who will be one-eyed and have a long molar tooth and be most useless will be born to them. His eyes will sleep but his heart will not.\" God's messenger then described his parents to them saying, \"His father will be very tall and spare and will have a nose like a beak, and his mother will be a huge woman with long arms.\" Abu Bakra said they heard of a child being born among the Jews in Medina, so az-Zubair b. al-`Awwam and he went to visit the parents and saw that they were as God's messenger had described. They asked them if they had a child and they replied that they had waited thirty years without having a child born to them but now a boy had been born to them who was one-eyed, had a long molar tooth and was most useless, whose eyes slept but whose heart did not. When they went out, they found him lying in the sun in a wrapper mumbling. He uncovered his head and asked what they had said, and when they asked if he had heard what they said he replied that he had, for his eyes slept but his heart did not. \n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5503",
        "url": "https://sunnah.com/mishkat:5503"
      },
      "grade": null
    },
    {
      "id": 125,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ جَابِرٍ أَنَّ امْرَأَةً مِنَ الْيَهُودِ بِالْمَدِينَةِ وَلَدَتْ غُلَامًا مَمْسُوحَةٌ عَيْنُهُ طَالِعَةٌ نَابُهُ فَأَشْفَقَ رَسُول الله صلى الله عَلَيْهِ وَسلم إِن يَكُونَ الدَّجَّالَ فَوَجَدَهُ تَحْتَ قَطِيفَةٍ يُهَمْهِمُ. فَآذَنَتْهُ أُمُّهُ فَقَالَتْ: يَا عَبْدَ اللَّهِ هَذَا أَبُو الْقَاسِمِ فَخَرَجَ مِنَ الْقَطِيفَةِ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: مَا لَهَا قَاتَلَهَا اللَّهُ؟ لَوْ تَرَكَتْهُ لَبَيَّنَ \" فَذَكَرَ مِثْلَ مَعْنَى حَدِيثِ ابْنِ عُمَرَ فَقَالَ عُمَرُ بْنُ الْخَطَّابِ ائْذَنْ لِي يَا رَسُولَ اللَّهِ فَأَقْتُلَهُ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِن يكن هُوَ فَلَيْسَتْ صَاحِبَهُ إِنَّمَا صَاحِبُهُ عِيسَى بْنُ مَرْيَمَ وَإِلَّا يكن هُوَ فَلَيْسَ لَك أتقتل رَجُلًا مِنْ أَهْلِ الْعَهْدِ» . فَلَمْ يَزَلْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مُشْفِقًا أَنَّهُ هُوَ الدَّجَّال. رَوَاهُ فِي شرح السّنة",
      "english": {
        "narrator": "",
        "text": "Jabir told that when a Jewess in Medina gave birth to a boy with an eye obliterated and a long eye-tooth God's messenger was afraid, he might be the dajjal. He found him under a wrapper mumbling, and when his mother informed him saying, \"`Abdallah, this is Abul Qasim,\" he came out from the wrapper. God's messenger then said, \"What is the matter with her! God curse her! If she had left him alone, he would have made things clear.\" He then mentioned something similar in effect to Ibn `Umar's tradition. `Umar b. al-Khattab then said, \"Let me kill him, messenger of God' but he replied, \"If he is the one you are not the person to deal with him, for the person to deal with him is only Jesus, son of Mary; and if he is not the one, you have no right to kill a man who belongs to a people with whom a covenant has been made.\" But God's messenger continued to fear that he might be the, dajjal. \n*This may be a proper name, or it perhaps should be translated as \"servant of God\". It has already been said that his name was Saf.\n\nIt is transmitted in Sharh as-sunna."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5504",
        "url": "https://sunnah.com/mishkat:5504"
      },
      "grade": null
    },
    {
      "id": 126,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَالَّذِي نَفْسِي بِيَدِهِ ليوشكَنَّ أَن ينزلَ فِيكُم ابنُ مَرْيَم حكَمَاً عَدْلًا فَيَكْسِرُ الصَّلِيبَ وَيَقْتُلُ الْخِنْزِيرَ وَيَضَعُ الْجِزْيَةَ وَيَفِيضُ الْمَالُ حَتَّى لَا يَقْبَلَهُ أَحَدٌ حَتَّى تكون السَّجْدَة الْوَاحِدَة خيرامن الدُّنْيَا وَمَا فِيهَا» . ثُمَّ يَقُولُ أَبُو هُرَيْرَةَ: فاقرؤا إِن شئْتم  الْآيَة. مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "Abu Huraira reported God's messenger as saying, \"By Him in whose hand my soul is, the son of Mary will soon descend among you as a just judge. He will break crosses, kill swine, and abolish the jizya, and wealth will pour forth to such an extent that no one will accept it, and one sajda will be better than the world and what it contains.\" Abu Huraira used to say:",
        "text": "Recite if you wish, \"Not one of the people of the Book will fail to believe in him before his death...\n*Quran; 4:159\n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5505",
        "url": "https://sunnah.com/mishkat:5505"
      },
      "grade": null
    },
    {
      "id": 127,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعنهُ قا ل: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَاللَّهِ لَيَنْزِلَنَّ ابْنُ مَرْيَمَ حَكَمًا عَادِلًا فَلَيَكْسِرَنَّ الصَّلِيبَ وَلَيَقْتُلَنَّ الْخِنْزِيرَ وَلَيَضَعَنَّ الْجِزْيَةَ وَلَيَتْرُكَنَّ الْقِلَاصَ فَلَا يسْعَى عَلَيْهَا ولتذهبن الشحناء وَالتَّحَاسُدُ وَلَيَدْعُوَنَّ إِلَى الْمَالِ فَلَا يَقْبَلُهُ أَحَدٌ» . رَوَاهُ مُسْلِمٌ. وَفِي رِوَايَةٍ لَهُمَا قَالَ: «كَيْفَ أَنْتُمْ إِذَا نَزَلَ ابْنُ مَرْيَمَ فِيكُمْ وَإِمَامُكُمْ مِنْكُم»",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"I swear by God that the son of Mary will descend as a just judge, and will break crosses, kill swine, abolish the jizya, and leave the young she-camels so that collectors of zakat will not be employed for them. Spite, mutual hatred, and jealousy of one another will certainly depart, and when he summons people to accept wealth not one will do so.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5506",
        "url": "https://sunnah.com/mishkat:5506"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 128,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَزَالُ طَائِفَةٌ مِنْ أُمَّتِي يُقَاتِلُونَ عَلَى الْحَقِّ ظَاهِرِينَ إِلَى يَوْمِ الْقِيَامَة» . قا ل: \n\" فَينزل عِيسَى بن مَرْيَمَ فَيَقُولُ أَمِيرُهُمْ: تَعَالَ صَلِّ لَنَا فَيَقُولُ: لَا إِنَّ بَعْضَكُمْ عَلَى بَعْضٍ أُمَرَاءُ تَكْرِمَةَ الله هَذِه الْأمة \". رَوَاهُ مُسْلِمٌ",
      "english": {
        "narrator": "",
        "text": "In a version by Bukhari and Muslim he said, \"How will you do when the son of Mary descends and your imam is one of your number?\" Jabir reported God's messenger as saying, \"A section of my people will not cease to fight for the truth and prevail till the day of resurrection.\" He said that Jesus, son of Mary would then descend and their commander would invite him to come and lead them in prayer, but he would say, \"No, you have some put over others as an honour from God to this people.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5507",
        "url": "https://sunnah.com/mishkat:5507"
      },
      "grade": null
    },
    {
      "id": 129,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "عَن عبد الله بن عَمْرو قا ل: قا ل رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَنْزِلُ عِيسَى بن مَرْيَمَ إِلَى الْأَرْضِ فَيَتَزَوَّجُ وَيُولَدُ لَهُ وَيَمْكُثُ خَمْسًا وَأَرْبَعِينَ سَنَةً ثُمَّ يَمُوتُ فَيُدْفَنُ مَعِي فِي قَبْرِي فأقوم أَنا وَعِيسَى بن مَرْيَمَ فِي قَبْرٍ وَاحِدٍ بَيْنَ أَبَى بَكْرٍ وَعُمَرَ» . رَوَاهُ ابْنُ الْجَوْزِيِّ فِي كِتَابِ الْوَفَاءِ",
      "english": {
        "narrator": "",
        "text": "Abdallah b. `Amr reported God's messenger as saying, \"Jesus, son of Mary will descend to the earth, will marry, have children, and remain forty-five years, after which he will die and be buried along with me in my grave. Then Jesus, son of Mary and I shall arise from one grave between Abu Bakr and 'Umar.\" \n\nIbn al-jauzi transmitted it in Kitab al-wafa'"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5508",
        "url": "https://sunnah.com/mishkat:5508"
      },
      "grade": null
    },
    {
      "id": 130,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "عَن شعبةَ عَن قَتَادَة عَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «بُعِثْتُ أَنَا وَالسَّاعَةُ كَهَاتَيْنِ» . قَالَ شُعْبَةُ: وَسَمِعْتُ قَتَادَةَ يَقُولُ فِي قَصَصِهِ كفصل إِحْدَاهُمَا عَلَى الْأُخْرَى فَلَا أَدْرِي أَذَكَرَهُ عَنْ أنس أَو قَالَه قَتَادَة؟ مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Shu'ba, on Qatada's authority, said Anas reported God's messenger as saying, \"My commission and the coming of the last hour are like these two.\" Shu'ba added that he also heard Qatada say in his telling of the tradition, \"Like the superiority of one of them ovel the other,\" but did not know whether he mentioned it on the authority of Anas, or whether Qatada said it himself. \n*Mirqat, 5:223 f., explains this as the middle finger and the forefinger, referring to al-Mustaurid's tradition given below. The middle finger is only slightly longer.\n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5509",
        "url": "https://sunnah.com/mishkat:5509"
      },
      "grade": null
    },
    {
      "id": 131,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَن جَابر قا ل: سَمِعْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ قَبْلَ أَنْ يَمُوتَ بِشَهْرٍ: «تَسْأَلُونِي عَنِ السَّاعَةِ؟ وَإِنَّمَا عِلْمُهَا عِنْدَ اللَّهِ وَأُقْسِمُ بِاللَّهِ مَا عَلَى الْأَرْضِ مِنْ نَفْسٍ مَنْفُوسَةٍ يَأْتِي عَلَيْهَا مِائَةُ سَنَةٍ وَهِيَ حَيَّةٌ يَوْمَئِذٍ» . رَوَاهُ مُسْلِمٌ",
      "english": {
        "narrator": "",
        "text": "Jabir told that he heard the Prophet say a month before he died, \"You ask me about the last hour, but God alone has knowledge of it. I swear by God that no one already born who lives a hundred years will be alive that day.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5510",
        "url": "https://sunnah.com/mishkat:5510"
      },
      "grade": null
    },
    {
      "id": 132,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي سَعِيدٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَا يَأْتِي مِائَةُ سَنَةٍ وَعَلَى الْأَرْضِ نَفْسٌ مَنْفُوسَةٌ الْيَوْمَ» . رَوَاهُ مُسْلِمٌ",
      "english": {
        "narrator": "",
        "text": "Abu Sa'id reported the Prophet as saying, \"No one who has been born will be alive a hundred years hence.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5511",
        "url": "https://sunnah.com/mishkat:5511"
      },
      "grade": null
    },
    {
      "id": 133,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ عَائِشَةَ قَالَتْ: كَانَ رِجَالٌ مِنَ الْأَعْرَابِ يَأْتُونَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَسْأَلُونَهُ عَنِ السَّاعَةِ فَكَانَ يَنْظُرُ إِلَى أصغرِهم فَيَقُول: «إِنْ يَعِشْ هَذَا لَا يُدْرِكْهُ الْهَرَمُ حَتَّى تَقُومَ عَلَيْكُمْ سَاعَتُكُمْ» . مُتَّفَقٌ عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "`A'isha told that when nomadic Arabs came and asked the Prophet about the last hour, he would look at the youngest of them and say, \"If this one lives, he will not become decrepit before your hour comes to you.\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5512",
        "url": "https://sunnah.com/mishkat:5512"
      },
      "grade": null
    },
    {
      "id": 134,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "عَن الْمُسْتَوْرد بن شَدَّاد عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «بُعِثْتُ فِي نَفَسِ السَّاعَةِ فَسَبَقْتُهَا كَمَا سَبَقَتْ هذِه هذِه» وأشارَ بأصبعيهِ السبَّابةِ وَالْوُسْطَى. رَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "Al-Mustaurid b. Shaddad reported the Prophet as saying, \"I have been commissioned when the end of time is near and I have preceded it as this has preceded that,\" indicating his forefinger and his middle finger. \n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5513",
        "url": "https://sunnah.com/mishkat:5513"
      },
      "grade": null
    },
    {
      "id": 135,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنِّي لَأَرْجُو أَنْ لَا تَعْجِزَ أُمَّتِي عِنْدَ رَبِّهَا أَنْ يُؤَخِّرَهُمْ نِصْفَ يَوْمٍ» . قِيلَ لِسَعْدٍ: وَكَمْ نِصْفُ يَوْمٍ؟ قَالَ: خَمْسُمِائَةِ سَنَةٍ. رَوَاهُ أَبُو دَاوُدَ",
      "english": {
        "narrator": "",
        "text": "Sa'd b. Abu Waqqas reported the Prophet as saying, \"I hope my people will not fail to maintain their position in the sight of their Lord if He delays them for half a day.\" Sa`d was asked how long half a day was and said it was five hundred years. \n*Mirqat, 5:215, explains this as indicating that the last day would not occur within 500 years of the Prophet's time. He hoped his people would keep the faith during all that period.\n\nAbu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5514",
        "url": "https://sunnah.com/mishkat:5514"
      },
      "grade": null
    },
    {
      "id": 136,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "عَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَثَلُ هَذِهِ الدُّنْيَا مَثَلُ ثَوْبٍ شُقَّ مِنْ أَوَّلِهِ إِلَى آخِرِهِ فَبَقِيَ مُتَعَلِّقًا بِخَيْطٍ فِي آخِرِهِ فَيُوشِكُ ذَلِكَ الْخَيْطُ أَنْ يَنْقَطِعَ» . رَوَاهُ الْبَيْهَقِيُّ فِي «شُعَبِ الْإِيمَانِ»",
      "english": {
        "narrator": "",
        "text": "Anas reported God's messenger as saying, \"The world is like a garment torn from end to end and hanging by a thread at the end of it; and that thread will soon be cut off.\" \n\nBaihaqi transmitted it in Shu'ab al-iman."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5515",
        "url": "https://sunnah.com/mishkat:5515"
      },
      "grade": null
    },
    {
      "id": 137,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \" لَا تَقُومُ السَّاعَةُ حَتَّى لَا يُقَالَ فِي الْأَرْضِ: اللَّهُ اللَّهُ \". وَفِي رِوَايَةٍ: \" لَا تَقُومُ السَّاعَةُ عَلَى أَحَدٍ يَقُولُ: اللَّهُ الله \". رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Anas reported God's messenger as saying, \"The last hour will not come till the cry `God, God' is not uttered in the earth.\" In a version he said, \"The last hour will not come upon one who says, `God, God'.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5516",
        "url": "https://sunnah.com/mishkat:5516"
      },
      "grade": null
    },
    {
      "id": 138,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَقُومُ السَّاعَةُ إِلَّا عَلَى شِرَارِ الْخَلْقِ» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "`Abdallah b. Mas'ud reported God's messenger as saying, \"The last hour will come only when people are wicked.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5517",
        "url": "https://sunnah.com/mishkat:5517"
      },
      "grade": null
    },
    {
      "id": 139,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تَقُومُ السَّاعَةُ حَتَّى تَضْطَرِبَ أَلَيَاتُ نِسَاءِ دَوْسٍ حَوْلَ ذِي الْخَلَصَةِ» . وَذُو الْخَلَصَةِ: طَاغِيَةُ دَوْسٍ الَّتِي كَانُوا يَعْبُدُونَ فِي الْجَاهِلِيَّةِ. مُتَّفَقٌ عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported God's messenger as saying, \"The last hour will not come till the buttocks of the women of Daus waggle round Dhul Khalasa.\" Dhul Khalasa was the idol of Daus which they worshipped in the pre-Islamic period. \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5518",
        "url": "https://sunnah.com/mishkat:5518"
      },
      "grade": null
    },
    {
      "id": 140,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ عَائِشَةَ قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «لَا يَذْهَبُ اللَّيْلُ وَالنَّهَارُ حَتَّى يُعْبَدَ اللَّاتُ وَالْعُزَّى» . فَقُلْتُ: يَا رَسُولَ اللَّهِ إِنْ كُنْتُ لَأَظُنُّ حِينَ أَنْزَلَ اللَّهُ: (هُوَ الَّذِي أَرْسَلَ رَسُولَهُ بِالْهُدَى وَدِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ وَلَوْ كَرِهَ الْمُشْرِكُونَ)\nأَنَّ ذَلِكَ تَامًّا. قَالَ: «إِنَّهُ سَيَكُونُ مِنْ ذَلِكَ مَا شَاءَ اللَّهُ ثُمَّ يَبْعَثُ اللَّهُ رِيحًا طَيِّبَةً فَتُوُفِّيَ كُلُّ مَنْ كَانَ فِي قَلْبِهِ مِثْقَالُ حَبَّةٍ مِنْ خَرْدَلٍ مِنْ إِيمَانٍ فَيَبْقَى مَنْ لَا خَيْرَ فِيهِ فَيَرْجِعُونَ إِلَى دِين آبَائِهِم» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "`A'isha told that she heard God's messenger say, \"Night and day shall not pass away till al-Lat and al- `Uzza are worshipped.\" She told God's messenger she had thought that when God sent down, \"He it is who has sent His messenger with guidance and the true religion to make it prevail over all the religion, though the polytheists should be displeased,\" was at an end, to which he replied, \"What God wills regarding that will come to pass. God will then send a fragrant wind which will take the soul of everyone who has in his heart as much faith as a grain of mustard-seed, but those who have no good in them will remain and return to the religion of their ancestors.\"\n    Quran, 9:33\n    i.e., Idol worship \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5519",
        "url": "https://sunnah.com/mishkat:5519"
      },
      "grade": null
    },
    {
      "id": 141,
      "chapterId": 27,
      "bookId": 14,
      "arabic": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَخْرُجُ الدَّجَّالُ فَيَمْكُثُ أَرْبَعِينَ» لَا أَدْرِي أَرْبَعِينَ يَوْمًا أَوْ شَهْرًا أَوْ عَامًا «فَيَبْعَثُ اللَّهُ عِيسَى ابْنَ مَرْيَمَ كَأَنَّهُ عُرْوَةُ بْنُ مَسْعُودٍ فَيَطْلُبُهُ فَيُهْلِكُهُ ثُمَّ يَمْكُثُ فِي النَّاسِ سَبْعَ سِنِينَ لَيْسَ بَيْنَ اثْنَيْنِ عَدَاوَةٌ ثُمَّ يُرْسِلُ اللَّهُ رِيحًا بَارِدَةً مِنْ قِبَلِ الشَّامِ فَلَا يَبْقَى عَلَى وَجْهِ الْأَرْضِ أَحَدٌ فِي قَلْبِهِ مِثْقَالُ ذَرَّةٍ مِنْ خَيْرٍ أَوْ إِيمَانٍ إِلَّا قَبَضَتْهُ حَتَّى لَوْ أَنَّ أَحَدَكُمْ دَخَلَ فِي كَبِدِ جَبَلٍ لَدَخَلَتْهُ عَلَيْهِ حَتَّى تَقْبِضَهُ» قَالَ: \" فَيَبْقَى شِرَارُ النَّاسِ فِي خِفَّةِ الطَّيْرِ وَأَحْلَامِ السِّبَاعِ لَا يَعْرِفُونَ مَعْرُوفًا وَلَا يُنْكِرُونَ مُنْكَرًا فَيَتَمَثَّلُ لَهُمُ الشَّيْطَانُ فَيَقُولُ أَلَا تَسْتَجِيبُونَ؟ فَيَقُولُونَ: فَمَا تَأْمُرُنَا؟ فَيَأْمُرُهُمْ بِعِبَادَةِ الْأَوْثَانِ وَهُمْ فِي ذَلِكَ دَارٌّ رِزْقُهُمْ حَسَنٌ عَيْشُهُمْ ثُمَّ يُنْفَخُ فِي الصُّورِ فَلَا يَسْمَعُهُ أَحَدٌ إِلَّا أَصْغَى لِيتًا وَرَفَعَ لِيتًا \" قَالَ: \" وَأَوَّلُ مَنْ يَسْمَعُهُ رَجُلٌ يَلُوطُ حَوْضَ إِبِلِهِ فَيَصْعَقُ وَيَصْعَقُ النَّاسُ ثُمَّ يُرْسِلُ اللَّهُ مَطَرًا كَأَنَّهُ الطَّلُّ فَيَنْبُتُ مِنْهُ أَجْسَادُ النَّاسِ ثُمَّ يُنْفَخُ فِيهِ أُخْرَى فَإِذَا هُمْ قِيَامٌ يَنْظُرُونَ ثُمَّ يُقَالُ: يَا أَيُّهَا الناسُ هَلُمَّ إِلى ربِّكم وقفوهُم إِنَّهم مسؤولونَ. فَيُقَالُ: أَخْرِجُوا بَعْثَ النَّارِ. فَيُقَالُ: مِنْ كَمْ؟ كَمْ؟ فَيُقَالُ: مِنْ كُلِّ أَلْفٍ تِسْعَمِائَةٍ وَتِسْعَةً وَتِسْعِينَ \" قَالَ: «فَذَلِكَ يَوْمَ يَجْعَلُ الْوِلْدَانَ شِيبًا وَذَلِكَ يَوْمَ يُكْشَفُ عَنْ سَاقٍ» . رَوَاهُ مُسْلِمٌ",
      "english": {
        "narrator": "",
        "text": "`Abdallah b. `Amr reported God's messenger as saying, \"The dajjal will come forth and remain forty (`Abdallah explaining that he did not know whether he meant forty days, months, or years), then God will send Jesus son of Mary looking like `Urwa b. Mas'ud who will search for him and destroy him. He will remain among mankind for seven years, during which period no two people will be at enmity with one another. God will then send a cold wind from the direction of Syria, and no one who has in his heart as much as a grain of good (or faith) will remain on the earth without being taken, and even if one of you had entered the interior of a mountain it would come in where he was and take him. The wicked will remain as unstable as birds and with the intelligence of beasts of prey, \n1. They are like birds in being easily startled, showing lack of stability and inclination to wickedness; they have as little intelligence as wild beasts, showing anger and violence. \n2. Cf. Quran, 39:68. Here the imperfect of the verb is used instead of the perfect used in the Quran. Otherwise, the wording is the same. \n3. Cf. Quran, 73:17. \n4. Cf. Quran, 68:42. A figure of speech for great affliction.\n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5520",
        "url": "https://sunnah.com/mishkat:5520"
      },
      "grade": null
    }
  ],
  "chapter": {
    "id": 27,
    "bookId": 14,
    "arabic": "كتاب الفتن",
    "english": "Fitan"
  }
}