{
  "metadata": {
    "length": 207,
    "arabic": {
      "title": "مشكاة المصابيح",
      "author": "الإمام الكاتب التبريزي",
      "introduction": "كتاب أحوال القيامة وبدء الخلق"
    },
    "english": {
      "title": "Mishkat al-Masabih",
      "author": "Al-Khatib Al-Tabrizi",
      "introduction": "Events of the Day of Resurrection and the Beginning of Creation"
    }
  },
  "hadiths": [
    {
      "id": 1,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا بَيْنَ النَّفْخَتَيْنِ أَرْبَعُونَ» قَالُوا: يَا أَبَا هُرَيْرَةَ أَرْبَعُونَ يَوْمًا؟ قَالَ: أَبَيْتُ. قَالُوا: أَرْبَعُونَ شَهْرًا؟ قَالَ: أَبَيْتُ. قَالُوا: أَرْبَعُونَ سَنَةً؟ قَالَ: أَبَيْتُ. «ثُمَّ يَنْزِلُ اللَّهُ مِنَ السَّمَاءِ مَاءٌ فَيَنْبُتُونَ كَمَا يَنْبُتُ الْبَقْلُ» قَالَ: «وَلَيْسَ مِنَ الْإِنْسَانِ شَيْءٌ لَا يَبْلَى إِلَّا عَظْمًا وَاحِدًا وَهُوَ عَجْبُ الذَّنَبِ وَمِنْهُ يُرَكَّبُ الْخَلْقُ يَوْمَ الْقِيَامَةِ» . مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةٍ لِمُسْلِمٍ قَالَ: «كُلُّ ابْنِ آدَمَ يَأْكُلُهُ التُّرَابُ إِلَّا عَجْبَ الذَّنَبِ مِنْهُ خُلِقَ وَفِيهِ يركب»",
      "english": {
        "narrator": "",
        "text": "Aba Huraira reported God's messenger as saying, \"Between the two blasts there are forty (and when Abu Huraira was asked if the forty referred to days he refused to say; when asked if it referred to forty months he refused to say; and when asked if it referred to forty years he refused to say. God will then send down water from the sky and they will sprout like vegetables. The only thing in a man which does not decay is one bone, the tail-bone, from which the whole frame will be reconstituted on the day of resurrection.\" \n1. The Trumpet; as-sur. Cf. Quran, 6:73; 18:93; 20:102, etc. \n2. Mirqat, 5:229, explains this as meaning that he was unwilling to reply because he did not know.\n\n(Bukhari and Muslim.)\n\nIn a version by Muslim he said, \"Every son of Adam will be devoured by the earth with the exception of the tail-bone from which he was created and from which he will be reconstituted.\" \n\nMuslim."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5521",
        "url": "https://sunnah.com/mishkat:5521"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 2,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" يَقْبِضُ اللَّهُ الْأَرْضَ يَوْمَ الْقِيَامَةِ وَيَطْوِي السَّمَاءَ بِيَمِينِهِ ثُمَّ يَقُولُ: أَنَا الْمَلِكُ أَيْنَ مُلُوكُ الْأَرْضِ؟ \". مُتَّفَقٌ عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying that on the day of resurrection God will seize the earth and fold the sky in His right hand, then say, \"I am the King. Where are the kings of the earth?\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5522",
        "url": "https://sunnah.com/mishkat:5522"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 3,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن عبد الله بن عَمْرو قَالَ: قا ل رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" يَطْوِي اللَّهُ السَّمَاوَاتِ يَوْمَ الْقِيَامَةِ ثُمَّ يَأْخُذُهُنَّ بِيَدِهِ الْيُمْنَى ثُمَّ يَقُولُ: أَنَا الْمَلِكُ أَيْنَ الْجَبَّارُونَ؟ أَيْنَ الْمُتَكَبِّرُونَ؟ ثُمَّ يَطْوِي الْأَرَضِينَ بِشِمَالِهِ - وَفِي رِوَايَة: يَأْخُذُهُنَّ بِيَدِهِ الْأُخْرَى - ثُمَّ يَقُولُ: أَنَا الْمَلِكُ أينَ الجبَّارونَ أينَ المتكبِّرونَ؟ \". رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "'Abdallah b. `Umar reported God's messenger as saying that God will fold the heavens on the day of resurrection, then seizing them in His right hand He will say, \"I am the King. Where are the mighty men? Where are the proud men?\" He will then fold the earths in His left hand. A version states that He will take them in His other hand and then say, \"I am the King. Where are the mighty men? Where are the proud men?\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5523",
        "url": "https://sunnah.com/mishkat:5523"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 4,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: جَاءَ حَبْرٌ مِنَ الْيَهُودِ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: يَا مُحَمَّدُ إِنَّ اللَّهَ يُمْسِكُ السَّمَاوَاتِ يَوْمَ الْقِيَامَةِ عَلَى أُصْبُعٍ وَالْأَرَضِينَ عَلَى أُصْبُعٍ وَالْجِبَالَ وَالشَّجَرَ عَلَى أُصْبُعٍ وَالْمَاءَ وَالثَّرَى عَلَى أُصْبُعٍ وَسَائِرَ الْخَلْقِ علىأصبع ثُمَّ يَهُزُّهُنَّ فَيَقُولُ: أَنَا الْمَلِكُ أَنَا اللَّهُ. فَضَحِكَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَعَجُّبًا مِمَّا قَالَ الْحَبْرُ تَصْدِيقًا لَهُ. ثُمَّ قَرَأَ: (وَمَا قَدَرُوا اللَّهَ حَقَّ قَدْرِهِ وَالْأَرْضُ جَمِيعًا قَبْضَتُهُ يَوْمَ الْقِيَامَةِ وَالسَّماوَاتُ مَطْوِيَّاتٌ بِيَمِينِهِ سُبْحَانَهُ وَتَعَالَى عَمَّا يشركُونَ)\nمُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "`Abdallah b. Mas'ud told that a Jewish doctor came to the Prophet and said, \"On the day of resurrection, Muhammad, God will hold the heavens on a finger, the earths on a finger, the mountains and trees on a finger, the water and soil on a finger, and the rest of creation on a finger. He will then shake them and say, `I am the King, I am God.'\" Laughing on account of being pleased at what the doctor had said and as an acknowledgment that he had spoken the truth- God's messenger recited, \"They have not measured God truly. The whole earth will be His handful on the day of resurrection and the heavens will be folded in His right hand. Glory be to Him! He is exalted above what they associate with Him.\" \n*Quran; 39:67\n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5524",
        "url": "https://sunnah.com/mishkat:5524"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 5,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ عَائِشَةَ قَالَتْ: سَأَلَتْ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ قَوْلِهِ: (يَوْمَ تُبَدَّلُ الأرضُ غيرَ الأَرْض والسَّماواتُ)\nفَأَيْنَ يَكُونُ النَّاسُ يَوْمَئِذٍ؟ قَالَ: «عَلَى الصِّرَاطِ» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "`A'isha told that she asked God's messenger about the words of Him who is exalted, \"On the day when the earth will be changed to a different earth, and also the heavens, wondering where mankind would be on that day. He replied that they would be on the Path. \n*Quran; 14:48\n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5525",
        "url": "https://sunnah.com/mishkat:5525"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 6,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الشَّمْسُ وَالْقَمَرُ مُكَوَّرَانِ يَوْم الْقِيَامَة» . رَوَاهُ البُخَارِيّ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported God's messenger as saying, \"The sun and the moon will be folded up on the day of resurrection.\" \n\nBukhari transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5526",
        "url": "https://sunnah.com/mishkat:5526"
      },
      "grade": "صَحِيحٌ (الألباني)"
    },
    {
      "id": 7,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كَيْفَ أَنْعَمُ وَصَاحِبُ الصُّورِ قَدِ الْتَقَمَهُ وَأَصْغَى سَمْعَهُ وَحَنَى جَبْهَتَهُ يَنْتَظِرُ مَتَى يُؤْمَرُ بِالنَّفْخِ» . فَقَالُوا: يَا رَسُولَ اللَّهِ وَمَا تَأْمُرُنَا؟ قَالَ: \n\" قُولُوا: حَسْبُنَا اللَّهُ ونِعمَ الْوَكِيل \". رَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "Abu Sa'id al-Khudri reported God's messenger as saying. \"How can I be at ease when the one who blows the trumpet has put it to his mouth, inclined his ears and bent his forehead, waiting to see when he will be ordered to blow it?\" God's messenger was asked what command he had to give them and told them to say, \"God is sufficient for us and an excellent guardian is He.\" *\n*Quran; 3:173\n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5527",
        "url": "https://sunnah.com/mishkat:5527"
      },
      "grade": "لم تتمّ دراسته (الألباني)"
    },
    {
      "id": 8,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الصُّورُ قَرْنٌ يُنْفَخُ فِيهِ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالدَّارِمِيُّ",
      "english": {
        "narrator": "",
        "text": "`Abdallah b. `Amr reported the Prophet as saying, \"The trumpet is a horn which will be blown.\" \n\nTirmidhi, Abu Dawud and Darimi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5528",
        "url": "https://sunnah.com/mishkat:5528"
      },
      "grade": "لم تتمّ دراسته (الألباني)"
    },
    {
      "id": 9,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "عَنِ ابْنِ عَبَّاسٍ قَالَ فِي قَوْلِهِ تَعَالَى (فإِذا نُقر فِي النَّاقور)\n: الصّور قَالَ: و (الرجفة)\n: النَّفْخَةُ الْأُولَى وَ (الرَّادِفَةُ)\n: الثَّانِيَةُ. رَوَاهُ الْبُخَارِيُّ فِي تَرْجَمَة بَاب",
      "english": {
        "narrator": "",
        "text": "Ibn `Abbas said regarding the words of Him who is exalted, \"When the trump (naqur) is sounded,\" is the second. \n Quran; 74:8\n Quran; 79:6\n Quran; 79:7\n\nBukhari transmitted it in a chapter heading."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5529",
        "url": "https://sunnah.com/mishkat:5529"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 10,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي سَعِيدٍ قَالَ: ذَكَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَاحِبُ الصُّورِ وَقَالَ: «عَن يَمِينه جِبْرِيل عَن يسَاره مِيكَائِيل»",
      "english": {
        "narrator": "",
        "text": "Abu Sa'id told that God's messenger mentioned the one who Would blow the trumpet, saying that Gabriel would be at his right hand and Michael at his left."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5530",
        "url": "https://sunnah.com/mishkat:5530"
      },
      "grade": null
    },
    {
      "id": 11,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن أبي رزين الْعقيلِيّ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ كَيْفَ يُعِيدُ الله الْخلق؟ مَا آيَةُ ذَلِكَ فِي خَلْقِهِ؟ قَالَ: «أَمَا مَرَرْتَ بِوَادِي قَوْمِكَ جَدْبًا ثُمَّ مَرَرْتَ بِهِ يَهْتَزُّ خَضِرًا؟» قُلْتُ: نَعَمْ. قَالَ: \" فَتِلْكَ آيَةُ اللَّهِ فِي خلقه (كَذَلِك يحيي اللَّهُ الْمَوْتَى)\nرَوَاهُمَا رزين",
      "english": {
        "narrator": "",
        "text": "Abu Razin al- `Uqaili told that he asked God's messenger how God would restore all things and what indication there was of that in His creation. He replied, \"Have you not come by the wadi of your people when it was barren, then come by it when it was shaking with verdure?\" One being told that he had, he said, \"That is God's sign in His creation and thus will God bring the dead to life.\" \n\nRazin transmitted the two traditions."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5531",
        "url": "https://sunnah.com/mishkat:5531"
      },
      "grade": null
    },
    {
      "id": 12,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "عَنْ سَهْلِ بْنِ سَعْدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يُحْشَرُ النَّاسُ يَوْمَ الْقِيَامَةِ عَلَى أَرْضٍ بَيْضَاءَ عَفْرَاءَ كَقُرْصَةِ النَّقِيِّ لَيْسَ فِيهَا عَلَمٌ لأحدٍ» . مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Sahl b. Sa'd reported God's messenger as saying, \"On the day of resurrection mankind will be assembled on a white plain with a reddish tinge like a loaf of white bread with no mark set up for anyone.'' \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5532",
        "url": "https://sunnah.com/mishkat:5532"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 13,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «تَكُونُ الْأَرْضُ يَوْمَ الْقِيَامَةِ خُبْزَةً وَاحِدَةً يَتَكَفَّؤُهَا الْجَبَّارُ بِيَدِهِ كَمَا يَتَكَفَّأُ أَحَدُكُمْ خُبْزَتَهُ فِي السّفر نُزُلاً لِأَهْلِ الْجَنَّةِ» . فَأَتَى رَجُلٌ مِنَ الْيَهُودِ. فَقَالَ: بَارَكَ الرَّحْمَنُ عَلَيْكَ يَا أَبَا الْقَاسِمِ أَلَا أُخبرُك بِنُزُلِ أهل الجنةِ يومَ القيامةِ؟ قَالَ: «بَلَى» . قَالَ: تَكُونُ الْأَرْضُ خُبْزَةً وَاحِدَةً كَمَا قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. فَنَظَرَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَيْنَا ثُمَّ ضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُ ثُمَّ قَالَ: أَلَا أُخْبِرُكَ بِأَدَامِهِمْ؟ بَالَامٌ وَالنُّونُ. قَالُوا: وَمَا هَذَا؟ قَالَ: ثَوْرٌ وَنُونٌ يَأْكُلُ مِنْ زَائِدَةِ كَبِدِهِمَا سَبْعُونَ ألفا. مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Abu Sa'id al-Khudri reported God's messenger as saying, \"On the day of resurrection the earth will be one piece of bread which the Almighty will turn in His hand, as one of you turns his loaf while travelling, to be food provided for the inhabitants of paradise.\" A Jew then came and said, \"May the Compassionate One bless you, Abul Qasim! Shall I not tell you the food provided on the day of resurrection for those who will go to paradise?\" Receiving the reply, \"Certainly,\" he said, \"The earth will be one piece of bread as the Prophet has said.\" The Prophet then looked at the people and laughed so that his molar teeth were visible, and the Jew said, \"Shall I not tell you what they will have to season it t It will be balam and fish.\" He was asked what that wis and replied that it was an ox and a fish from whose excessive livers seventy thousand would eat.\n*This word which is explained as meaning an ox is mentioned in Taj al-'arus in connection with this tradition as a Hebrew word, but that is probably because a Jew used it and had to be asked what it meant. There seems to be no justification for calling it Hebrew. \n\n(Bukhari and Muslim,)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5533",
        "url": "https://sunnah.com/mishkat:5533"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 14,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" يُحْشَرُ النَّاسُ عَلَى ثَلَاثِ طَرَائِقَ: رَاغِبِينَ رَاهِبِينَ وَاثْنَانِ عَلَى بَعِيرٍ وَثَلَاثَةٌ عَلَى بَعِيرٍ وَأَرْبَعَةٌ عَلَى بَعِيرٍ وَعَشَرَةٌ عَلَى بَعِيرٍ وَتَحْشُرُ بَقِيَّتَهُمُ النَّارُ. تَقِيلُ مَعَهُمْ حَيْثُ قَالُوا وَتَبِيتُ مَعَهُمْ حَيْثُ باتو وَتُصْبِحُ مَعَهُمْ حَيْثُ أَصْبَحُوا وَتُمْسِي مَعَهُمْ حَيْثُ يمسوا \". مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "Abu Huraira reported God's messenger as saying, \"Mankind will be assembled in three classes:",
        "text": "those who desire paradise and those who fear hell coming two, three, four and ten on a camel; and the rest will be assembled, hell being with them where they are at midday, where they spend the night, where they are in the morning, and where they are in the evening.\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5534",
        "url": "https://sunnah.com/mishkat:5534"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 15,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّكُمْ مَحْشُورُونَ حُفَاةً عُرَاةً غُرْلًا» ثُمَّ قَرَأَ: (كَمَا بَدَأْنَا أَوَّلَ خَلْقٍ نُعِيدُهُ وَعْدًا عَلَيْنَا إِنَّا كُنَّا فاعلين)\nوَأَوَّلُ مَنْ يُكْسَى يَوْمَ الْقِيَامَةِ إِبْرَاهِيمُ وَإِنَّ نَاسًا مِنْ أَصْحَابِي يُؤْخَذُ بِهِمْ ذَاتَ الشِّمَالِ فَأَقُولُ: أُصَيْحَابِي أُصَيْحَابِي فَيَقُولُ: إِنَّهُمْ لَنْ يَزَالُوا مرتدين على أَعْقَابهم مذْ فَارَقْتهمْ. فَأَقُول كَمَا قَالَ الْعَبْدُ الصَّالِحُ: (وَكُنْتُ عَلَيْهِمْ شَهِيدًا مَا دمت فيهم)\nإِلى قَوْله (الْعَزِيز الْحَكِيم)\nمُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Ibn `Abbas reported the Prophet as saying, \"At the resurrection you will be assembled barefoot, naked and uncircumcised.\" He then recited, \"As We originated the first creation so shall We restore it -- a promise binding on Us. We shall surely do so,\" and continued, \"The first to be clothed on the day of resurrection will be Abraham. Then some of my companions will be taken to the left, and when I cry, `My little companions, my little companions!' I shall receive the reply that they have kept going back to infidelity since I left them. I shall then say as the upright servant said, `I was a witness regarding them as long as I remained among them...the Mighty, the Wise'.\" 2 \n1. Quran, 21:104. \n2. Quran, 5:117 f\n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5535",
        "url": "https://sunnah.com/mishkat:5535"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 16,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ عَائِشَةَ قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «يُحْشَرُ النَّاسُ يَوْمَ الْقِيَامَةِ حُفَاةً عُرَاةً غُرْلًا» . قُلْتُ: يَا رَسُولَ اللَّهِ الرِّجَالُ وَالنِّسَاءُ جَمِيعًا يَنْظُرُ بَعْضُهُمْ إِلَى بَعْضٍ؟ فَقَالَ: «يَا عَائِشَةُ الْأَمْرُ أَشَدُّ مِنْ أَنْ يَنْظُرَ بَعْضُهُمْ إِلَى بَعْضٍ» . مُتَّفَقٌ عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "`A'isha told that she heard God's messenger say, \"Mankind will be assembled on the day of resurrection barefoot, naked and uncircumcised.\" She asked God's messenger whether men and women would be together looking at one another, and he replied, \"The matter will be too serious, `A'isha, for them to look at one another.\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5536",
        "url": "https://sunnah.com/mishkat:5536"
      },
      "grade": "مُتَّفق عَلَيْهِ (الألباني)"
    },
    {
      "id": 17,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَنَسٍ أَنَّ رَجُلًا قَالَ: يَا نَبِيَّ اللَّهِ كَيْفَ يُحْشَرُ الْكَافِرُ عَلَى وَجْهِهِ يَوْمَ الْقِيَامَةِ؟ قَالَ: «أَلَيْسَ الَّذِي أَمْشَاهُ عَلَى الرِّجْلَيْنِ فِي الدُّنْيَا قَادِرًا عَلَى أَنْ يُمْشِيَهُ عَلَى وَجْهِهِ يَوْمَ الْقِيَامَةِ؟» . مُتَّفَقٌ عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Anas told that when a man asked, \"Prophet of God, how will the infidel be brought to the assembly on his face on the day of resurrection?\" he replied, \"Is He who caused him to walk on his feet in the world not able to make him walk on his face on the day of resurrection?\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5537",
        "url": "https://sunnah.com/mishkat:5537"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 18,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" يَلْقَى إِبْرَاهِيمُ أَبَاهُ آزَرَ يَوْمَ الْقِيَامَةِ وَعَلَى وَجْهِ آزَرَ قَتَرَةٌ وَغَبَرَةٌ فَيَقُولُ لَهُ إِبْرَاهِيمُ: أَلَمْ أَقُلْ لَكَ: لَا تَعْصِنِي؟ فَيَقُولُ لَهُ أَبُوهُ: فَالْيَوْمَ لَا أَعْصِيكَ. فَيَقُول إِبراهيم: يَا رب إِنَّك وَعَدتنِي أَلا تخزني يَوْمَ يُبْعَثُونَ فَأَيُّ خِزْيٍ أَخْزَى مِنْ أَبِي الْأَبْعَدِ فَيَقُولُ اللَّهُ تَعَالَى: إِنِّي حَرَّمْتُ الْجَنَّةَ عَلَى الْكَافِرِينَ ثُمَّ يُقَالُ لِإِبْرَاهِيمَ: مَا تَحْتَ رِجْلَيْكَ؟ فَيَنْظُرُ فَإِذَا هُوَ بِذِيخٍ مُتَلَطِّخٍ فَيُؤْخَذُ بقوائمه فَيُلْقى فِي النَّار \". رَوَاهُ البُخَارِيّ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported the Prophet as saying, \"On the day of resurrection Abraham will meet his father Azar with blackness and dust on Azar's face and ask him if he did not tell him not to disobey him. His father will reply that now he will not disobey him, and Abraham will say, `My Lord, Thou hast promised not to put me to shame on the day when men are resurrected, but what shame is greater than my father being farthest from Thy mercy?' God most high will reply, `I have debarred the infidels from paradise.' Abraham will then be told to look and see what is under his feet, and he will see a bespattered hairy hyena which will then be taken by its legs and thrown into hell.\" \n*Abraham's father will be turned into the form of a hyena so that Abraham will not see him being thrown into hell in his own form. \n\nBukhari transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5538",
        "url": "https://sunnah.com/mishkat:5538"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 19,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَعْرَقُ النَّاسُ يَوْمَ الْقِيَامَةِ حَتَّى يَذْهَبَ عَرَقُهُمْ فِي الْأَرْضِ سَبْعِينَ ذِرَاعًا وَيُلْجِمُهُمْ حَتَّى يَبْلُغَ آذَانَهُمْ» . مُتَّفَقٌ عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"On the day of resurrection mankind will sweat to such an extent that their sweat will penetrate the earth seventy cubits, and it will cover their mouths, reaching to their ears.\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5539",
        "url": "https://sunnah.com/mishkat:5539"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 20,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنِ الْمِقْدَادِ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «تُدْنَى الشَّمْسُ يَوْمَ الْقِيَامَةِ مِنَ الْخَلْقِ حَتَّى تَكُونَ مِنْهُمْ كَمِقْدَارِ مِيلٍ فَيَكُونُ النَّاسُ عَلَى قَدْرِ أَعْمَالِهِمْ فِي الْعَرَقِ فَمِنْهُمْ مَنْ يَكُونُ إِلَى كَعْبَيْهِ وَمِنْهُمْ مَنْ يَكُونُ إِلَى رُكْبَتَيْهِ وَمِنْهُمْ مَنْ يَكُونُ إِلَى حَقْوَيْهِ وَمِنْهُمْ مَنْ يُلْجِمُهُمُ الْعَرَقُ إِلْجَامًا» وَأَشَارَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدِهِ إِلَى فِيهِ. رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Al-Miqdad told that he heard God's messenger say, \"On the day of resurrection the sun will come near created beings till it is about a mile. from them, and mankind will sweat according to what they have done, the sweat reaching the ankles of some, the knees of others, the waists of others, while some will have their mouths covered by the sweat,\" and God's messenger pointed his hand at his mouth. \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5540",
        "url": "https://sunnah.com/mishkat:5540"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 21,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \" يَقُولُ اللَّهُ تَعَالَى: يَا آدَمُ فَيَقُولُ: لَبَّيْكَ وَسَعْدَيْكَ وَالْخَيْرُ كُلُّهُ فِي يَدَيْكَ. قَالَ: أَخْرِجْ بَعْثَ النَّارِ. قَالَ: وَمَا بَعْثُ النَّارِ؟ قَالَ: مِنْ كُلِّ أَلْفٍ تِسْعَمِائَةٍ وَتِسْعَةً وَتِسْعِينَ فَعِنْدَهُ يَشِيبُ الصَّغِيرُ (وَتَضَعُ كُلُّ ذَاتِ حَمْلٍ حَمْلَهَا وَتَرَى النَّاسَ سُكَارَى وَمَا هُمْ بِسُكَارَى وَلَكِنَّ عَذَابَ اللَّهِ شديدٌ)\nقَالُوا: يَا رَسُولَ اللَّهِ وَأَيُّنَا ذَلِكَ الْوَاحِدُ؟ قَالَ: «أَبْشِرُوا فَإِنَّ مِنْكُمْ رَجُلًا وَمِنْ يَأْجُوجَ وَمَأْجُوجَ أَلْفٌ» ثُمَّ قَالَ: «وَالَّذِي نَفْسِي بِيَدِهِ أَرْجُو أَنْ تَكُونُوا رُبُعَ أَهْلِ الْجَنَّةِ» فَكَبَّرْنَا. فَقَالَ: «أَرْجُو أَنْ تَكُونُوا ثُلُثَ أَهْلِ الْجَنَّةِ» فَكَبَّرْنَا فَقَالَ: «أَرْجُو أَنْ تَكُونُوا نِصْفَ أَهْلِ الْجَنَّةِ» فَكَبَّرْنَا قَالَ: «مَا أَنْتُمْ فِي النَّاسِ إِلَّا كَالشَّعْرَةِ السَّوْدَاءِ فِي جِلْدِ ثَوْرٍ أَبْيَضَ أَوْ كشعرة بَيْضَاءَ فِي جِلْدِ ثَوْرٍ أَسْوَدَ» . مُتَّفَقٌ عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Aba Sa`id al-Khudri reported the Prophet as saying that God most high will call Adam and he will reply, \"At Thy service and at Thy pleasure, in Whose hands is all good.\" God will tell him to bring out those who are to go to hell, and when he asks what this consists of, he will be told that it is nine hundred and ninety-nine out of every thousand. Then young children will become grey-haired, pregnant women will give birth, and mankind will appear drunk although they will not be really so; but God's punishment is severe. On being asked which of them that one would be God's messenger replied, \"Be of good cheer, for there is one of you to every thousand of Gog and Magog.\" He then said, \"By Him in whose hand my soul is, I hope you may be a quarter of the inhabitants of paradise,\" and when they cried, \"God is most great,\" he said, \"I hope you may be a third of the inhabitants of paradise.\" Again, they cried, \"God is most great,\" and he said, \" I hope you may be half the inhabitants of paradise.\" Yet again, they cried, \"God is most great,\" and he said, \"Among mankind you are just like a black hair in the skin of a white bull, or like a white hair in the skin of a black bull.\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5541",
        "url": "https://sunnah.com/mishkat:5541"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 22,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «يَكْشِفُ رَبُّنَا عَنْ سَاقِهِ فَيَسْجُدُ لَهُ كُلُّ مُؤْمِنٍ وَمُؤْمِنَةٍ وَيَبْقَى مَنْ كَانَ يَسْجُدُ فِي الدُّنْيَا رِيَاءً وَسُمْعَةً فَيَذْهَبُ لِيَسْجُدَ فَيَعُودُ ظَهْرُهُ طَبَقًا وَاحِدًا» . مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "He told that he heard God's messenger say, \"Our Lord will uncover His leg and every believing man and woman will fall in prostration before Him. Those who prostrated themselves in the world from hypocrisy and show will remain, but when they proceed to prostrate themselves, their backs will become a single piece.\" \n*Cf. Quran, 48:42. The reference is either to the beginning of terrors, or to the end of all mystery. \n   \n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5542",
        "url": "https://sunnah.com/mishkat:5542"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 23,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَيَأْتِي الرَّجُلُ الْعَظِيمُ السَّمِينُ يَوْمَ الْقِيَامَةِ لَا يَزِنُ عندَ الله جَناحَ بعوضة» . وَقَالَ: \" اقرؤوا (فَلَا نُقيمُ لَهُم يومَ القيامةِ وَزْناً)\nمُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "Abu Huraira reported God's messenger as saying, \"On the day of resurrection a huge, fat man will come, but in God's estimate he will not weigh as much as a gnat's wing.\" He told them to recite:",
        "text": "\"We shall not assign them any weight on the day of resurrection.\" *\n*Quran; 18:105. \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5543",
        "url": "https://sunnah.com/mishkat:5543"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 24,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ هَذِهِ الْآيَةَ: (يَوْمَئِذٍ تُحدِّثُ أخبارَها)\nقَالَ:\nأَتَدْرُونَ مَا أَخْبَارُهَا؟ \" قَالُوا: اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: \" فَإِنَّ أَخْبَارَهَا أَنْ تَشْهَدَ عَلَى كلِّ عَبْدٍ وَأَمَةٍ بِمَا عَمِلَ عَلَى ظَهْرِهَا أَنْ تَقول: عمِلَ عَليَّ كَذَا وَكَذَا يومَ كَذَا وَكَذَا \". قَالَ: «فَهَذِهِ أَخْبَارُهَا» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ غَرِيبٌ",
      "english": {
        "narrator": "",
        "text": "Aba Huraira-told that God's messenger recited this verse, \"On that day it will, tell its news,\"  and asked whether they knew what its news would be. On their replying that God and His messenger knew best he said, \" Its news will be that it will tell what every man and woman did when they were on it, saying they did such and such a thing on such and such a day. This will be its news.\"\n*Quran; 99:4, the reference being to the earth.  \n\nAhmad and Tirmidhi transmitted it, Tirmidhi saying this is a hasan sahih gharib tradition."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5544",
        "url": "https://sunnah.com/mishkat:5544"
      },
      "grade": null
    },
    {
      "id": 25,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا مِنْ أَحَدٍ يَمُوتُ إِلَّا نَدِمَ» . قَالُوا: وَمَا نَدَامَتُهُ يَا رَسُولَ اللَّهِ؟ قَالَ: «إِنْ كَانَ مُحْسِنًا نَدِمَ أَنْ لَا يَكُونَ ازْدَادَ وَإِنْ كَانَ مُسِيئًا نَدِمَ أَنْ لَا يكونَ نزع» . رَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"Everyone who dies will repent.\" He was asked the nature of their repentance and replied, \"If one did what was good, he will repent of not having done more, and if one did evil, he will repent of not having restrained himself.\" \n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5545",
        "url": "https://sunnah.com/mishkat:5545"
      },
      "grade": null
    },
    {
      "id": 26,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" يُحْشَرُ النَّاسُ يَوْمَ الْقِيَامَةِ ثَلَاثَةَ أَصْنَافٍ: صِنْفًا مُشَاةً وَصِنْفًا رُكْبَانًا وَصِنْفًا عَلَى وُجُوهِهِمْ \" قِيلَ: يَا رَسُولَ اللَّهِ وَكَيْفَ يَمْشُونَ عَلَى وُجُوهِهِمْ؟ قَالَ: «إِنَّ الَّذِي أَمْشَاهُمْ عَلَى أَقْدَامِهِمْ قَادِرٌ عَلَى أَنْ يُمْشِيَهُمْ عَلَى وُجُوهِهِمْ أَمَا إِنَّهُمْ يَتَّقُونَ بِوُجُوهِهِمْ كُلَّ حَدَبٍ وَشَوْكٍ» . رَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"Mankind will be assembled on the day of resurrection in three classes, one walking, one riding and one on their faces.\" \"He was asked how people could walk on their faces and replied, \"He who caused them to walk on their feet has power to make them walk on their faces. They will guard themselves by their faces from every acclivity and from thorns.\" \n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5546",
        "url": "https://sunnah.com/mishkat:5546"
      },
      "grade": null
    },
    {
      "id": 27,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" مَنْ سَرَّهُ أَنْ يَنْظُرَ إِلَى يَوْمِ الْقِيَامَةِ كَأَنَّهُ رَأْيُ عَيْنٍ فليَقرأْ: (إِذا الشَّمسُ كُوِّرَتْ)\nو (إِذا السَّماءُ انفطرَتْ)\nو (إِذا السَّماءُ انشقَّتْ)\nرَوَاهُ أَحْمد وَالتِّرْمِذِيّ",
      "english": {
        "narrator": "Ibn 'Umar reported God's messenger as saying, \"If anyone would like to look at the day of resurrection as though it were before his eyes he should recite:",
        "text": "`When the sun is obscured \n1. Quran, 81 \n2. Quran, 82\n3. Quran, 84 \n\nAhmad and Tirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5547",
        "url": "https://sunnah.com/mishkat:5547"
      },
      "grade": null
    },
    {
      "id": 28,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "عَنْ أَبِي ذَرٍّ قَالَ: إِنَّ الصَّادِقَ الْمَصْدُوقَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ حَدَّثَنِي: \n\" أَنَّ النَّاسَ يُحْشَرُونَ ثَلَاثَةَ أَفْوَاجٍ: فَوْجًا رَاكِبِينَ طَاعِمِينَ كَاسِينَ وفوجا تسحبنهم الْمَلَائِكَةُ عَلَى وُجُوهِهِمْ وَتَحْشُرُهُمُ النَّارُ وَفَوْجًا يَمْشُونَ وَيَسْعَوْنَ وَيُلْقِي اللَّهُ الْآفَةَ عَلَى الظَّهْرِ فَلَا يَبْقَى حَتَّى إِنَّ الرَّجُلَ لَتَكُونُ لَهُ الْحَدِيقَةُ يُعْطِيهَا بِذَاتِ الْقَتَبِ لَا يَقْدِرُ عَلَيْهَا \". رَوَاهُ النَّسَائِيّ",
      "english": {
        "narrator": "",
        "text": "Abu Dharr said that the truthful one whose word is believed told him that mankind would be assembled in three groups, one riding with food and clothing, one being dragged on their faces by the angels who assemble them to hell, and one walking and running. God will cast a calamity on riding-beasts so that none will remain, with the result that a man who has a garden will be ready to give it for a saddled shecamel, but will be unable to get one. \n\nNasa'i transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5548",
        "url": "https://sunnah.com/mishkat:5548"
      },
      "grade": null
    },
    {
      "id": 29,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَيْسَ أَحَدٌ يُحَاسَبُ يَوْمَ الْقِيَامَةِ إِلَّا هَلَكَ» . قلتُ: أوَ ليسَ يقولُ اللَّهُ: (فسوْفَ يُحاسبُ حسابا يَسِيرا)\nفَقَالَ: «إِنَّمَا ذَلِكَ الْعَرْضُ وَلَكِنْ مَنْ نُوقِشَ فِي الْحساب يهلكُ» . مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "`A'isha reported the Prophet as saying, \"Everyone who is taken to account on the day of resurrection will perish.\" She asked if God does not say, \"He will made subject to an easy reckoning,\" * and he replied, \"That is merely the review, but those who are closely examined in the reckoning will perish.\" \n*Quran; 84:8 This is here explained as a general review and not a detailed examination.\n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5549",
        "url": "https://sunnah.com/mishkat:5549"
      },
      "grade": "مُتَّفق عَلَيْهِ (الألباني)"
    },
    {
      "id": 30,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن عديِّ بن حاتمٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «مَا مِنْكُم أَحَدٍ إِلَّا سَيُكَلِّمُهُ رَبُّهُ لَيْسَ بَيْنَهُ وَبَيْنَهُ تُرْجُمَانٌ وَلَا حِجَابٌ يَحْجُبُهُ فَيَنْظُرُ أَيْمَنَ مِنْهُ فَلَا يَرَى إِلَّا مَا قَدَّمَ مِنْ عَمَلِهِ وَيَنْظُرُ أَشْأَمَ مِنْهُ فَلَا يَرَى إِلَّا مَا قَدَّمَ وَيَنْظُرُ بَيْنَ يَدَيْهِ فَلَا يَرَى إِلَّا النَّارَ تِلْقَاءَ وَجْهِهِ فَاتَّقُوا النَّارَ وَلَوْ بِشِقِّ تَمْرَة» . مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "'Adi b. Hatim reported God's messenger as saying, \"There is not one of you to whom his Lord will not speak-without an interpreter between them and with no veil which conceals Him. He will look to his right and see only the deeds he had previously done, he will look to his left and see only the deeds he had previously done, and he will look in front of him and see nothing but hell before his face. So, protect yourselves from hell, even if it should be with half a date.\" *\n*i.e., by giving even such a small amount as sadaqa.\n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5550",
        "url": "https://sunnah.com/mishkat:5550"
      },
      "grade": "مُتَّفق عَلَيْهِ (الألباني)"
    },
    {
      "id": 31,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: \" إِن الله يدني الْمُؤمن فَيَضَع على كَنَفَهُ وَيَسْتُرُهُ فَيَقُولُ: أَتَعْرِفُ ذَنْبَ كَذَا؟ أَتَعْرِفُ ذَنْب كَذَا؟ فَيَقُول: نعم يَا رب حَتَّى قَرَّرَهُ ذنُوبه وَرَأى نَفْسِهِ أَنَّهُ قَدْ هَلَكَ. قَالَ: سَتَرْتُهَا عَلَيْكَ فِي الدُّنْيَا وَأَنَا أَغْفِرُهَا لَكَ الْيَوْمَ فَيُعْطَى كِتَابَ حَسَنَاتِهِ وَأَمَّا الْكُفَّارُ وَالْمُنَافِقُونَ فَيُنَادَى بِهِمْ على رؤوسِ الْخَلَائِقِ: (هَؤُلَاءِ الَّذِينَ كَذَبُوا عَلَى رَبِّهِمْ أَلَا لعنةُ اللَّهِ على الظالمينَ)\nمُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Ibn `Umar reported God's messenger as telling that God will bring the believer near, place His wing over him, cover him, and say, \"Are you aware of such and such a sin? Are you aware of such and such a sin?\" He will reply, \"Yes, my Lord,\" and this will continue till He makes him acknowledge his sins and he feels within himself that he has perished. God will then say, \"I concealed them for you in the world and I forgive you them to-day.\" He will then be given the record of his good deeds. But the infidels and hypocrites will have themselves proclaimed in presence of all creatures, \"These are they who lied against their Lord. God's curse be upon the evildoers!\"\n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5551",
        "url": "https://sunnah.com/mishkat:5551"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 32,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي مُوسَى قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:\nإِذَا كَانَ يَوْمُ الْقِيَامَةِ دَفَعَ اللَّهُ إِلَى كُلِّ مُسْلِمٍ يَهُودِيًّا أَوْ نَصْرَانِيًّا فَيَقُولُ: هَذَا فِكَاكُكَ مِنَ النَّارِ \" رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Abu Musa reported God's messenger as saying that when the day of resurrection comes God will hand a Jew or a Christian to every Muslim and say, \"This is your means of release from hell.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5552",
        "url": "https://sunnah.com/mishkat:5552"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 33,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" يُجَاءُ بِنُوحٍ يَوْمَ الْقِيَامَةِ فَيُقَالُ لَهُ: هَلْ بَلَّغْتَ؟ فَيَقُولُ: نَعَمْ يَا رَبِّ فَتُسْأَلُ أُمَّتُهُ: هَلْ بَلَّغَكُمْ؟ فَيَقُولُونَ: مَا جَاءَنَا مِنْ نَذِيرٍ. فَيُقَالُ: مَنْ شُهُودُكَ؟ فَيَقُولُ: مُحَمَّدٌ وَأُمَّتُهُ \". فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «فيجاء بكم فتشهدون على أنَّه قد بلَّغَ» ثُمَّ قَرَأَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ (وَكَذَلِكَ جَعَلْنَاكُمْ أُمَّةً وَسَطًا لِتَكُونُوا شُهَدَاءَ عَلَى النَّاسِ وَيَكُونَ الرَّسُولُ عَلَيْكُمْ شَهِيدا)\nرَوَاهُ البُخَارِيّ",
      "english": {
        "narrator": "",
        "text": "Abu Said reported God's messenger as saying, \"On the day of resurrection Noah will be brought and asked if he proclaimed the message, and when he replies, `Yes, my Lord,' his people will be asked whether he conveyed the message to them. They will say no warner came to them, so he will be asked who his witnesses are and will reply that they are Muhammad and his people.\" God's messenger said, \"You will then be brought and testify that he did convey the message.\" He then recited, \"Thus We have made you an intermediate people that you may be witnesses to mankind, and the messenger may be a witness to you.\" * \n*Quran; 2:143\n\nBukhari transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5553",
        "url": "https://sunnah.com/mishkat:5553"
      },
      "grade": "صَحِيحٌ (الألباني)"
    },
    {
      "id": 34,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَنَسٍ قَالَ: كُنَّا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَضَحِكَ فَقَالَ:\nهَلْ تَدْرُونَ مِمَّا أَضْحَكُ؟ \". قَالَ: قُلْنَا: اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: \" مِنْ مُخَاطَبَةِ الْعَبْدِ رَبَّهُ يَقُولُ: يَا رَبِّ أَلَمْ تُجِرْنِي مِنَ الظُّلْمِ؟ \" قَالَ: \" يَقُولُ: بَلَى \". قَالَ: \" فَيَقُولُ: فَإِنِّي لَا أُجِيزُ عَلَى نَفْسِي إِلَّا شَاهِدًا مِنِّي \". قَالَ: فَيَقُولُ: كَفَى بِنَفْسِكَ الْيَوْمَ عَلَيْكَ شَهِيدًا وَبِالْكِرَامِ الْكَاتِبِينَ شُهُودًا \". قَالَ: \" فَيُخْتَمُ عَلَى فِيهِ فَيُقَالُ لِأَرْكَانِهِ: انْطِقِي \". قَالَ: «فَتَنْطِقُ بِأَعْمَالِهِ ثُمَّ يُخَلَّى بَيْنَهُ وَبَيْنَ الْكَلَامِ» . قَالَ: \" فَيَقُولُ: بُعْدًا لَكُنَّ وَسُحْقًا فعنكنَّ كنتُ أُناضلُ \". رَوَاهُ مُسلم",
      "english": {
        "narrator": "Anas said:",
        "text": "Once when we were with God's messenger he laughed and asked if we knew why he was laughing. On our replying that God and His messenger knew best he told us that in the conversation a man will hold with his Lord he will say, \"My Lord, didst Thou not grant me protection from oppression?\" and when He replies that He certainly did he will say, \"I allow only a witness of my own kind concerning me.\" He will reply, \"You are sufficient to-day as a witness to yourself as are also the noble ones who keep records. His mouth will then be sealed and the members of his body will be told to speak. They will tell about his deeds, and when he is allowed to speak he will say, \"May you perish and be cursed! You are the ones in whose defence I was pleading.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5554",
        "url": "https://sunnah.com/mishkat:5554"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 35,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن أَبِي هُرَيْرَةَ قَالَ: قَالُوا: يَا رَسُولَ اللَّهِ هَلْ نَرَى رَبنَا يَوْم الْقِيَامَة؟ قَالَ: «فَهَل تُضَارُّونَ فِي رُؤْيَةِ الشَّمْسِ فِي الظَّهِيرَةِ لَيْسَتْ فِي سَحَابَةٍ؟» قَالُوا: لَا قَالَ: «فَهَلْ تُضَارُّونَ فِي رؤيةالقمر لَيْلَةَ الْبَدْرِ لَيْسَ فِي سَحَابَةٍ؟» قَالُوا: لَا قَالَ: «فَوَالَّذِي نَفْسِي بِيَدِهِ لَا تُضَارُّونَ فِي رُؤْيَةِ رَبِّكُمْ إِلَّا كَمَا تُضَارُّونَ فِي رُؤْيَةِ أَحَدِهِمَا» . قَالَ: \" فَيَلْقَى الْعَبْدَ فَيَقُولُ: أَيْ فُلْ: أَلَمْ أُكْرِمْكَ وَأُسَوِّدْكَ وَأُزَوِّجْكَ وَأُسَخِّرْ لَكَ الْخَيْلَ وَالْإِبِلَ وَأَذَرْكَ تَرْأَسُ وَتَرْبَعُ؟ فَيَقُولُ بَلَى قَالَ: \" أَفَظَنَنْتَ أَنَّكَ مُلَاقِيَّ؟ فَيَقُولُ لَا فَيَقُولُ: فَإِنِّي قَدْ أَنْسَاكَ كَمَا نَسِيتَنِي ثُمَّ يَلْقَى الثَّانِيَ فَذَكَرَ مِثْلَهُ ثُمَّ يَلْقَى الثَّالِثَ فَيَقُولُ لَهُ مثل ذَلِك فَيَقُول يارب آمَنْتُ بِكَ وَبِكِتَابِكَ وَبِرُسُلِكَ وَصَلَّيْتُ وَصُمْتُ وَتَصَدَّقْتُ ويثني بِخَير مااستطاع فَيَقُول: هَهُنَا إِذا. ثمَّ يُقَال الْآن تبْعَث شَاهِدًا عَلَيْكَ وَيَتَفَكَّرُ فِي نَفْسِهِ: مَنْ ذَا الَّذِي يَشْهَدُ عَلَيَّ؟ فَيُخْتَمُ عَلَى فِيهِ وَيُقَالُ لِفَخِذِهِ: انْطِقِي فَتَنْطِقُ فَخِذُهُ وَلَحْمُهُ وَعِظَامُهُ بِعَمَلِهِ وَذَلِكَ لِيُعْذِرَ مِنْ نَفْسِهِ وَذَلِكَ الْمُنَافِقُ وَذَلِكَ يسخطُ اللَّهُ عَلَيْهِ \"\nرَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Abu Huraira told that some people asked God's messenger whether they would see their Lord on the day of resurrection, and he asked them if they disagreed with one another about seeing the sun at noon when it was not clouded. When they replied that they did not he asked them whether they disagreed with one another about seeing the moon on the night when it is full and unclouded. They replied that they did not, and he said, \"By Him in whose hand my soul is, your disagreement with one another about seeing your Lord will just be like your disagreement about seeing one of these two.\" He then told that He would meet a man and say, \"So and so, did I not honour you, make you a lord, give you a wife, make horses and camels subject to you, and did I not let you be a chief and take a quarter of the spoil?\" and he will reply that that is so. He will ask if he thought he would meet Him, and when he replies tha t he did not He will say, \"Well, I have forgotten you as you forgot Me.' He will meet another, about whom he mentioned something similar. He will then meet a third, and when he says the same kind of thing to him, he will reply, \"My Lord, I believed in Thee, Thy Book, Thy messengers, I prayed, fasted and gave sadaqa,\" and he will praise himself for his good actions as much as he can. He will reply, \"Stay here, then. Now We shall raise up a witness concerning you,\" whereupon he will wonder within himself who it is who will testify concerning him. His mouth will be sealed and his thigh will be told to speak, then his thigh, his flesh and his bones will speak about what he has done. That man makes excuses for himself, but that one is the hypocrite and that is the one with whom God is displeased. \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5555",
        "url": "https://sunnah.com/mishkat:5555"
      },
      "grade": null
    },
    {
      "id": 36,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "عَنْ أَبِي أُمَامَةَ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «وَعَدَنِي رَبِّي أَنْ يُدْخِلَ الْجَنَّةَ مِنْ أُمَّتِي سَبْعِينَ أَلْفًا لَا حِسَابَ عَلَيْهِمْ وَلَا عَذَابَ مَعَ كُلِّ أَلْفٍ سَبْعُونَ أَلْفًا وَثَلَاثُ حَثَيَاتٍ مِنْ حَثَيَاتِ رَبِّي» . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ وَابْن مَاجَه",
      "english": {
        "narrator": "",
        "text": "Abu Umama a told that he heard God's messenger say, \"My Lord has promised me to bring into paradise seventy thousand of my people without any reckoning or punishment, each thousand accompanied by seventy thousand and three handfuls added by my Lord.\" \n*A figure of speech to indicate an unspecified additional number.\n\nAhmad, Tirmidhi and Ibn Majah transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5556",
        "url": "https://sunnah.com/mishkat:5556"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 37,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن الحسنِ عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" يُعْرَضُ النَّاسُ يَوْمَ الْقِيَامَةِ ثَلَاثَ عَرَضَاتٍ: فَأَمَّا عَرْضَتَانِ فَجِدَالٌ وَمَعَاذِيرُ وَأَمَّا الْعَرْضَةُ الثَّالِثَةُ فَعِنْدَ ذَلِكَ تَطِيرُ الصُّحُفُ فِي الْأَيْدِي فَآخِذٌ بِيَمِينِهِ وَآخِذٌ بِشِمَالِهِ \". رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَقَالَ لَا يَصِحُّ هَذَا الْحَدِيثُ مِنْ قِبَلِ أَنَّ الْحَسَنَ لَمْ يَسْمَعْ مِنْ أبي هُرَيْرَة\nوَقَدْ رَوَاهُ بَعْضُهُمْ عَنِ الْحَسَنِ عَنْ أَبِي مُوسَى",
      "english": {
        "narrator": "",
        "text": "Al-Hasan quoted Abu Huraira who reported God's messenger as saying, \"On the day of resurrection mankind will be reviewed three times, the first two consisting of disputing and excuses, but at the third the records of men's deeds will go quickly into their hands, some getting them in their right hands and some in their left.\" \n\nAhmad and Tirmidhi transmitted it, but Tirmidhi said this tradition is not sound, as al-Hasan did not hear anything from Abu Huraira and some have transmitted it on al-Hasan's authority quoting Abu Musa as his authority."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5557, 5558",
        "url": "https://sunnah.com/mishkat:5557"
      },
      "grade": null
    },
    {
      "id": 38,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِنَّ اللَّهَ سيخلِّصُ رجلا من أُمّتي على رُؤُوس الْخَلَائِقِ يَوْمَ الْقِيَامَةِ فَيَنْشُرُ عَلَيْهِ تِسْعَةً وَتِسْعِينَ سِجِلًّا كُلُّ سِجِلٍّ مِثْلَ مَدِّ الْبَصَرِ ثُمَّ يَقُولُ: أَتُنْكِرُ مِنْ هَذَا شَيْئًا؟ أَظَلَمَكَ كَتَبَتِي الحافظون؟ فَيَقُول: لَا يارب فَيَقُول: أَفَلَك عذر؟ قَالَ لَا يارب فَيَقُولُ بَلَى. إِنَّ لَكَ عِنْدَنَا حَسَنَةً وَإِنَّهُ لَا ظُلْمَ عَلَيْكَ الْيَوْمَ فَتُخْرَجُ بِطَاقَةٌ فِيهَا أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ فَيَقُولُ احْضُرْ وَزْنَكَ. فَيَقُولُ: يَا رَبِّ مَا هَذِهِ الْبِطَاقَةُ مَعَ هَذِهِ السِّجِلَّاتِ؟ فَيَقُولُ: إِنَّكَ لَا تُظْلَمُ قَالَ: فَتُوضَعُ السِّجِلَّاتُ فِي كِفَّةٍ وَالْبِطَاقَةُ فِي كِفَّةٍ فَطَاشَتِ السِّجِلَّاتُ وَثَقُلَتِ الْبِطَاقَةُ فَلَا يَثْقُلُ مَعَ اسْمِ الله شَيْء \". رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه",
      "english": {
        "narrator": "",
        "text": "`Abdullah b. `Amr reported God's messenger as saying that on the day of resurrection God will separate a man belonging to his people in presence of all creatures and spread ninety-nine scrolls over him, each scroll extending as far as the eye can see, then say, \"Do you object to anything in this? Have my scribes who keep note wronged you?\" He will reply, \"No, my Lord.\" He will ask him if he has any excuse; and when he tells his Lord that he has none, He will say, \"On the contrary you have with Us a good deed, and you will not be wronged to-day.\" A document will then be brought out containing, \"I testify that there is no god but God, and that Muhammad is His servant and messenger,\" and He will say, \"Come to be weighed.\" He will ask his Lord what this document along with these scrolls is. and He will reply, \"You will not be wronged.\" The scrolls will then be put in one side of the scale and the document in the other, and the scrolls will become light and the document heavy, for nothing can compare in weight with God's name. \n\nTirmidhi and Ibn Majah transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5559",
        "url": "https://sunnah.com/mishkat:5559"
      },
      "grade": null
    },
    {
      "id": 39,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن عائشةَ أَنَّهَا ذَكَرَتِ النَّارَ فَبَكَتْ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا يُبْكِيكِ؟» . قَالَتْ: ذَكَرْتُ النَّارَ فَبَكَيْتُ فَهَلْ تَذْكُرُونَ أَهْلِيكُمْ يَوْمَ الْقِيَامَةِ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" أَمَّا فِي ثَلَاثَةِ مَوَاطِنَ فَلَا يَذْكُرُ أَحَدٌ أَحَدًا: عِنْدَ الْمِيزَانِ حَتَّى يَعْلَمَ: أَيَخِفُّ مِيزَانُهُ أَمْ يَثْقُلُ؟ وَعِنْدَ الْكِتَابِ حِينَ يُقَالُ (هاؤم اقرؤوا كِتَابيه)\nحَتَّى يَعْلَمَ: أَيْنَ يَقَعُ كِتَابُهُ أَفِي يَمِينِهِ أم فِي شِمَاله؟ أم مِنْ وَرَاءِ ظَهْرِهِ؟ وَعِنْدَ الصِّرَاطِ: إِذَا وُضِعَ بينَ ظَهْري جَهَنَّم \". رَوَاهُ أَبُو دَاوُد",
      "english": {
        "narrator": "",
        "text": "`A'isha told that she thought of hell and wept, and when God's messenger asked what was making her weep she replied, \"I thought of hell and wept. Will you remember your family on the day of resurrection?\" God's messenger said, \"There are three places where no one will remember anyone, at the scale until one knows whether his weight is light or heavy; at  the book when command is given to take and read God's record until he knows whether his book will come into his right hand, or into his left behind his back; * and at the Path when it is placed across Jahannam.\"\n*Cf. Quran; 84:7, 10. \n\nAbu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5560",
        "url": "https://sunnah.com/mishkat:5560"
      },
      "grade": null
    },
    {
      "id": 40,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "عَنْ عَائِشَةَ قَالَتْ: جَاءَ رَجُلٌ فَقَعَدَ بَيْنَ يَدَيْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: يَا رَسُولَ اللَّهِ إِنَّ لِي مَمْلُوكِينَ يَكْذِبُونَنِي وَيَخُونُونَنِي وَيَعْصُونَنِي وَأَشْتِمُهُمْ وَأَضْرِبُهُمْ فَكَيْفَ أَنَا مِنْهُمْ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِذَا كَانَ يَوْمُ الْقِيَامَةِ يُحْسَبُ مَا خَانُوكَ وَعَصَوْكَ وَكَذَّبُوكَ وَعِقَابُكَ إِيَّاهُمْ فَإِنْ كَانَ عِقَابُكَ إِيَّاهُمْ بِقَدْرِ ذُنُوبِهِمْ كَانَ كَفَافًا لَا لَكَ وَلَا عَلَيْكَ وَإِنْ كَانَ عِقَابُكَ إِيَّاهُمْ دُونَ ذَنْبِهِمْ كَانَ فَضْلًا لَكَ وَإِنْ كَانَ عِقَابُكَ إِيَّاهُمْ فَوْقَ ذُنُوبِهِمْ اقْتُصَّ لَهُمْ مِنْكَ الْفَضْلُ فَتَنَحَّى الرَّجُلُ وَجَعَلَ يَهْتِفُ وَيَبْكِي فَقَالَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" أَمَا تَقْرَأُ قَوْلَ اللَّهِ تَعَالَى: (وَنَضَعُ الْمَوَازِينَ الْقِسْطَ لِيَوْمِ الْقِيَامَةِ فَلَا تُظْلَمُ نَفْسٌ شَيْئًا وَإِنْ كَانَ مِثْقَالَ حَبَّةٍ مِنْ خَرْدَلٍ أَتَيْنَا بِهَا وَكَفَى بِنَا حَاسِبِينَ) فَقَالَ الرَّجُلُ: يَا رَسُولَ اللَّهِ مَا أَجِدُ لِي وَلِهَؤُلَاءِ شَيْئًا خَيْرًا مِنْ مُفَارَقَتِهِمْ أُشْهِدُكَ أَنهم كلَّهم أحرارٌ. رَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "`A'isha told that a man came and when he had sat down in front of God's messenger he said, \"Messenger of God, I have slaves who lie to me, deceive me and disobey me, and I revile and beat them. How do I stand with respect to them?\" He replied, \"On the day of resurrection account will be taken of the extent of their deceit, disobedience and lying towards you, and of the punishment you administered to them. If your punishment of them was in accordance with their offences, its being exactly right will count neither for you nor against you; if your punishment of them was less than their offence deserved it will be something extra to your credit; but if your punishment of them was greater than their offences deserved requital will be taken from you on their behalf for the excess.\" The man went aside and began to shout and weep, so God's messenger asked him if he did not recite the words of God most high, \"We shall place the just scales for the day of resurrection and no soul will be wronged in any respect, and even if there is only the weight of a grain of mustard-seed We will bring it, and. We are sufficient to take account.\" The man said, \"Messenger of God, I find nothing better for myself and these men than to separate from them. I call you to witness that they are all free.\" \n*Quran; 21:47\n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5561",
        "url": "https://sunnah.com/mishkat:5561"
      },
      "grade": null
    },
    {
      "id": 41,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهَا قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ فِي بَعْضِ صَلَاتِهِ: اللَّهُمَّ حَاسِبْنِي حِسَابًا يَسِيرًا \" قُلْتُ: يَا نَبِيَّ اللَّهِ مَا الْحِسَابُ الْيَسِيرُ؟ قَالَ: «أَنْ يَنْظُرَ فِي كِتَابه فيتجاوز عَنْهُ إِنَّهُ مَنْ نُوقِشَ الْحِسَابَ يَوْمَئِذٍ يَا عَائِشَة هلك» . رَوَاهُ أَحْمد",
      "english": {
        "narrator": "",
        "text": "She told that she heard God's messenger say in the course pf his prayer, \"0 God, grant me a light reckoning,\" and asked, \"Prophet of God, what is the light reckoning?\" He replied, \"That one's book should be examined and that God should forgive him. He who is severely taken to account that day, `A'isha, will perish.\" \n\nAhmad transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5562",
        "url": "https://sunnah.com/mishkat:5562"
      },
      "grade": null
    },
    {
      "id": 42,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّهُ أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: أَخْبِرْنِي مَنْ يَقْوَى عَلَى الْقِيَامِ يَوْمَ الْقِيَامَةِ الَّذِي قَالَ اللَّهُ عَزَّ وَجَلَّ: (يَوْمَ يَقُومُ النَّاسُ لربِّ الْعَالمين)؟ فَقَالَ: «يُخَفَّفُ عَلَى الْمُؤْمِنِ حَتَّى يَكُونَ عَلَيْهِ كَالصَّلَاةِ الْمَكْتُوبَة»\nوَعَنْهُ قَالَ: سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَنْ (يَوْمٍ كَانَ مِقْدَارُهُ خَمْسِينَ ألف سنةٍ)\nمَا طُولُ هَذَا الْيَوْمِ؟ فَقَالَ: «وَالَّذِي نَفْسِي بِيَدِهِ إِنَّهُ لَيُخَفَّفُ عَلَى الْمُؤْمِنِ حَتَّى يَكُونَ أَهْوَنَ عَلَيْهِ مِنَ الصَّلَاةِ الْمَكْتُوبَةِ يُصَلِّيهَا فِي الدُّنْيَا» . رَوَاهُمَا الْبَيْهَقِيُّ فِي كِتَابِ «الْبَعْثِ وَالنُّشُورِ»",
      "english": {
        "narrator": "",
        "text": "Abu Sa'id al-Khudri told that he went to God's messenger and asked him to tell him who would be strong enough to stand on the day of resurrection of which God who is great and glorious said, \"A day when mankind will stand before the Lord of the universe.\"1 He replied, \"It will be made easy for the believer, so that it will be for him like the prescribed prayer.\"\n\nHe told that God's messenger was asked about \"a day whose extent is fifty thousand years2,\" how men could endure the length of this day, and replied, \"By Him in whose hand my soul is, it will be made easy for the believer so that it will be easier for him than the prescribed prayer he observes in this world.\" \n\n Quran; 83:6\n Quran; 70:4\n\nBaihaqi transmitted the two traditions in Kitab al-ba'th wan nushur."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5563, 5564",
        "url": "https://sunnah.com/mishkat:5563"
      },
      "grade": null
    },
    {
      "id": 43,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن أَسمَاء بنت يزِيد عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" يُحْشَرُ النَّاسُ فِي صَعِيدٍ وَاحِدٍ يَوْمَ الْقِيَامَة فينادي منادٍ فَيَقُول: أَيْنَ الَّذِينَ كَانَتْ تَتَجَافَى جُنُوبُهُمْ عَنِ الْمَضَاجِعِ؟ فَيَقُومُونَ وَهُمْ قَلِيلٌ فَيَدْخُلُونَ الْجَنَّةَ بِغَيْرِ حِسَابٍ ثمَّ يُؤمر لسَائِر النَّاسِ إِلَى الْحِسَابِ «. رَوَاهُ الْبَيْهَقِيُّ فِي» شُعَبِ الْإِيمَان \"",
      "english": {
        "narrator": "",
        "text": "Asma.' daughter of Yazid reported God's messenger as saying, \"On the day of resurrection mankind will be assembled on one plain. A crier will call asking where those are whose sides kept away from their beds and they, few in number, will arise and enter paradise without reckoning being taken. Then the rest of mankind will be commanded to come to the reckoning.\n*Quran; 32:16\n\nBaihaqi transmitted it in Shu'ab al-iman."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5565",
        "url": "https://sunnah.com/mishkat:5565"
      },
      "grade": null
    },
    {
      "id": 44,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "عَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" بَيْنَا أَنَا أَسِيرُ فِي الجنَّةِ إِذا أَنا بنهر حافتاه الدُّرِّ الْمُجَوَّفِ قُلْتُ: مَا هَذَا يَا جِبْرِيلُ؟ قَالَ: الْكَوْثَرُ الَّذِي أَعْطَاكَ رَبُّكَ فَإِذَا طِينُهُ مِسْكٌ أذفر \". رَوَاهُ البُخَارِيّ",
      "english": {
        "narrator": "",
        "text": "Anas reported God's messenger as saying, \"While I was travelling in paradise, I came to a river whose banks were domes of hollowed pearls, and when I asked Gabriel what this was, he replied that it was al-Kauthar* which my Lord had given me. Its soil was the most excellent musk.\" \n*Quran, 108. \n\nBukhari transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5566",
        "url": "https://sunnah.com/mishkat:5566"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 45,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «حَوْضِي مَسِيرَةُ شَهْرٍ وَزَوَايَاهُ سَوَاءٌ مَاؤُهُ أَبْيَضُ مِنَ اللَّبَنِ وَرِيحُهُ أَطْيَبُ مِنَ الْمِسْكِ وَكِيزَانُهُ كَنُجُومِ السَّمَاءِ مَنْ يَشْرَبُ مِنْهَا فَلَا يظمأ أبدا» . مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "'Abdallah b. 'Amr reported God's messenger as saying, \"My pond is a month's journey and its sides are equal. Its water is whiter than milk, its odour is sweeter than musk, and its jugs are like the stars in the sky. He who drinks of it will never thirst.\" \n\n(Bukhari and Muslim)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5567",
        "url": "https://sunnah.com/mishkat:5567"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 46,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ حَوْضِي أَبْعَدُ مِنْ أَيْلَةَ مِنْ عَدَنٍ لَهُوَ أَشَدُّ بَيَاضًا مِنَ الثَّلْجِ وَأَحْلَى مِنَ الْعَسَلِ بِاللَّبَنِ وَلَآنِيَتُهُ أَكْثَرُ مِنْ عَدَدِ النُّجُومِ وَإِنِّي لَأَصُدُّ النَّاسَ عَنْهُ كَمَا يَصُدُّ الرَّجُلُ إِبِلَ النَّاسِ عَنْ حَوْضِهِ» . قَالُوا: يَا رَسُولَ اللَّهِ أَتَعْرِفُنَا يَوْمَئِذٍ؟ قَالَ: «نَعَمْ لَكُمْ سِيمَاءُ لَيْسَتْ لِأَحَدٍ مِنَ الْأُمَم تردون عليّ غرّاً من أثر الْوضُوء» . رَوَاهُ مُسلم\nوَفِي رِوَايَةٍ لَهُ عَنْ أَنَسٍ قَالَ: «تَرَى فِيهِ أَبَارِيقَ الذَّهَبِ وَالْفِضَّةِ كَعَدَدِ نُجُومِ السَّمَاءِ»\nوَفِي أُخْرَى لَهُ عَنْ ثَوْبَانَ قَالَ: سُئِلَ عَنْ شَرَابِهِ. فَقَالَ: \n\" أَشَدُّ بَيَاضًا مِنَ اللَّبَنِ وَأَحْلَى مِنَ الْعَسَلِ يَغُتُّ فِيهِ مِيزَابَانِ يَمُدَّانِهِ مِنَ الْجَنَّةِ: أَحَدُهُمَا مِنْ ذَهَبٍ وَالْآخَرُ مِنْ ورق \"",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported God's messenger as saying, \"My pond is more extensive than the distance between Aila and Aden. It is whiter than snow, sweeter than honey mixed with milk, and its vessels are more numerous than the stars. I shall drive people away from it just as a man drives away other people's camels from his pond.\" His hearers asked him if he would recognize them on that day and he replied, \"Yes, you will have a mark which will not be possessed by anyone belonging to other peoples. You will come down to me with a white blaze on your foreheads and white marks on your hands and feet because of the trace of ablution.\"\n*Aila is at the top of the Gulf of 'Aqaba.\n\nMuslim transmitted it.\n\nIn a version by him on the authority of Anas he said, \"Vessels of gold and silver as numerous as the stars in the sky will be seen at it.\" In another version by him on Thauban's authority it is said that when he was asked about its drink he replied, \"It is whiter than milk and sweeter than honey. Two pipes which supply it from paradise flow into it, one of gold and the other of silver.\" \n\nMuslim."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5568, 5569, 5570",
        "url": "https://sunnah.com/mishkat:5568"
      },
      "grade": "صَحِيحٌ, صَحِيح, صَحِيح (الألباني)"
    },
    {
      "id": 47,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ سَهْلِ بْنِ سَعْدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِنِّي فَرَطُكُمْ عَلَى الْحَوْضِ مَنْ مَرَّ عَلَيَّ شَرِبَ وَمَنْ شَرِبَ لَمْ يَظْمَأْ أَبَدًا لَيَرِدَنَّ عَلَيَّ أَقْوَامٌ أَعْرِفُهُمْ وَيَعْرِفُونَنِي ثُمَّ يُحَالُ بَيْنِي وَبَيْنَهُمْ فَأَقُولُ: إِنَّهُمْ مِنِّي. فَيُقَالُ: إِنَّكَ لَا تَدْرِي مَا أَحْدَثُوا بَعْدَكَ؟ فَأَقُولُ: سُحْقًا سحقاً لمن غير بعدِي \". مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Shal b. Sa'd reported God's messenger as saying, \"I shall go to the Pond before you; he who comes to me will drink, and he who drinks will never thirst. Folk whom I know and who know me will come down to me, but something will come between them and me. I shall say that they belong to me, but I shall be told that I do not know what innovations they have produced since I departed from them. I shall then say, `Destruction, destruction to those who have made changes since my departure'!\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5571",
        "url": "https://sunnah.com/mishkat:5571"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 48,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \" يُحْبَسُ الْمُؤْمِنُونَ يَوْمَ الْقِيَامَةِ حَتَّى يُهَمُّوا بِذَلِكَ فَيَقُولُونَ: لَوِ اسْتَشْفَعْنَا إِلَى رَبِّنَا فَيُرِيحَنَا مِنْ مَكَانِنَا فَيَأْتُونَ آدَمَ فَيَقُولُونَ: أَنْتَ آدَمُ أَبُو النَّاسِ خَلَقَكَ اللَّهُ بِيَدِهِ وَأَسْكَنَكَ جَنَّتَهُ وَأَسْجَدَ لَكَ مَلَائِكَتَهُ وَعَلَّمَكَ أَسْمَاءَ كُلِّ شَيْءٍ اشْفَعْ لَنَا عِنْدَ رَبِّكَ حَتَّى يُرِيحَنَا مِنْ مَكَانِنَا هَذَا. فَيَقُولُ: لَسْتُ هُنَاكُمْ. وَيَذْكُرُ خَطِيئَتَهُ الَّتِي أَصَابَ: أَكْلَهُ مِنَ الشَّجَرَةِ وَقَدْ نُهِيَ عَنْهَا - وَلَكِنِ ائْتُوا نُوحًا أَوَّلَ نَبِيٍّ بَعَثَهُ اللَّهُ إِلَى أَهْلِ الْأَرْضِ فَيَأْتُونَ نُوحًا فَيَقُولُ: لَسْتُ هُنَاكُمْ - وَيَذْكُرُ خَطِيئَتَهُ الَّتِي أَصَابَ: سُؤَالَهُ رَبَّهُ بِغَيْرِ عِلْمٍ - وَلَكِنِ ائْتُوا إِبْرَاهِيمَ خَلِيلَ الرَّحْمَنِ. قَالَ: فَيَأْتُونَ إِبْرَاهِيمَ فَيَقُولُ: إِنِّي لَسْتُ هُنَاكُمْ - وَيَذْكُرُ ثَلَاثَ كِذْبَاتٍ كَذَبَهُنَّ - وَلَكِنِ ائْتُوا مُوسَى عَبْدًا آتَاهُ اللَّهُ التَّوْرَاةَ وَكَلَّمَهُ وَقَرَّبَهُ نَجِيًّا. قَالَ: فَيَأْتُونَ مُوسَى فَيَقُولُ: إِنِّي لَسْتُ هُنَاكُمْ - وَيَذْكُرُ خَطِيئَتَهُ الَّتِي أَصَابَ قَتْلَهُ النَّفْسَ - وَلَكِنِ ائْتُوا عِيسَى عَبْدَ اللَّهِ وَرَسُولَهُ وَرُوحَ اللَّهِ وَكَلِمَتَهُ \" قَالَ: \" فَيَأْتُونَ عِيسَى فَيَقُولُ: لَسْتُ هُنَاكُمْ وَلَكِنِ ائْتُوا مُحَمَّدًا عبدا غفر اللَّهُ لَهُ ماتقدم مِنْ ذَنْبِهِ وَمَا تَأَخَّرَ \". قَالَ: \" فَيَأْتُونِي فَأَسْتَأْذِنُ عَلَى رَبِّي فِي دَارِهِ فَيُؤْذَنُ لِي عَلَيْهِ فَإِذَا رَأَيْتُهُ وَقَعْتُ سَاجِدًا فَيَدَعُنِي مَا شَاءَ اللَّهُ أَنْ يَدَعَنِي فَيَقُولُ: ارْفَعْ مُحَمَّدُ وَقُلْ تُسْمَعْ وَاشْفَعْ تُشَفَّعْ وَسَلْ تُعْطَهْ \". قَالَ: \" فَأَرْفَعُ رَأْسِي فأثني على رَبِّي بثناء تحميد يُعَلِّمُنِيهِ ثُمَّ أَشْفَعُ فَيَحُدُّ لِي حَدًّا فَأَخْرُجُ فَأُخْرِجُهُمْ مِنَ النَّارِ وَأُدْخِلُهُمُ الْجَنَّةَ ثُمَّ أَعُودُ الثَّانِيَةَ فَأَسْتَأْذِنُ عَلَى رَبِّي فِي دَارِهِ. فَيُؤْذَنُ لِي عَلَيْهِ فَإِذَا رَأَيْتُهُ وَقَعْتُ سَاجِدًا. فَيَدَعُنِي مَا شَاءَ اللَّهُ أَنْ يَدَعَنِي ثُمَّ يَقُولُ: ارْفَعْ مُحَمَّدُ وَقُلْ تُسْمَعْ وَاشْفَعْ تُشَفَّعْ وَسَلْ تُعْطَهْ. قَالَ: \" فَأَرْفَعُ رَأْسِي فَأُثْنِي عَلَى رَبِّي بِثَنَاءٍ وَتَحْمِيدٍ يُعَلِّمُنِيهِ ثُمَّ أَشْفَعُ فَيَحُدُّ لِي حَدًّا فَأَخْرُجُ فَأُخْرِجُهُمْ مِنَ النَّارِ وَأُدْخِلُهُمُ الْجَنَّةَ ثُمَّ أَعُودُ الثَّالِثَةَ فَأَسْتَأْذِنُ عَلَى رَبِّي فِي دَاره فيؤذي لِي عَلَيْهِ فَإِذَا رَأَيْتُهُ وَقَعْتُ سَاجِدًا فَيَدَعُنِي مَا شَاءَ اللَّهُ أَنْ يَدَعَنِي ثُمَّ يَقُولُ: ارْفَعْ مُحَمَّدُ وَقُلْ تُسْمَعْ وَاشْفَعْ تُشَفَّعْ وَسَلْ تُعْطَهْ \". قَالَ: «فَأَرْفَعُ رَأْسِي فَأُثْنِي عَلَى رَبِّي بثناءوتحميد يُعَلِّمُنِيهِ ثُمَّ أَشْفَعُ فَيَحُدُّ لِي حَدًّا فَأَخْرُجُ فَأُخْرِجُهُمْ مِنَ النَّارِ وَأُدْخِلُهُمُ الْجَنَّةَ حَتَّى مَا يَبْقَى فِي النَّارِ إِلَّا مَنْ قَدْ حَبَسَهُ الْقُرْآنُ» أَيْ وَجَبَ عَلَيْهِ الْخُلُودُ ثُمَّ تَلَا هَذِه الْآيَة (عَسى أَن يَبْعَثك الله مقَاما مَحْمُودًا)\nقَالَ: «وَهَذَا الْمقَام المحمود الَّذِي وعده نَبِيكُم» مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Anas reported the Prophet as saying, \"The believers will be restrained on the day of resurrection so that they will be concerned about that and express a desire to find an intercessor with their Lord that He may relieve them from the position in which they are placed. They will go to Adam and say, `You are Adam, the father of mankind, whom God created by His hand, whom He caused to dwell in His garden, to whom He made the angels do obeisance, and whom He taught the names of everything. Intercede for us with your Lord so that He may relieve us from this position in which we are placed.' But he, mentioning the sin he committed by eating of the tree when he had been forbidden to do so, will reply, `I am not in a position to do that for you; go to Noah, the first prophet God sent to the inhabitants of the earth.' They will then go to Noah and he, mentioning the sin he committed by making request of his Lord without knowledge,.\" He said, \"And this praiseworthy position is that which He promised your prophet.\" \n    Quran; 11:45 \n    Quran; 17:79\n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5572",
        "url": "https://sunnah.com/mishkat:5572"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 49,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِذَا كَانَ يَوْمُ الْقِيَامَةِ مَاجَ النَّاسُ بَعْضُهُمْ فِي بَعْضٍ فَيَأْتُونَ آدم فَيَقُولُونَ: اشفع لنا إِلَى رَبِّكَ فَيَقُولُ: لَسْتُ لَهَا وَلَكِنْ عَلَيْكُمْ بِإِبْرَاهِيمَ فَإِنَّهُ خَلِيلُ الرَّحْمَنِ فَيَأْتُونَ إِبْرَاهِيمَ فَيَقُولُ لَسْتُ لَهَا وَلَكِنْ عَلَيْكُمْ بِمُوسَى فَإِنَّهُ كَلِيمُ الله فَيَأْتُونَ مُوسَى فَيَقُولُ لَسْتُ لَهَا وَلَكِنْ عَلَيْكُمْ بِعِيسَى فَإِنَّهُ رُوحُ اللَّهِ وَكَلِمَتُهُ فَيَأْتُونَ عِيسَى فَيَقُولُ لَسْتُ لَهَا وَلَكِنْ عَلَيْكُمْ بِمُحَمَّدٍ فَيَأْتُونِّي فَأَقُولُ أَنَا لَهَا فَأَسْتَأْذِنُ عَلَى رَبِّي فَيُؤْذَنُ لِي وَيُلْهِمُنِي مَحَامِدَ أَحْمَدُهُ بِهَا لَا تَحْضُرُنِي الْآنَ فَأَحْمَدُهُ بِتِلْكَ الْمَحَامِدِ وَأَخِرُّ لَهُ سَاجِدًا فَيُقَالُ يَا مُحَمَّدُ ارْفَعْ رَأْسَكَ وَقُلْ تُسْمَعْ وَسَلْ تُعْطَهْ وَاشْفَعْ تشفع فَأَقُول يارب أُمَّتِي أُمَّتِي فَيُقَالُ انْطَلِقْ فَأَخْرِجْ مَنْ كَانَ فِي قَلْبِهِ مِثْقَالَ شَعِيرَةٍ مِنْ إِيمَانٍ فَأَنْطَلِقُ فأفعل ثمَّ أَعُود فأحمده بِتِلْكَ المحامدوأخر لَهُ سَاجِدًا فَيُقَالُ يَا مُحَمَّدُ ارْفَعْ رَأْسَكَ وَقُلْ تُسْمَعْ وَسَلْ تُعْطَهْ وَاشْفَعْ تُشَفَّعْ فَأَقُولُ يارب أُمَّتِي أُمَّتِي فَيُقَالُ انْطَلِقْ فَأَخْرِجْ مَنْ كَانَ فِي قَلْبِهِ مِثْقَالُ ذَرَّةٍ أَوْ خَرْدَلَةٍ مِنْ إِيمَانٍ فَأَنْطَلِقُ فَأَفْعَلُ ثُمَّ أَعُودُ فَأَحْمَدُهُ بِتِلْكَ المحامدوأخر لَهُ سَاجِدًا فَيُقَالُ يَا مُحَمَّدُ ارْفَعْ رَأْسَكَ وَقُلْ تُسْمَعْ وَسَلْ تُعْطَهْ وَاشْفَعْ تُشَفَّعْ فَأَقُولُ يارب أُمَّتِي أُمَّتِي فَيُقَالُ انْطَلِقْ فَأَخْرِجْ مَنْ كَانَ فِي قَلْبِهِ أَدْنَى أَدْنَى أَدْنَى مِثْقَالِ حَبَّةِ من خَرْدَلَةٍ مِنْ إِيمَانٍ فَأَخْرِجْهُ مِنَ النَّارِ فَأَنْطَلِقُ فأفعل ثمَّ أَعُود الرَّابِعَة فأحمده بِتِلْكَ المحامدوأخر لَهُ سَاجِدًا فَيُقَالُ يَا مُحَمَّدُ ارْفَعْ رَأْسَكَ وَقُلْ تُسْمَعْ وَسَلْ تُعْطَهْ وَاشْفَعْ تُشَفَّعْ فَأَقُولُ يارب ائْذَنْ لِي فِيمَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ قَالَ لَيْسَ ذَلِكَ لَكَ وَلَكِنْ وَعِزَّتِي وَجَلَالِي وَكِبْرِيَائِي وَعَظَمَتِي لَأُخْرِجَنَّ مِنْهَا مَنْ قَالَ لَا إِلَه إِلَّا الله \". مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"When the day of resurrection comes mankind will be in confusion and will go to Adam and say, `Intercede with your Lord,' and he will reply, `I am not capable, but go to Abraham, for he is the friend of the Compassionate One.' They will go to Abraham and he will say, `I am not capable, but go to Moses, for he is God's interlocutor.' They will then go to Moses and he will say, `I am not capable, but go to Jesus, for he is God's spirit and word.' They will then go to Jesus and he will say, `I am not capable, but go to Muhammad.' Then they will come to me and, saying I am capable, I shall ask permission to enter my Lord's presence. When this is granted He will teach me certain utterances of praise which I do not know at present, and I shall use them and fall down prostrating myself. Then will be said, `Raise your head, Muhammad. If you speak you will be listened to, if you make a request it will be granted, and if you make intercession it will be accepted.\" I shall then say, `0 my Lord, my people, my people,' and shall be told to go away and bring forth from hell those in whose hearts there is as much faith as a grain of barley. I shall go and do so, after which I shall return and use those utterances of praise, then fall down prostrating myself Then will be said, `Raise your head, Muhammad. If you speak you will be listened to, if you make a request it will be granted, and if you make intercession it will be accepted.' I shall then say, `0 my Lord, my people, my people,' and shall be told to go away and bring forth from hell those in whose hearts there is as much faith as a mote or a grain of mustard-seed. I shall go and do so, after which I shall return and use those utterances of praise, then fall down prostrating myself. Then will be said, `Raise your head, Muhammad. If you speak you will be listened to, if you make a request it will be granted, and if you make intercession it will be accepted.' I shall then say, `0 my Lord, my people, my people, and shall be told to go away and bring forth from hell those in whose hearts there is as much faith as the smallest smallest, smallest grain of mustard-seed. I shall go and do so, after which I shall return a fourth time and use those utterances of praise then fall down prostrating myself. Then will be said, `Raise your head, Muhammad. If you speak you will be listened to, if you make a request it will be granted, arid if you make intercession it will be accepted.' I shall then say, `0 my Lord, grant me permission regard - ing those who have said there is no god but God,' and He will reply, `You have no business with this, but by my might, glory, pride and greatness, I will certainly bring out of it those who have said there is no god but God'.\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5573",
        "url": "https://sunnah.com/mishkat:5573"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 50,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" أَسْعَدُ النَّاسِ بِشَفَاعَتِي يَوْمَ الْقِيَامَةِ مَنْ قَالَ: لَا إِلَهَ إِلَّا اللَّهُ خَالِصا من قلبه أونفسه \"\nرَوَاهُ البُخَارِيّ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported the Prophet as saying, \"The one who will be most fortunate by reason of my intercession on the day of resurrection will be the one who says there is no god but God sincerely from his heart,\" or, \"his soul.\" \n\nBukhari transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5574",
        "url": "https://sunnah.com/mishkat:5574"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 51,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ أَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِلَحْمٍ فَرُفِعَ إِلَيْهِ الذِّرَاعُ وَكَانَتْ تُعْجِبُهُ فَنَهَسَ مِنْهَا نَهْسَةً ثُمَّ قَالَ: «أَنَا سَيِّدُ النَّاسِ يَوْمَ الْقِيَامَةِ يَوْمَ يَقُومَ النَّاسُ لِرَبِّ الْعَالمين وتدنو الشَّمْس فَيبلغ مِنَ الْغَمِّ وَالْكَرْبِ مَا لَا يُطِيقُونَ فَيَقُولُ النَّاس أَلا تنْظرُون من يشفع لكم إِلَى ربكُم؟ فَيَأْتُونَ آدَمَ» . وَذَكَرَ حَدِيثَ الشَّفَاعَةِ وَقَالَ: «فَأَنْطَلِقُ فَآتِي تَحْتَ الْعَرْشِ فَأَقَعُ سَاجِدًا لِرَبِّي ثُمَّ يَفْتَحُ اللَّهُ عَلَيَّ مِنْ مَحَامِدِهِ وَحُسْنِ الثَّنَاءِ عَلَيْهِ شَيْئًا لَمْ يَفْتَحْهُ عَلَى أَحَدٍ قَبْلِي ثُمَّ قَالَ يَا مُحَمَّدُ\nارْفَعْ رَأْسَكَ وَسَلْ تُعْطَهْ وَاشْفَعْ تُشَفَّعْ فَأَرْفَعُ رَأْسِي فَأَقُولُ أُمَّتِي يارب أمتِي يارب فَيُقَالُ يَا مُحَمَّدُ أَدْخِلْ مِنْ أُمَّتِكَ مَنْ لَا حِسَابَ عَلَيْهِمْ مِنَ الْبَابِ الْأَيْمَنِ مِنْ أَبْوَابِ الْجَنَّةِ وَهُمْ شُرَكَاءُ النَّاسِ فِيمَا سِوَى ذَلِكَ مِنَ الْأَبْوَابِ» . ثُمَّ قَالَ: «وَالَّذِي نَفْسِي بِيَدِهِ إِنَّ مَا بَيْنَ الْمِصْرَاعَيْنِ مِنْ مَصَارِيعِ الْجَنَّةِ كَمَا بَيْنَ مَكَّةَ وَهَجَرَ» . مُتَّفَقٌ عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "He told that once when the Prophet was brought some meat and was offered the foreleg, which was a part he liked, he bit off a piece of it and then said, ``I shall be the lord of mankind on the day of resurrection, the day when mankind will stand up before the Lord of the universe and the sun will draw near. Mankind will then experience a degree of care and anxiety which they will be unable to bear, so they will ask one another whether they cannot see anyone who may intercede for them with their Lord and will go to Adam.\" He then mentioned the tradition about intercession and said, \"I shall then set off and come below the Throne and fall down prostrating myself before my Lord, and after God has revealed to me some utterances of His praise and of a worthy manner of extolling Him which He had not revealed to anyone before me He will say, `Raise your head, Muhammad. If you make a request, it will be granted, and if you make intercession, it will be accepted.' I shall then raise my head and say, `My people, O my Lord; my people, O my Lord; my people, O my Lord,' and the reply will be given, `Bring in by the right gate of paradise, Muhammad, those of your people who are not taken into account, though they may equally enter by other gates along with mankind'.\" He then said, \"By Him in whose hand my soul is, the distance between the two halves of the gates of paradise is like that between Mecca and Hajar.\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5575",
        "url": "https://sunnah.com/mishkat:5575"
      },
      "grade": "مُتَّفق عَلَيْهِ (الألباني)"
    },
    {
      "id": 52,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ حُذَيْفَةَ فِي حَدِيثِ الشَّفَاعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «وَتُرْسَلُ الْأَمَانَةُ وَالرَّحِمُ فَتَقُومَانِ جَنَبَتَيِ الصِّرَاطِ يَمِينًا وَشِمَالًا»\nرَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "In the tradition about intercession Hudhaifa reported God's messenger as saying, \"Fidelity and ties of relationship will be sent and will stand on the two sides of the path, right and left.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5576",
        "url": "https://sunnah.com/mishkat:5576"
      },
      "grade": null
    },
    {
      "id": 53,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ تَلَا قَوْلَ اللَّهِ تَعَالَى فِي إِبْرَاهِيمَ:  فَرَفَعَ يَدَيْهِ فَقَالَ «اللَّهُمَّ أُمَّتِي أُمَّتِي» . وَبَكَى فَقَالَ اللَّهُ تَعَالَى: «يَا جِبْرِيلُ اذْهَبْ إِلَى مُحَمَّدٍ وَرَبُّكَ أَعْلَمُ فَسَلْهُ مَا يُبْكِيهِ؟» . فَأَتَاهُ جِبْرِيلُ فَسَأَلَهُ فَأَخْبَرَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِمَا قَالَ فَقَالَ اللَّهُ لِجِبْرِيلَ اذْهَبْ إِلَى مُحَمَّدٍ فَقُلْ: إِنَّا سَنُرْضِيكَ فِي أمَّتك وَلَا نسوؤك \". رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "`Abdallah b. `Amr b. al- `As told that the Prophet recited the words of God most high in ,\" then, raising his hands, he said, \"0 God, my people, my people,\" and wept. God most high then said, \"Go to Muhammad, Gabriel although your Lord is best informed, and ask him what is making him weep.\" Gabriel then went to him and asked him, and God's messenger informed him of what he had said. God most high then said to Gabriel, \"Go to Muhammad and tell him that We shall please him and not grieve him concerning his people.\" \n1. Quran, 14:36. \n2. Quran, 5:118.\n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5577",
        "url": "https://sunnah.com/mishkat:5577"
      },
      "grade": null
    },
    {
      "id": 54,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ أَنَّ أُنَاسًا قَالُوا يَا رَسُولَ اللَّهِ هَلْ نَرَى رَبَّنَا يَوْمَ الْقِيَامَةِ؟ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «نَعَمْ هَلْ تُضَارُّونَ فِي رُؤْيَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ صَحْوًا لَيْسَ فِيهَا سَحَابٌ؟» قَالُوا: لَا يَا رَسُولَ اللَّهِ قَالَ: \" مَا تَضَارُّونَ فِي رُؤْيَةِ اللَّهِ يَوْمَ الْقِيَامَةِ إِلَّا كَمَا تُضَارُّونَ فِي رُؤْيَةِ أَحَدِهِمَا إِذَا كَانَ يَوْمُ الْقِيَامَةِ أَذَّنَ مُؤَذِّنٌ لِيَتَّبِعْ كُلُّ أُمَّةٍ مَا كَانَتْ تَعْبُدُ فَلَا يَبْقَى أَحَدٌ كَانَ يعبد غيرالله مِنَ الْأَصْنَامِ وَالْأَنْصَابِ إِلَّا يَتَسَاقَطُونَ فِي النَّارِ حَتَّى إِذَا لَمْ يَبْقَ إِلَّا مَنْ كَانَ يَعْبُدُ اللَّهَ مِنْ بَرٍّ وَفَاجِرٍ أَتَاهُمْ رَبُّ الْعَالَمِينَ قَالَ: فَمَاذَا تَنْظُرُونَ؟ يَتْبَعُ كُلُّ أُمَّةٍ مَا كَانَت تعبد. قَالُوا: ياربنا فَارَقْنَا النَّاسَ فِي الدُّنْيَا أَفْقَرَ مَا كُنَّا إِلَيْهِم وَلم نصاحبهم \"\nوَفِي رِوَايَةِ أَبِي هُرَيْرَةَ \" فَيَقُولُونَ: هَذَا مَكَانُنَا حَتَّى يَأْتِيَنَا رَبُّنَا فَإِذَا جَاءَ رَبُّنَا عَرَفْنَاهُ \"\nوَفِي رِوَايَةِ أَبِي سَعِيدٍ: \" فَيَقُولُ هَلْ بَيْنَكُمْ وَبَيْنَهُ آيَةٌ تَعْرِفُونَهُ؟ فَيَقُولُونَ: نَعَمْ فَيُكْشَفُ عَنْ سَاقٍ فَلَا يَبْقَى مَنْ كَانَ يَسْجُدُ لِلَّهِ مِنْ تِلْقَاءِ نَفْسِهِ إِلَّا أَذِنَ اللَّهُ لَهُ بِالسُّجُودِ وَلَا يَبْقَى مَنْ كَانَ يَسْجُدُ اتِّقَاءً وَرِيَاءً إِلَّا جَعَلَ اللَّهُ ظَهْرَهُ طَبَقَةً وَاحِدَةً كُلَّمَا أَرَادَ أَنْ يَسْجُدَ خَرَّ عَلَى قَفَاهُ ثُمَّ يُضْرَبُ الْجِسْرُ عَلَى جَهَنَّمَ وَتَحِلُّ الشَّفَاعَةُ وَيَقُولُونَ اللَّهُمَّ سَلِّمْ سَلِّمْ فَيَمُرُّ الْمُؤْمِنُونَ كَطَرَفِ الْعَيْنِ وَكَالْبَرْقِ وَكَالرِّيحِ وَكَالطَّيْرِ وَكَأَجَاوِيدِ الْخَيْلِ وَالرِّكَابِ فَنَاجٍ مُسَلَّمٌ وَمَخْدُوشٌ مُرْسَلٌ وَمَكْدُوسٌ فِي نَارِ جَهَنَّمَ حَتَّى إِذَا خَلَصَ الْمُؤْمِنُونَ مِنَ النَّارِ فَوَالَّذِي نَفْسِي بِيَدِهِ مَا مِنْ أحد مِنْكُم بأشدَّ مُناشدةً فِي الْحق - قد تبين لَكُمْ - مِنَ الْمُؤْمِنِينَ لِلَّهِ يَوْمَ الْقِيَامَةِ لِإِخْوَانِهِمُ الَّذِينَ فِي النَّارِ يَقُولُونَ رَبَّنَا كَانُوا يَصُومُونَ مَعَنَا وَيُصَلُّونَ وَيَحُجُّونَ فَيُقَالُ لَهُمْ: أَخْرِجُوا مَنْ عَرَفْتُمْ فَتُحَرَّمُ صُوَرَهُمْ عَلَى النَّارِ فَيُخْرِجُونَ خَلْقًا كَثِيرًا ثُمَّ يَقُولُونَ: رَبَّنَا مَا بَقِيَ فِيهَا أَحَدٌ مِمَّنْ أَمَرْتَنَا بِهِ. فَيَقُولُ: ارْجِعُوا فَمَنْ وجدْتُم فِي قلبه مِثْقَال دنيار مِنْ خَيْرٍ فَأَخْرِجُوهُ فَيُخْرِجُونَ خَلْقًا كَثِيرًا ثُمَّ يَقُولُ: ارْجِعُوا فَمَنْ وَجَدْتُمْ فِي قَلْبِهِ مِثْقَالَ نِصْفِ دِينَارٍ مِنْ خَيْرٍ فَأَخْرِجُوهُ فَيُخْرِجُونَ خَلْقًا كَثِيرًا ثُمَّ يَقُولُ: ارْجِعُوا فَمَنْ وَجَدْتُمْ فِي قَلْبِهِ مِثْقَالَ ذَرَّةٍ مِنْ خَيْرٍ فَأَخْرِجُوهُ فَيُخْرِجُونَ خَلْقًا كَثِيرًا ثُمَّ يَقُولُونَ: رَبَّنَا لَمْ نَذَرْ فِيهَا خَيِّرًا فَيَقُولُ اللَّهُ شُفِّعَتِ الْمَلَائِكَةُ وَشُفِّعَ النَّبِيُّونَ وَشُفِّعَ الْمُؤْمِنُونَ وَلَمْ يَبْقَ إِلَّا أَرْحَمُ الرَّاحِمِينَ فَيَقْبِضُ قَبْضَةً مِنَ النَّارِ فَيُخْرِجُ مِنْهَا قَوْمًا لَمْ يَعْمَلُوا خَيْرًا قَطُّ قَدْ عَادُوا حُمَمًا فَيُلْقِيهِمْ فِي نَهْرٍ فِي أَفْوَاهِ الْجَنَّةِ يُقَالُ لَهُ: نَهْرُ الْحَيَاةِ فَيَخْرُجُونَ كَمَا تَخْرُجُ الْحِبَّةُ فِي حَمِيلِ السَّيْلِ فَيَخْرُجُونَ كَاللُّؤْلُؤِ فِي رِقَابِهِمُ الْخَوَاتِمُ فَيَقُولُ أَهْلُ الْجَنَّةِ: هَؤُلَاءِ عُتَقَاءُ الرَّحْمَن أدخلهم الْجنَّة بِغَيْر عمل وَلَا خَيْرٍ قَدَّمُوهُ فَيُقَالُ لَهُمْ لَكُمْ مَا رَأَيْتُمْ وَمثله مَعَه \". مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Abu Sa'id al-Khudri told that when some people asked God's messenger whether they would see their Lord on the day of resurrection he replied, \"Yes. Do you disagree about seeing the sun at noonday when it is unconcealed and there are no clouds, or do you disagree about seeing the moon on the night when it is full when it is unconcealed and there are no clouds?\" On their replying that they did not, he said, \"You will not disagree about the vision of God on the day of resurrection any more than you do about seeing one of them. When the day of resurrection comes a mu'adhdhinwill cry, `Let every people follow what it was worshipping.' Then all who worshipped idols and stones apart from God will fall one after the other into hell, and when only the righteous and wicked who worshipped God are left the Lord of the universe will come to them and say, `What are you waiting for? Let every people follow what it was worshipping.' They will reply, `Our Lord, we kept separate from the people in the world though we felt great need of them, and did not associate with them.' (In Abu Huraira's version they will say, `This is our place till our Lord comes to us, and when our Lord comes to us we shall recognize Him.') In Abu Sa'id's version He will say, `Is there a sign between you and Him by which you will recognize Him? On their replying that there is, things will be made plain will say, `O God, keep safe, keep safe.' The believers will then pass over like the twinkling of an eye, like lightning, like wind, like a bird, like the finest horses and camels. Some will escape and be kept safe, some will be lacerated and let go, and some will be pushed into the fire of Jahannam. Then when the believers are safe from hell, I swear by Him in whose hand my soul is that none of you is more eager to claim a right when it has become clear to you than those who believe in God will be on the day of resurrection to make claims on behalf of their brethren who are in hell. They will say, `0 our Lord, they were fasting along with us, praying and performing pilgrimage, and will be told to bring out those they recognize. Their faces will be protected from the fire and they will bring forth a large number of people, then say, `O our Lord, not one of those about whom Thou didst give us command remains in it.' He will reply, `Go back and bring forth those in whose hearts you find as much as a dinar of good.' When they have brought forth a large number of people He will say, `Go back and bring forth those in whose hearts you find as much as half a dinar of good.' When they have brought forth a large number of people He will say, 'Go back and bring forth those in whose hearts you find as much as an atom of good.' When they have brought forth a large number of people they will say, `O our Lord, we have not left in it any good.' Then God will say, 'The angels have interceded, the prophets have interceded, the believers have interceded, and only the Most Merciful of the merciful ones remains.' He will then take a handful from hell, bring forth from it people who never did any good, who have been turned into charcoal and cast them into a river at the outskirts of paradise called the river of life. They will come out as a seed comes out from the rubbish carried away by a flood, and they will come forth like pearls with seals on their necks. The inhabitants of paradise will say, `Those are they who have been set free by the Compassionate One who has brought them into paradise without anything they have done or any good they have sent before them.' They will then be told that theirs is what they see and a like quantity along with it.\" \n    Quran, 48:42 The reference is either to the beginning of terrors, or to the end of all mystery. The second of the two meanings given seems to fit this passage.\n    Presumably the Prophets, but later in this tradition reference is made to intercession having been made by angels, prophets and believers. Abu Huraira's tradition however states that the messenger will say these words.\n   \n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5578, 5579",
        "url": "https://sunnah.com/mishkat:5578"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ, مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 55,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِذَا دَخَلَ أَهْلُ الْجَنَّةِ الْجَنَّةَ وَأَهْلُ النَّارِ النَّارَ يَقُولُ اللَّهُ تَعَالَى: مَنْ كَانَ فِي قَلْبِهِ مِثْقَالُ حَبَّةٍ مِنْ خَرْدَلٍ مِنْ إِيمَانٍ فَأَخْرِجُوهُ فَيَخْرُجُونَ قَدِ امْتَحَشُوا وَعَادُوا حُمَمًا فَيُلْقَوْنَ فِي نَهْرِ الْحَيَاةِ فَيَنْبُتُونَ كَمَا تَنْبُتُ الْحِبَّةُ فِي حَمِيلِ السَّيْلِ أَلَمْ تَرَوْا أَنَّهَا تَخْرُجُ صَفْرَاءَ مُلْتَوِيَةً \". مُتَّفَقٌ عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"When the inhabitants of paradise enter paradise and the inhabitants of hell enter hell God most high will say, `Bring forth those in whose hearts there is as much faith as a grain of mustard-seed.' They will then be brought forth burned and turned to charcoal and be cast into the river of life, and they will sprout as does a seed in the rubbish carried away by a flood. Have you not seen that it comes out yellow and twisted?\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5580",
        "url": "https://sunnah.com/mishkat:5580"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 56,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن أبي هُرَيْرَة أَنَّ النَّاسَ قَالُوا يَا رَسُولَ اللَّهِ هَلْ نَرَى رَبَّنَا يَوْمَ الْقِيَامَةِ؟ فَذَكَرَ مَعْنَى حَدِيثِ أَبِي سَعِيدٍ غَيْرَ كَشْفِ السَّاقِ وَقَالَ: \" يُضْرَبُ الصِّرَاطُ بَيْنَ ظَهْرَانَيْ جَهَنَّمَ فَأَكُونُ أَوَّلَ مَنْ يَجُوزُ مِنَ الرُّسُلِ بِأُمَّتِهِ وَلَا يَتَكَلَّمُ يَوْمَئِذٍ الرُّسُلُ وَكَلَامُ الرُّسُلِ يَوْمَئِذٍ: اللَّهُمَّ سَلِّمْ سَلِّمْ. وَفِي جهنمَ كلاليب مثلُ شوك السعدان وَلَا يَعْلَمُ قَدْرَ عِظَمِهَا إِلَّا اللَّهُ تَخْطَفُ النَّاسَ بِأَعْمَالِهِمْ فَمِنْهُمْ مَنْ يُوبَقُ بِعَمَلِهِ وَمِنْهُمْ مَنْ يُخَرْدَلُ ثُمَّ يَنْجُو حَتَّى إِذَا فَرَغَ اللَّهُ مِنَ الْقَضَاءِ بَيْنَ عِبَادِهِ وَأَرَادَ أَنْ يُخْرِجَ مِنَ النَّارِ مَنْ أَرَادَ أَنْ يُخْرِجَهُ مِمَّنْ كَانَ يَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ أَمر الْمَلَائِكَة أَن يخرجُوا من يَعْبُدُ اللَّهَ فَيُخْرِجُونَهُمْ وَيَعْرِفُونَهُمْ بِآثَارِ السُّجُودِ وَحَرَّمَ اللَّهُ تَعَالَى عَلَى النَّارِ أَنْ تَأْكُلَ أَثَرَ السُّجُودِ فَكُلُّ ابْنِ آدَمَ تَأْكُلُهُ النَّارُ إِلَّا أَثَرَ السُّجُودِ فَيَخْرُجُونَ مِنَ النَّارِ قَدِ امْتَحَشُوا فَيُصَبُّ عَلَيْهِمْ مَاءُ الْحَيَاةِ فَيَنْبُتُونَ كَمَا تَنْبُتُ الْحِبَّةُ فِي حَمِيلِ السَّيْلِ وَيَبْقَى رَجُلٌ بَيْنَ الجنَّةِ والنارِ وَهُوَ آخرُ أهلِ النارِ دُخولاً الْجَنَّةَ مُقْبِلٌ بِوَجْهِهِ قِبَلَ النَّارِ فَيَقُولُ: يَا رب اصرف وَجْهي عَن النَّار فَإِنَّهُ قد قَشَبَنِي رِيحُهَا وَأَحْرَقَنِي ذَكَاؤُهَا. فَيَقُولُ: هَلْ عَسَيْتَ إِنْ أَفْعَلْ ذَلِكَ أَنْ تَسْأَلَ غَيْرَ ذَلِكَ؟ فَيَقُول: وَلَا وعزَّتكَ فيُعطي اللَّهَ مَا شاءَ اللَّهُ مِنْ عَهْدٍ وَمِيثَاقٍ فَيَصْرِفُ اللَّهُ وَجْهَهُ عَنِ النارِ فإِذا أقبلَ بِهِ على الجنةِ وَرَأى بَهْجَتَهَا سَكَتَ مَا شَاءَ اللَّهُ أَنْ يَسْكُتَ ثُمَّ قَالَ: يَا رَبِّ قَدِّمْنِي عِنْدَ بَابِ الجنةِ فَيَقُول الله تبَارك وَتَعَالَى: الْيَسْ أَعْطَيْتَ الْعُهُودَ وَالْمِيثَاقَ أَنْ لَا تَسْأَلَ غَيْرَ الَّذِي كُنْتَ سَأَلْتَ. فَيَقُولُ: يَا رَبِّ لَا أَكُونُ أَشْقَى خَلْقِكَ. فَيَقُولُ: فَمَا عَسَيْتَ إِنْ أُعْطِيتُ ذَلِكَ أَنْ تَسْأَلَ غَيْرَهُ. فَيَقُولُ: لَا وَعِزَّتِكَ لَا أَسْأَلُكَ غَيْرَ ذَلِكَ فَيُعْطِي رَبَّهُ مَا شَاءَ مِنْ عَهْدٍ وَمِيثَاقٍ فَيُقَدِّمُهُ إِلَى بَابِ الْجَنَّةِ فَإِذَا بَلَغَ بَابَهَا فَرَأَى زَهْرَتَهَا وَمَا فِيهَا مِنَ النَّضْرَةِ وَالسُّرُورِ فَسَكَتَ مَا شَاءَ اللَّهُ أَنْ يَسْكُتَ فَيَقُولُ: يَا رَبِّ أَدْخِلْنِي الْجَنَّةَ فَيَقُولُ اللَّهُ تَبَارَكَ وَتَعَالَى: وَيْلَكَ يَا ابْنَ آدَمَ مَا أَغْدَرَكَ أَلَيْسَ قَدْ أَعْطَيْتَ الْعُهُودَ وَالْمِيثَاقَ أَنْ لَا تَسْأَلَ غَيْرَ الَّذِي أُعْطِيتَ. فَيَقُولُ: يَا رَبِّ لَا تَجْعَلْنِي أَشْقَى خَلْقِكَ فَلَا يَزَالُ يَدْعُو حَتَّى يَضْحَكَ اللَّهُ مِنْهُ فَإِذَا ضَحِكَ أَذِنَ لَهُ فِي دُخُولِ الْجَنَّةِ. فَيَقُولُ: تَمَنَّ فَيَتَمَنَّى حَتَّى إِذَا انْقَطَعَتْ أُمْنِيَّتُهُ قَالَ اللَّهُ تَعَالَى: تَمَنَّ مِنْ كَذَا وَكَذَا أَقْبَلَ يُذَكِّرُهُ رَبُّهُ حَتَّى إِذَا انْتَهَتْ بِهِ الْأَمَانِيُّ قَالَ اللَّهُ: لَكَ ذَلِكَ ومثلُه معَه \"\nوَفِي رِوَايَةِ أَبِي سَعِيدٍ: \" قَالَ اللَّهُ: لَكَ ذلكَ وعشرةُ أمثالِه \". مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira told that the people asked, \"Messenger of God, shall we see our Lord on the day of resurrection?\" and then mentioned something to the same general effect as Abu Sa'id's tradition, except for \"things will be made plain thorns whose size is known only to God, and they will seize people for their deeds, some being confined for what they have done and others being cut in small pieces and escaping. Then when God finishes judging His servants and desires to take out of hell such people as He pleases among those who testified that there is no god but God, He will command the angels to bring out those who worshipped God. They will do so, recognising them by the marks of prostration, God most high having prevented hell from devouring the mark of prostration, for hell will devour everything in the sons of Adam except the mark of prostration. They will come forth from hell having been burned, the water of life will be poured over them, and they will sprout as a seed does in the rubbish carried away by a flood. Bat a man who will be the last of the inhabitants of hell to enter paradise will remain between paradise and hell facing hell and will say, `0 my Lord, turn my face away from hell, for its odour has annoyed me and its fierce blaze has burned me; but God will reply, 'If I do that you will perhaps ask something else.' He will say, `No, by Thy might,' giving God such covenant and agreement as God wishes, and He will turn his face away from hell. When he is turned to face paradise and sees its beauty, he will remain silent as long as God wishes him to remain so, and will then say, 'O my Lord, bring me forward to the gate of paradise.' God who is blessed and exalted will reply, `Did you not give covenants and agreement that you would not ask anything beside what you have asked?' and he will say, `O my Lord, let me not be made the most miserable of Thy creatures.' He will ask, `What else are you likely to ask for if you are granted that?' and he will reply, `No, by Thy might, I shall ask nothing else.' He will then give his Lord such covenant and agreement as He wishes, and He will bring him forward to the gate of paradise. Then when he reaches its gate and sees its freshness and the splendour and joy it contains, he will remain silent as long as God wishes him to remain so, and will then say, `O my Lord, bring me into paradise.' God who is blessed and exalted will reply, `Woe to you, son of Adam, how treacherous you are! Have you not given covenants and agreement that you would not ask anything more than you have been granted?' and he will say, `O my Lord, do not make me the most miserable of Thy creatures.' He will continue making supplication till God laughs at him, and when He does so He will give him permission to enter paradise, and will say, `State your wish.' When he has done so till his wishing has come to an end God most high will say, `State your wish from such and such,' his Lord mentioning the matters to him. Then when there is nothing more he can wish God will say, `You can have that and a similar amount along with it'.\" In Abu Sa'id's version God says, \"You can have that and ten times as much.\" \n    i.e., they will have everything as far as their eyes can see. \n    The name of a plant with a prickly head on which camels pasture.\n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5581",
        "url": "https://sunnah.com/mishkat:5581"
      },
      "grade": "متفّق عَلَيْهِ (الألباني)"
    },
    {
      "id": 57,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنِ ابْنِ مَسْعُودٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \" آخِرُ مَنْ يَدْخُلُ الْجَنَّةَ رَجُلٌ يَمْشِي مَرَّةً وَيَكْبُو مَرَّةً وَتَسْفَعُهُ النارُ مرّة فإِذا جاؤوها الْتَفَتَ إِلَيْهَا فَقَالَ: تَبَارَكَ الَّذِي نَجَّانِي مِنْكِ لَقَدْ أَعْطَانِي اللَّهُ شَيْئًا مَا أَعْطَاهُ أَحَدًا مِنَ الْأَوَّلِينَ وَالْآخِرِينَ فَتُرْفَعُ لَهُ شَجَرَةٌ فَيَقُولُ: أَيْ رَبِّ أَدْنِنِي مِنْ هَذِهِ الشَّجَرَةِ فَلْأَسْتَظِلَّ بِظِلِّهَا وَأَشْرَبَ مِنْ مَائِهَا فَيَقُولُ اللَّهُ: يَا ابْنَ آدَمَ لَعَلِّي إِنْ أَعْطَيْتُكَهَا سَأَلْتَنِي غَيْرَهَا؟ فَيَقُولُ: لَا يَا رَبِّ وَيُعَاهِدُهُ أَنْ لَا يَسْأَلَهُ غَيْرَهَا وَرَبُّهُ يَعْذُرُهُ لِأَنَّهُ يَرَى مَا لَا صَبْرَ لَهُ عَلَيْهِ فَيُدْنِيهِ مِنْهَا فَيَسْتَظِلُّ بِظِلِّهَا وَيَشْرَبُ مِنْ مَائِهَا ثُمَّ تُرْفَعُ لَهُ شَجَرَةٌ هِيَ أَحْسَنُ مِنَ الْأُولَى فَيَقُولُ: أَيْ رَبِّ أَدْنِنِي مِنْ هَذِهِ الشَّجَرَةِ لِأَشْرَبَ مِنْ مَائِهَا وَأَسْتَظِلَّ بِظِلِّهَا لَا أَسْأَلُكَ غَيْرَهَا. فَيَقُولُ: يَا ابْنَ آدَمَ أَلَمْ تُعَاهِدْنِي أَنْ لَا تَسْأَلَنِي غَيْرَهَا؟ فَيَقُولُ: لَعَلِّي إِنْ أَدْنَيْتُكَ مِنْهَا تَسْأَلُنِي غَيْرَهَا؟ فَيُعَاهِدُهُ أَنْ لَا يَسْأَلَهُ غَيْرَهَا وَرَبُّهُ يَعْذُرُهُ لِأَنَّهُ يَرَى مَا لَا صَبْرَ لَهُ عَلَيْهِ فَيُدْنِيهِ مِنْهَا فَيَسْتَظِلُّ بِظِلِّهَا وَيَشْرَبُ مِنْ مَائِهَا ثُمَّ تُرْفَعُ لَهُ شَجَرَةٌ عِنْدَ بَابِ الْجَنَّةِ هِيَ أَحْسَنُ مِنَ الْأُولَيَيْنِ فَيَقُولُ: أَيْ رَبِّ أَدْنِنِي مِنْ هَذِهِ فَلِأَسْتَظِلَّ بِظِلِّهَا وَأَشْرَبَ مِنْ مَائِهَا لَا أَسْأَلُكَ غَيْرَهَا. فَيَقُولُ: يَا ابْنَ آدَمَ أَلَمْ تُعَاهِدْنِي أَنْ لَا تَسْأَلَنِي غَيْرَهَا؟ قَالَ: بَلَى يَا رَبِّ هَذِهِ لَا أَسْأَلُكَ غَيْرَهَا وَرَبُّهُ يَعْذُرُهُ لِأَنَّهُ يَرَى مَا لَا صَبْرَ لَهُ عَلَيْهِ فَيُدْنِيهِ مِنْهَا فَإِذَا أَدْنَاهُ مِنْهَا سَمِعَ أَصْوَاتَ أَهْلِ الْجَنَّةِ فيقولُ: أَي رَبِّ أَدْخِلْنِيهَا فَيَقُولُ: يَا ابْنَ آدَمَ مَا يصريني مِنْك؟ أيرضيك أَن أُعْطِيك الدُّنْيَا وَمِثْلَهَا مَعَهَا. قَالَ: أَيْ رَبِّ أَتَسْتَهْزِئُ مِنِّي وَأَنْتَ رَبُّ الْعَالَمِينَ؟ فَضَحِكَ ابْنُ مَسْعُودٍ فَقَالَ: أَلا تسألونيّ ممَّ أضْحك؟ فَقَالُوا: مِم تضحك؟ فَقَالَ: هَكَذَا ضَحِكَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. فَقَالُوا: مِمَّ تَضْحَكُ يَا رَسُولَ اللَّهِ؟ قَالَ: \" من ضحك رَبُّ الْعَالَمِينَ؟ فَيَقُولُ: إِنِّي لَا أَسْتَهْزِئُ مِنْكَ وَلَكِنِّي على مَا أَشَاء قدير \". رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Ibn Mas'ud reported God's messenger as saying, \"The last to enter paradise will be a man who will walk at one moment, stumble at another, and be burned by hell at another. Then when he gets beyond it he will turn to it and say, `Blessed is He who has saved me from you. God has given me something He has not given to anyone of those in earlier or later times. His attention will then be drawn to a tree and he will say, `O my Lord, bring me near this tree so that I may shelter in its shade and drink some of its water.' God will reply, `Son of Adam, if I grant you that you will perhaps ask me for something else,' and he will say, `No, my Lord' and make a covenant with Him not to ask Him for anything else. His Lord will excuse him because he is seeing something he cannot help desiring, so He will bring him near it and he will shelter in its shade and drink some of its water. His attention will then be drawn to a tree more beautiful than the first and he will say, `O my Lord, bring me near this tree in order that I may drink some of its water and shelter in its shade. I shall not ask Thee for anything else.' He will reply, `Son of Adam, did you not covenant with me not to ask anything else?' and He will add, `If I bring you near it you will perhaps ask me for something else.' He will then covenant with Him not to ask for anything else, and his Lord will excuse him because he is seeing something he cannot help desiring, so He will bring him near it and he will shelter in its shade and drink some of its water. His attention will then be drawn to a tree at the gate of paradise more beautiful than the first two and he will say, `O my Lord, bring me near this tree so that I may shelter in its shade and drink some of its water, and I shall not ask Thee for anything else.' He will reply, `Son of Adam, did you not covenant with me not to ask me for anything else?' and he will say, `Certainly, my Lord, but I shall not ask Thee for anything else than this.' So his Lord will excuse him because he is seeing something he cannot help desiring and will bring him near it; but when He does so he will hear the voices of the inhabitants of paradise and say, `0 my Lord, bring me into it.' He will reply, `Son of Adam, what will bring an end to your making requests of me? Will it please you if I give you the world and a like amount along with it?' He will `say, '0 my Lord, art Thou mocking me when Thou art the Lord of the universe?'\" Ibn Mas'ud then laughed and asked his hearers why they did not ask him what he was laughing at. On their doing so he told them that God's messenger had laughed similarly, and when he was asked what he was laughing at he said, \"At the Lord of the universe laughing when he said, `Art Thou mocking me when Thou art the Lord of the universe?' He will reply, `I am not mocking you, but I have power to do whatever I will'.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5582",
        "url": "https://sunnah.com/mishkat:5582"
      },
      "grade": null
    },
    {
      "id": 58,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَفِي رِوَايَة لَهُ عَن أبي سعيدٍ نَحْوَهُ إِلَّا أَنَّهُ لَمْ يَذْكُرْ \" فَيَقُولُ: يَا ابْنَ آدَمَ مَا يَصْرِينِي مِنْكَ؟ \" إِلَى آخِرِ الْحَدِيثِ وَزَادَ فِيهِ: \" وَيَذْكُرُهُ اللَّهُ: سَلْ كَذَا وَكَذَا حَتَّى إِذَا انْقَطَعَتْ بِهِ الْأَمَانِيُّ قَالَ اللَّهُ: هُوَ لَكَ وَعَشَرَةُ أَمْثَالِهِ قَالَ: ثُمَّ يَدْخُلُ بَيْتَهُ فَتَدْخُلُ عَلَيْهِ زَوْجَتَاهُ مِنَ الْحُورِ الْعِينِ فَيَقُولَانِ: الْحَمْدُ لِلَّهِ الَّذِي أَحْيَاكَ لَنَا وَأَحْيَانَا لَكَ. قَالَ: فَيَقُولُ: مَا أَعْطَى أَحَدٌ مثلَ مَا أَعْطَيْت \"",
      "english": {
        "narrator": "",
        "text": "In a version by him on the authority of Abu Sa'id there is something to the same effect, but he did not mention that He will say, \"What will bring an end to your making requests of me ...\" to the end of the tradition. In it he added that God will teach him saying, \"Ask such and such,\" and when his wishes come to an end God most high will say, \"You can have it and ten times as much.\" He said that he will then enter his house and his two wives from the large-eyed maidens will come in to him and say, \"Praise be to God who has created you for us and us for you.\" He will then say, \"No one has been given anything like what I have.\""
      },
      "reference": {
        "text": "Mishkat al-Masabih 5583",
        "url": "https://sunnah.com/mishkat:5583"
      },
      "grade": null
    },
    {
      "id": 59,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن أنس أَن النَّبِي الله صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" لَيُصِيبَنَّ أَقْوَامًا سَفْعٌ مِنَ النَّارِ بِذُنُوبٍ أَصَابُوهَا عُقُوبَةً ثُمَّ يُدْخِلُهُمُ اللَّهُ الْجَنَّةَ بِفَضْلِهِ وَرَحْمَتِهِ فَيُقَالُ لَهُمُ: الجهنميون \". رَوَاهُ البُخَارِيّ",
      "english": {
        "narrator": "Anas reported the Prophet as saying:",
        "text": "\"Peoples will be smitten with a scorching from hell as a punishment for sins they have committed, then God by His grace and mercy will bring them into paradise, and they will be called the Jahannamis.\" \n\nBukhari transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5584",
        "url": "https://sunnah.com/mishkat:5584"
      },
      "grade": null
    },
    {
      "id": 60,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ\nعِمْرَانَ بْنِ حُصَيْنٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَخْرُجُ أَقْوَامٌ مِنَ النَّارِ بِشَفَاعَةِ مُحَمَّدٍ فَيَدْخُلُونَ الْجَنَّةَ وَيُسَمَّوْنَ الْجَهَنَّمِيِّينَ» . رَوَاهُ الْبُخَارِيُّ\nوَفِي رِوَايَةٍ: «يَخْرُجُ قَوْمٌ مِنْ أُمَّتِي مِنَ النَّارِ بِشَفَاعَتِي يُسَمَّوْنَ الْجَهَنَّمِيِّينَ»",
      "english": {
        "narrator": "",
        "text": "`Imran b. Husain reported God's messenger as saying, \"People will come forth from hell by Muhammad's intercession, will enter paradise and be named the Jahannamis.\" \n\nBukhari transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5585",
        "url": "https://sunnah.com/mishkat:5585"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 61,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِنِّي لَأَعْلَمُ آخِرَ أَهْلِ النَّارِ خُرُوجًا مِنْهَا وَآخِرَ أَهْلِ الْجَنَّةِ دُخُولًا رَجُلٌ يَخْرُجُ مِنَ النَّارِ حَبْوًا. فَيَقُولُ اللَّهُ: اذْهَبْ فَادْخُلِ الْجَنَّةَ فَإِنَّ لَكَ مِثْلَ الدُّنْيَا وَعَشَرَةَ أَمْثَالِهَا. فَيَقُولُ: أَتَسْخَرُ مِنِّي - أَوْ تَضْحَكُ مِنِّي - وَأَنْتَ الْمَلِكُ؟ \" وَلَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُ وَكَانَ يُقَالُ: ذَلِكَ أَدْنَى أَهْلِ الْجَنَّةِ مَنْزِلَةً. مُتَّفَقٌ عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "A version has \"Some of my people will come forth from hell by my intercession and be named the Jahannam is.\" `Abdallah b. Mas'ud reported God's messenger as saying, \" I know the last of the inhabitants of hell to come out of it and the last of the inhabitants of paradise to enter. He is a man who will come crawling out of hell and God will say, `Go and enter paradise.' When he comes to it he will be made to think it is full, so he will say, `O my Lord, I have found it full.' God will reply, `Go and enter paradise, for you will have the equivalent of the world and ten times as much.' He will say, `Art Thou making fun of me?' or `Art Thou laughing at me when Thou art the King?' \"He told he had seen God's messenger laughing to such an extent that his back teeth were visible. It was said that that was the inhabitant of paradise who would have the lowest rank. \n\n(Bukhari and Muslim,)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5586",
        "url": "https://sunnah.com/mishkat:5586"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 62,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي ذَرٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِنِّي لَأَعْلَمُ آخِرَ أَهْلِ الْجَنَّةِ دُخُولًا الْجَنَّةَ وَآخِرَ أَهْلِ النَّارِ خُرُوجًا مِنْهَا رَجُلٌ يُؤْتَى بِهِ يَوْمَ الْقِيَامَةِ فَيُقَالُ: اعْرِضُوا عَلَيْهِ صِغَارَ ذُنُوبِهِ وَارْفَعُوا عَنْهُ كِبَارهَا فتعرض عَلَيْهِ صغَار ذنُوبه وفيقال: عملت يَوْم كَذَا وَكَذَا وَكَذَا وَكَذَا وَعَمِلْتَ يَوْمَ كَذَا وَكَذَا كَذَا وَكَذَا؟ فَيَقُولُ: نَعَمْ. لَا يَسْتَطِيعُ أَنْ يُنْكِرَ وَهُوَ مُشْفِقٌ مِنْ كِبَارِ ذُنُوبِهِ أَنْ تُعْرَضَ عَلَيْهِ. فَيُقَالُ لَهُ فَإِنَّ لَكَ مَكَانَ كُلِّ سَيِّئَةٍ حَسَنَةً. فَيَقُولُ: رَبِّ قَدْ عَمِلْتُ أَشْيَاءَ لَا أَرَاهَا هَهُنَا \" وَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُ. رَوَاهُ مُسْلِمٌ",
      "english": {
        "narrator": "",
        "text": "Abu Dharr reported God's messenger as saying, \"I know the last of the inhabitants of paradise to enter it and the last of the inhabitants of hell to come out of it. He is a man who will be brought on the day of resurrection and then a command will be given to confront him with his small sins and remove from him his serious sins. He will then be confronted with his small sins and told, `On such and such a day you did such and such, and on such and such a day \"you did such and such.' He will agree, being unable to deny it, and he will be afraid that he will be confronted with his serious sins. He will be told that in place of every evil deed he will have a good deed, and he will say, `My Lord, I have done things I do not see here'.\" He said he had seen God's messenger laughing to such ail extent that his back teeth were visible. \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5587",
        "url": "https://sunnah.com/mishkat:5587"
      },
      "grade": null
    },
    {
      "id": 63,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" يَخْرُجُ مِنَ النَّارِ أَرْبَعَةٌ فَيُعْرَضُونَ عَلَى اللَّهِ ثُمَّ يُؤْمَرُ بِهِمْ إِلَى النَّارِ فَيَلْتَفِتُ أَحَدُهُمْ فَيَقُولُ: أَيْ رَبِّ؟ لَقَدْ كنتُ أَرْجُو إِذا أَخْرَجْتَنِي مِنْهَا أَنْ لَا تُعِيدَنِي فِيهَا \" قَالَ: «فينجيه الله مِنْهَا» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Anas reported God's messenger as saying, \"Four men will be taken out of hell and presented before God. Command will then be given that they should be sent to hell, but one of them will turn and say, 0 my Lord, I was hoping that when Thou tookest me out of it Thou wouldest not send me back into it.' ' God will then save him from it.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5588",
        "url": "https://sunnah.com/mishkat:5588"
      },
      "grade": null
    },
    {
      "id": 64,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي سَعِيدٍ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَخْلُصُ الْمُؤْمِنُونَ مِنَ النَّارِ فَيُحْبَسُونَ عَلَى قَنْطَرَةٍ بَيْنَ الْجَنَّةِ وَالنَّارِ فَيُقْتَصُّ لِبَعْضِهِمْ مِنْ بَعْضٍ مَظَالِمُ كَانَتْ بَيْنَهُمْ فِي الدُّنْيَا حَتَّى إِذَا هُذِّبُوا وَنُقُّوا أُذِنَ لَهُمْ فِي دُخُولِ الْجَنَّةِ فَوَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَأَحَدُهُمْ أَهْدَى بِمَنْزِلِهِ فِي الْجَنَّةِ مِنْهُ بِمَنْزِلِهِ كَانَ لَهُ فِي الدُّنْيَا» . رَوَاهُ البُخَارِيّ",
      "english": {
        "narrator": "",
        "text": "Abu Sa'id reported God's messenger as saying, \"The believers will be rescued from hell and restrained at a bridge between paradise and hell. Retaliation will be taken from some for others for wrongs done among them in the world, and when they have been cleansed and purified permission will be granted them to enter paradise. By Him in whose hand Muhammad's soul is, one of them shall find the way more easily to his dwelling in paradise than he did to his dwelling which he owned in the world.\"\n\nBukhari transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5589",
        "url": "https://sunnah.com/mishkat:5589"
      },
      "grade": null
    },
    {
      "id": 65,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَدْخُلُ أَحَدٌ الْجَنَّةَ إِلَّا أُرِيَ مَقْعَدَهُ مِنَ النَّارِ لَوْ أَسَاءَ لِيَزْدَادَ شُكْرًا وَلَا يَدْخُلُ النَّارَ أَحَدٌ إِلَّا أُرِيَ مَقْعَدَهُ مِنَ الْجَنَّةِ لَوْ أَحْسَنَ ليَكُون عَلَيْهِ حسرة» . رَوَاهُ البُخَارِيّ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported God's messenger as saying, \"No one will enter paradise without being shown his place in hell, which will cause him all the more gratitude if he has done evil, and no one will enter hell without being shown his place in paradise, which will be a cause of grief to him if he has done good.\" \n\nBukhari transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5590",
        "url": "https://sunnah.com/mishkat:5590"
      },
      "grade": null
    },
    {
      "id": 66,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِذَا صَارَ أَهْلُ الْجَنَّةِ إِلَى الْجَنَّةِ وَأَهْلُ النَّارِ إِلَى النَّارِ جِيءَ بِالْمَوْتِ حَتَّى يُجْعَلَ بَيْنَ الْجَنَّةِ وَالنَّارِ ثُمَّ يُذْبَحَ ثُمَّ يُنَادِي مُنَادٍ: يَا أَهْلَ الْجَنَّةِ لَا مَوْتَ وَيَا أَهْلَ النَّارِ لَا مَوْتَ. فَيَزْدَادُ أَهْلُ الْجَنَّةِ فَرَحًا إِلَى فَرَحِهِمْ وَيَزْدَادُ أَهْلُ النَّارِ حُزْنًا إِلَى حزنهمْ \". مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Ibn `Umar reported God's messenger as saying, \"When the inhabitants of paradise come to paradise and the inhabitants of hell come to hell, death will be brought and placed between paradise and hell, then slain. A crier will call, `Inhabitants of paradise, there is no death, and inhabitants of hell, there is no death.' This will add joy to the joy of the inhabitants of paradise and grief to the grief of the inhabitants of hell.\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5591",
        "url": "https://sunnah.com/mishkat:5591"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 67,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "عَن ثَوْبَانَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «حَوْضِي مِنْ عَدَنٍ إِلَى عُمَّانَ الْبَلْقَاءِ مَاؤُهُ أَشَدُّ بَيَاضًا مِنَ اللَّبَنِ وَأَحْلَى مِنَ الْعَسَلِ وَأَكْوَابُهُ عَدَدُ نُجُومِ السَّمَاءِ مَنْ شَرِبَ مِنْهُ شَرْبَةً لَمْ يَظْمَأْ بَعْدَهَا أَبَدًا أَوَّلُ النَّاسِ وُروداً فقراءُ المهاجرينَ الشُّعثُ رؤوساً الدُّنْسُ ثِيَابًا الَّذِينَ لَا يَنْكِحُونَ الْمُتَنَعِّمَاتِ وَلَا يُفْتَحُ لَهُمُ السُّدَدُ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ وَابْنُ مَاجَهْ. وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيثٌ غَرِيبٌ",
      "english": {
        "narrator": "",
        "text": "Thauban reported the Prophet as saying, \"My pond is like the distance between Aden and 'Amman in al-Balqa'. Its water is whiter than milk and sweeter than honey, and its cups are as numerous as the \nstars in the sky. He who takes one drink of it will never thirst thereafter. The first to come down to it will be the poor emigrants, those with dishevelled heads and dirty clothes who do not marry delicate women and do not have doors opened for them .\" \n*'Amman, capital of the modern state of Jordan, is farther from Aden than Aila mentioned in the corresponding tradition.\n\nAhmad, Tirmidhi and Ibn Majah transmitted it, Tirmidhi saying this is a gharib tradition."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5592",
        "url": "https://sunnah.com/mishkat:5592"
      },
      "grade": null
    },
    {
      "id": 68,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ زَيْدِ بْنِ أَرْقَمَ قَالَ: كُنَّا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَزَلْنَا منزلا فَقَالَ: «مَا أَنْتُمْ جُزْءٌ مِنْ مِائَةِ أَلْفِ جُزْءٍ مِمَّنْ يَرِدُ عَلَى الْحَوْضِ» . قِيلَ: كَمْ كُنْتُمْ يَوْمَئِذٍ؟ قَالَ: سَبْعَمِائَةٍ أَوْ ثَمَانِمِائَةٍ. رَوَاهُ أَبُو دَاوُد",
      "english": {
        "narrator": "",
        "text": "Zaid b. Aqram told that when they were with God's messenger he said when they arrived at a halting place, \"You are not a hundred thousandth part of those who will come down to the pond.\" He was asked what their number was that day and replied that it was seven or eight hundred. \n\nAbu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5593",
        "url": "https://sunnah.com/mishkat:5593"
      },
      "grade": null
    },
    {
      "id": 69,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن سَمُرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ لِكُلِّ نَبِيٍّ حَوْضًا وَإِنَّهُمْ لَيَتَبَاهَوْنَ أَيُّهُمْ أَكْثَرُ وَارِدَةً وَإِنِّي لَأَرْجُو أَنْ أَكُونَ أَكْثَرَهُمْ وَارِدَةً» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيب",
      "english": {
        "narrator": "",
        "text": "Samura reported God's messenger as saying, \"Every prophet has a pond and they will vie with one another about which of them will have the largest number coming down to it. I hope that I may have the largest number.\" \n*Samura b. Jundub.\n\nTirmidhi transmitted it, saying this is a gharib tradition."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5594",
        "url": "https://sunnah.com/mishkat:5594"
      },
      "grade": null
    },
    {
      "id": 70,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن أنس قا ل سَأَلْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنْ يَشْفَعَ لِي يَوْمَ الْقِيَامَةِ فَقَالَ: «أَنَا فَاعِلٌ» . قُلْتُ يَا رَسُولَ اللَّهِ فَأَيْنَ أَطْلُبُكَ؟ قَالَ اطْلُبْنِي أَوَّلَ مَا تَطْلُبُنِي عَلَى الصِّرَاطِ \". قُلْتُ فَإِنْ لَمْ أَلْقَكَ عَلَى الصِّرَاطِ؟ قَالَ: «فَاطْلُبْنِي عِنْدَ الْمِيزَانِ» قُلْتُ فَإِنْ لَمْ أَلْقَكَ عِنْدَ الْمِيزَانِ؟ قَالَ: «فَاطْلُبْنِي عِنْدَ الْحَوْضِ فَإِنِّي لَا أُخطىءُ هَذِه الثلاثَ المواطن» رَوَاهُ التِّرْمِذِيّ وقا لهَذَا حَدِيث غَرِيب",
      "english": {
        "narrator": "",
        "text": "Anas told that he asked the Prophet to intercede for him on the day of resurrection, and when he replied that he would do so he asked God's messenger where he should look for him. He replied, \"Look for me first at the Path.\" He asked, \"Supposing I do not find you at the Path?\" and received the reply, \"Look for me at the scale.\" He asked, \"Supposing I do not find you at the scale?\" and received the reply, \"Look for me at the pond, for I shall not go beyond these three places.\" \n\nTirmidhi transmitted it, saying this is a gharib tradition."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5595",
        "url": "https://sunnah.com/mishkat:5595"
      },
      "grade": "إِسْنَاده جيد (الألباني)"
    },
    {
      "id": 71,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنِ ابْنِ مَسْعُودٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قا ل: قيل لَهُ مَا الْمقَام الْمَحْمُود؟ قا ل: \n\" ذَلِكَ يَوْمَ يَنْزِلُ اللَّهُ تَعَالَى عَلَى كُرْسِيِّهِ فَيَئِطُّ كَمَا يئطُّ الرحلُ الْجَدِيد من تضايقه بِهِ وَهُوَ كَسَعَةِ مَا بَيْنَ السَّمَاءِ وَالْأَرْضِ وَيُجَاءُ بِكُمْ حُفَاةً عُرَاةً غُرْلًا فَيَكُونُ أَوَّلُ مَنْ يُكْسَى إِبراهيم يَقُول الله تَعَالَى: أُكسوا خليلي بِرَيْطَتَيْنِ بَيْضَاوَيْنِ مِنْ رِيَاطِ الْجَنَّةِ ثُمَّ أُكْسَى عَلَى أَثَرِهِ ثُمَّ أَقُومُ عَنْ يَمِينِ اللَّهِ مقَاما يغبطني الْأَولونَ وَالْآخرُونَ \". رَوَاهُ الدَّارمِيّ",
      "english": {
        "narrator": "",
        "text": "Ibn Mas'ud told that when the Prophet was asked the meaning of the praiseworthy station he replied, \"That will be on the day when God will descend on to His throne and it, whose extent is as great as the distance between heaven and earth, will creak like a new pack-saddle owing to its being compressed. You will then be brought barefoot, naked and uncircumcised, and the first to be clothed will be Abraham. God most high will say, `Clothe my friend,' and two white seamless garments of paradise will be brought. I shall then be clothed after him and shall stand in a place a t God's right hand for which those of earliest and latest times will envy me.\" \n*Quran, 17:97.\n\nDarimi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5596",
        "url": "https://sunnah.com/mishkat:5596"
      },
      "grade": null
    },
    {
      "id": 72,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن الْمُغيرَة بن شُعْبَة قا ل: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ شِعَارُ الْمُؤْمِنِينَ يَوْمَ الْقِيَامَةِ عَلَى الصِّرَاطِ: رَبِّ سَلِّمْ سَلِّمْ \". رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيب",
      "english": {
        "narrator": "",
        "text": "Al-Mughira b. Shu'ba reported God's messenger as saying, \"On the day of resurrection the distinguishing sign of the believers on the Path will be, `My Lord, keep safe, keep safe'.\" \n\nTirmidhi transmitted it, saying this is a gharib tradition."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5597",
        "url": "https://sunnah.com/mishkat:5597"
      },
      "grade": null
    },
    {
      "id": 73,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَنَسٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قا ل: «شَفَاعَتِي لِأَهْلِ الْكَبَائِرِ مِنْ أُمَّتِي» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد\nوَرَوَاهُ ابْن مَاجَه عَن جَابر",
      "english": {
        "narrator": "",
        "text": "Anas reported the Prophet as saying, \"My intercession will be for those of my people who have committed major sins.\" \n\nTirmidhi and Abu Dawud transmitted it, and Ibn Majah transmitted it on Jabir's authority."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5598, 5599",
        "url": "https://sunnah.com/mishkat:5598"
      },
      "grade": null
    },
    {
      "id": 74,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ عَوْفِ بْنِ مَالِكٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَتَانِي آتٍ مِنْ عِنْدِ رَبِّي فَخَيَّرَنِي بَيْنَ أَنْ يُدْخِلَ نِصْفَ أُمَّتِي الْجَنَّةَ وَبَيْنَ الشَّفَاعَةِ فَاخْتَرْتُ الشَّفَاعَةَ وَهِيَ لِمَنْ مَاتَ لَا يُشْرِكُ بِاللَّهِ شَيْئًا» . رَوَاهُ التِّرْمِذِيّ وَابْن مَاجَه",
      "english": {
        "narrator": "",
        "text": "`Auf b. Malik reported God's messenger as saying, \"One came to me from my Lord and gave me a choice between half of my people entering paradise and intercession, and I chose intercession. It will apply to those who have died and have associated nothing with God.\" \n\nTirmidhi and Ibn Majah transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5600",
        "url": "https://sunnah.com/mishkat:5600"
      },
      "grade": null
    },
    {
      "id": 75,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن عبدِ الله بن أبي الجَدعاءِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «يَدْخُلُ الْجَنَّةَ بِشَفَاعَةِ رَجُلٍ مِنْ أُمَّتِي أَكْثَرُ مِنْ بَنِي تَمِيمٍ» رَوَاهُ التِّرْمِذِيُّ والدارمي وَابْن مَاجَه",
      "english": {
        "narrator": "",
        "text": "`Abdallah b. Abul Jad'a' told that tie heard God's messenger say, \"More than the number of the B. Tamim will enter paradise through the intercession of a man of my people.\" \n*'Abdallah b. Abul Jad'a' belonged to Tamim himself. See Isti'ab, p. 343\n\nTirmidhi, Darimi and Ibn Majah transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5601",
        "url": "https://sunnah.com/mishkat:5601"
      },
      "grade": null
    },
    {
      "id": 76,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي سَعِيدٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ مِنْ أُمَّتِي مَنْ يَشْفَعُ لِلْقَبِيلَةِ وَمِنْهُمْ مَنْ يَشْفَعُ لِلْعُصْبَةِ وَمِنْهُمْ مَنْ يَشْفَعُ لِلرَّجُلِ حَتَّى يَدْخُلُوا الْجَنَّةَ» رَوَاهُ التِّرْمِذِيُّ",
      "english": {
        "narrator": "",
        "text": "Abu Sa'id reported God's messenger as saying, \"Some of my people will intercede for & large number, some for a tribe, some for a group, and some for a single man, till they enter paradise.\" \n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5602",
        "url": "https://sunnah.com/mishkat:5602"
      },
      "grade": null
    },
    {
      "id": 77,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ عَزَّ وَجَلَّ وعَدَني أَن يدْخل الجنةَ من أُمتي أربعمائةِ أَلْفٍ بِلَا حِسَابٍ» . فَقَالَ أَبُو بَكْرٍ زِدْنَا يَا رَسُولَ اللَّهِ قَالَ وَهَكَذَا فَحَثَا بِكَفَّيْهِ وَجَمَعَهُمَا فَقَالَ أَبُو بَكْرٍ: زِدْنَا يَا رَسُولَ اللَّهِ. قَالَ: وَهَكَذَا فَقَالَ عُمَرُ دَعْنَا يَا أبكر. فَقَالَ أَبُو بَكْرٍ: وَمَا عَلَيْكَ أَنْ يُدْخِلَنَا اللَّهُ كُلَّنَا الْجَنَّةَ؟ فَقَالَ عُمَرُ: إِنَّ اللَّهَ عَزَّ وَجَلَّ إِنْ شَاءَ أَنْ يُدْخِلَ خَلْقَهُ الْجَنَّةَ بِكَفٍّ وَاحِدٍ فَعَلَ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «صَدَقَ عُمَرُ» رَوَاهُ فِي شرح السّنة",
      "english": {
        "narrator": "",
        "text": "Anas reported God's messenger as saying, \"God who is great and glorious has promised me that four hundred thousand of my people will enter paradise without being taken to account.\" Abu Bakr asked God's messenger to tell them more, and he replied that God did thus, taking up two handfuls and joining his hands together. Abu Bakr asked him to tell them more, and he did the same again. `Umar then said, \"Let the matter alone, Abu Bakr,\" to which Abu Bakr replied, \"What harm would it do you if God were to bring us all into paradise?\" `Umar said, \"If God who is great and glorious wishes to bring all His creatures into paradise simultaneously, He can do so,\" and the Prophet said, \"`Umar has spoken the truth.\" \n\nIt is transmitted in Sharh as-sunna."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5603",
        "url": "https://sunnah.com/mishkat:5603"
      },
      "grade": null
    },
    {
      "id": 78,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" يُصَفُّ أَهْلَ النَّارِ فَيَمُرُّ بِهِمُ الرَّجُلُ مِنْ أَهْلِ الْجَنَّةِ فَيَقُولُ الرَّجُلُ مِنْهُمْ: يَا فُلَانُ أَمَا تَعْرِفُنِي؟ أَنَا الَّذِي سَقَيْتُكَ شَرْبَةً. وَقَالَ بَعْضُهُمْ: أَنَا الَّذِي وَهَبْتُ لَكَ وَضُوءًا فَيَشْفَعُ لَهُ فَيُدْخِلُهُ الْجَنَّةَ \". رَوَاهُ ابْنُ مَاجَه",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"The inhabitants of hell will be drawn up in line, and when one of the inhabitants of paradise passes them one of them will say, `So and so, do you not recognise me? I am the one who gave you a drink.' And one of them will say, `I am the one who gave you water for ablution.' He will then intercede for him and bring him into paradise.\" \n\nIbn Majah transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5604",
        "url": "https://sunnah.com/mishkat:5604"
      },
      "grade": null
    },
    {
      "id": 79,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" إِنَّ رَجُلَيْنِ مِمَّنْ دَخَلَ النَّارَ اشْتَدَّ صِيَاحُهُمَا فَقَالَ الرَّبُّ تَعَالَى: أَخْرِجُوهُمَا. فَقَالَ لَهُمَا: لِأَيِّ شَيْءٍ اشْتَدَّ صِيَاحُكُمَا؟ قَالَا: فَعَلْنَا ذَلِكَ لِتَرْحَمَنَا. قَالَ: فَإِنَّ رَحْمَتِي لَكُمَا أَنْ تَنْطَلِقَا فَتُلْقِيَا أَنْفُسَكُمَا حَيْثُ كُنْتُمَا مِنَ النَّارِ فَيُلْقِي أَحَدُهُمَا نَفْسَهُ فَيَجْعَلُهَا اللَّهُ بَرْدًا وَسَلَامًا وَيَقُومُ الْآخَرُ فَلَا يُلْقِي نَفْسَهُ فَيَقُولُ لَهُ الرَّبُّ تَعَالَى: مَا مَنَعَكَ أَنْ تُلْقِيَ نَفْسَكَ كَمَا أَلْقَى صَاحِبُكَ؟ فَيَقُولُ: رَبِّ إِنِّي لَأَرْجُو أَنْ لَا تُعِيدَنِي فِيهَا بَعْدَ مَا أَخْرَجْتَنِي مِنْهَا. فَيَقُولُ لَهُ الرَّبُّ تَعَالَى: لَكَ رَجَاؤُكَ. فَيُدْخَلَانِ جَمِيعًا الْجَنَّةَ بِرَحْمَةِ اللَّهِ \". رَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported God's messenger as saying, \"Two men of those who enter hell will shout loudly, and the Lord most high will say, `Bring them out.' He will ask them why they shouted so loudly and they will reply, `We did that in order that Thou mightest have mercy on us.' He will say, `My mercy to you is that you should go and throw yourselves where you were in hell.' One of them will do so and God will make it coolness and peace for him, but the other will stand and not do so. The Lord most high will ask him, `What has prevented you from throwing yourself in as your companion did?' and he will reply, 'My Lord, I hope that Thou wilt not send me back into it after taking me out of it.' The Lord most high will then say to him, `You will have your hope realised and they will both be brought into paradise by God's mercy.\" \n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5605",
        "url": "https://sunnah.com/mishkat:5605"
      },
      "grade": null
    },
    {
      "id": 80,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَرِدُ النَّاسُ النَّارَ ثمَّ يصدون مِنْهَا بِأَعْمَالِهِمْ فَأَوَّلُهُمْ كَلَمْحِ الْبَرْقِ ثُمَّ كَالرِّيحِ ثُمَّ كَحُضْرِ الْفَرَسِ ثُمَّ كَالرَّاكِبِ فِي رَحْلِهِ ثُمَّ كَشَدِّ الرَّجُلِ ثُمَّ كَمَشْيِهِ» . رَوَاهُ التِّرْمِذِيُّ وَالدَّارِمِيُّ",
      "english": {
        "narrator": "",
        "text": "Ibn Mas'ud reported God's messenger as saying, \"Mankind will go down to hell and then come up from it because of their deeds, the first of them like a flash of lightning, next like the wind, next like a horse's gallop, next like one riding on his pack-saddle, next like a man's running, next like his walking.\" \n\nTirmidhi and Darimi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5606",
        "url": "https://sunnah.com/mishkat:5606"
      },
      "grade": null
    },
    {
      "id": 81,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "عَنِ ابْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ أَمَامَكُمْ حَوْضِي مَا بَيْنَ جَنْبَيْهِ كَمَا بَيْنَ جَرْبَاءَ وَأَذْرُحَ» . قَالَ بَعْضُ الرُّوَاةِ: هُمَا قَرْيَتَانِ بِالشَّامِ بَيْنَهُمَا مَسِيرَةُ ثَلَاثِ لَيَالٍ. وَفِي رِوَايَةٍ: «فِيهِ أَبَارِيقُ كَنُجُومِ السَّمَاءِ مَنْ وَرَدَهُ فَشَرِبَ مِنْهُ لَمْ يَظْمَأْ بَعْدَهَا أَبَدًا» . مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Ibn `Umar reported God's messenger as saying, \"Before you will be my pond, the distance between whose sides is like that between Jarba' and Adruh.\" One of the transmitters said they are villages in Syria three days' journey apart. A version has \"Beside it there are vessels as numerous as the stars in the sky. He who comes down to it and drinks of it will never thirst afterwards.\" \n*Yaqut, Mu'jam, 1:174, says Adhruh was in the neighbourhood of al-Balqa' and 'Amman and quotes statements that the distance between Adhruh and Jarba', which he calls al-Jarba', was s mile or less. For Jarba' see also 2:45. Mirqat, 5:281. says the tradition really means the distance between Medina and those two villages, and refers to a version by Daraqutni to that effect.\n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5607",
        "url": "https://sunnah.com/mishkat:5607"
      },
      "grade": "مُتَّفق عَلَيْهِ (الألباني)"
    },
    {
      "id": 82,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن حذيفةَ وَأَبِي هُرَيْرَةَ قَالَا: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" يَجْمَعُ اللَّهُ تَبَارَكَ وَتَعَالَى النَّاسَ فَيَقُومُ الْمُؤْمِنُونَ حَتَّى تُزْلَفَ لَهُمُ الْجَنَّةُ فَيَأْتُونَ آدَمَ فَيَقُولُونَ: يَا أَبَانَا اسْتَفْتِحْ لَنَا الْجَنَّةَ. فَيَقُولُ: وَهَلْ أَخْرَجَكُمْ مِنَ الْجَنَّةِ إِلَّا خَطِيئَةُ أَبِيكُمْ لَسْتُ بِصَاحِبِ ذَلِكَ اذْهَبُوا إِلَى ابْنِي إِبْرَاهِيمَ خَلِيلِ اللَّهِ \" قَالَ: \" فَيَقُولُ إِبْرَاهِيمُ: لَسْتُ بِصَاحِبِ ذَلِكَ إِنَّمَا كُنْتُ خَلِيلًا مِنْ وَرَاءَ وَرَاءَ اعْمَدُوا إِلَى مُوسَى الَّذِي كَلَّمَهُ اللَّهُ تَكْلِيمًا فَيَأْتُونَ مُوسَى عَلَيْهِ السَّلَام فَيَقُولُ: لَسْتُ بِصَاحِبِ ذَلِكَ اذْهَبُوا إِلَى عِيسَى كَلِمَةِ اللَّهِ وَرُوحِهِ فَيَقُولُ عِيسَى: لَسْتُ بِصَاحِبِ ذَلِكَ فَيَأْتُونَ مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَيَقُومُ فَيُؤْذَنُ لَهُ وَتُرْسَلُ الْأَمَانَةُ وَالرَّحِمُ فَيَقُومَانِ جَنَبَتَيِ الصِّرَاطِ يَمِينًا وَشِمَالًا فَيَمُرُّ أَوَّلُكُمْ كَالْبَرْقِ \". قَالَ: قُلْتُ: بِأَبِي أَنْتَ وَأُمِّي أَيُّ شَيْءٍ كَمَرِّ الْبَرْقِ؟ قَالَ: \" أَلَمْ تَرَوْا إِلَى الْبَرْقِ كَيْفَ يَمُرُّ وَيَرْجِعُ فِي طَرْفَةِ عَيْنٍ. ثُمَّ كَمَرِّ الرِّيحِ ثُمَّ كَمَرِّ الطَّيْرِ وَشَدِّ الرِّجَالِ تَجْرِي بِهِمْ أَعْمَالُهُمْ وَنَبِيُّكُمْ قَائِمٌ عَلَى الصِّرَاطِ يَقُولُ: يَا رَبِّ سَلِّمْ سَلِّمْ. حَتَّى تَعْجِزَ أَعْمَالُ الْعِبَادِ حَتَّى يَجِيءَ الرَّجُلُ فَلَا يَسْتَطِيعُ السَّيْرَ إِلَّا زَحْفًا \". وَقَالَ: «وَفِي حَافَتَيِ الصِّرَاطِ كَلَالِيبُ مُعَلَّقَةٌ مَأْمُورَةٌ تَأْخُذُ مَنْ أُمِرَتْ بِهِ فَمَخْدُوشٌ نَاجٍ وَمُكَرْدَسٌ فِي النَّارِ» . وَالَّذِي نَفْسُ أَبِي هُرَيْرَةَ بِيَدِهِ إِنَّ قَعْرَ جَهَنَّمَ لَسَبْعِينَ خَرِيفًا. رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Hudhaifa and Abu Huraira reported God's messenger as saying, \"God who is blessed and exalted will collect mankind and the believers will stand till paradise is brought near them. They will then go to Adam and say, `Ask, father, that paradise may be opened for us,' but he will reply, `Has anything but your father's sin put you out of paradise? I am not the one to do that; go to my son Abraham, God's friend.' Then Abraham will say, `I am not the one to do that, for I was only a friend long, long ago; but apply to Moses to whom God spoke.' They will then go to Moses, but he will say, `I am not the one to do ta t; go to Jesus, God's word and spirit.' Jesus will say, `I am not the one to do that, so they will go to Muhammad and he will stand and be given permission. Faithfulness and ties of relationship will be sent and will stand on the sides of the Path, right and left, and the first of you will pass like lightning (Abu Huraira telling that he interpolated, \" You for whom I would give my father and mother as ransom, what is there like the movement of lightning?\" and received the reply, \"Have you not seen how the lightning goes and returns like the twinkling of an eye?\"), next like the passing of the wind, next like the passing of a bird and the running of men whose deeds cause them to run, your prophet standing on the Path and saying, 0 my Lord, keep safe, keep safe,' till men's deeds are so weak that a man comes able only to creep. On both sides of the Path pronged flesh-hooks placed under command will be hung and will seize those about whom they receive command, some being lacerated and escaping and others being thrown Pell Mell into hell. By Him in whose hand Abu Huraira's soul is, the pit of Jahannam is a seventy years' journey down.\" \n*There is some doubt as to whether the end of the tradition gives the Prophet's or Abu Huraira's word, this oath suggesting the latter. In the text \"on both sides of the Path\" is preceded by \"he said.\" One wonders. Therefore, whether from there to the end Abu Huraira is making an addition to his own. \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5608",
        "url": "https://sunnah.com/mishkat:5608"
      },
      "grade": "صحيح (الألباني)"
    },
    {
      "id": 83,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" يَخْرُجُ مِنَ النَّار بالشفاعة كَأَنَّهُمْ الثعارير؟ قَالَ: «إِنَّه الضغابيس» . مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Jabir reported God's messenger as saying, \"People will come forth from hell like tha'arir because of the intercession.\" He was asked the meaning of tha'arir and replied that it meant small cucumbers. \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5610",
        "url": "https://sunnah.com/mishkat:5610"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 84,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ عثمان بن عَفَّان قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" يُشَفَّعُ يَوْمَ الْقِيَامَةِ ثَلَاثَةٌ: الْأَنْبِيَاءُ ثُمَّ الْعلمَاء ثمَّ الشُّهَدَاء \". رَوَاهُ ابْن مَاجَه",
      "english": {
        "narrator": "",
        "text": "`Uthman b. 'Affan reported God's messenger as saying, \"Three groups will make intercession on the day of resurrection, the prophets, next the learned, next the martyrs.\" \n\nIbn Majah transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5611",
        "url": "https://sunnah.com/mishkat:5611"
      },
      "grade": null
    },
    {
      "id": 85,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" قَالَ اللَّهُ تَعَالَى: أَعْدَدْتُ لِعِبَادِيَ الصَّالِحِينَ مَا لَا عَيْنٌ رَأَتْ وَلَا أُذُنٌ سَمِعَتْ وَلَا خَطَرَ عَلَى قَلْبِ بشر. واقرؤوا إِنْ شِئْتُمْ: (فَلَا تَعْلَمُ نَفْسٌ مَا أُخْفِيَ لَهُمْ مِنْ قُرَّة عين)\nمُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira told that after God's messenger had stated that God most high has said, \"I have prepared for my upright servants what eye has not seen, nor ear heard, nor has entered into the heart of man,\" 1 he added, \"Recite, if you wish, `No soul knows what comfort has been concealed for them'.\"  \n1. Cf. 1 Corinthians, 2:9. \n2. Quran, 32:17. \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5612",
        "url": "https://sunnah.com/mishkat:5612"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 86,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:\nمَوْضِعُ سَوْطٍ فِي الْجَنَّةِ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا \". مُتَّفَقٌ عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger us saying, \"The place occupied by a whip in paradise is better than the world and what it contains.\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5613",
        "url": "https://sunnah.com/mishkat:5613"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 87,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «غَدْوَةٌ فِي سَبِيلِ اللَّهِ أَوْ رَوْحَةٌ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا وَلَوْ أَنَّ امْرَأَةً مِنْ نِسَاءِ أَهْلِ الْجَنَّةِ اطَّلَعت إِلى الأَرْض لَأَضَاءَتْ مابينهما وَلَمَلَأَتْ مَا بَيْنَهُمَا رِيحًا وَلَنَصِيفُهَا عَلَى رَأْسِهَا خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا» . رَوَاهُ الْبُخَارِيُّ",
      "english": {
        "narrator": "",
        "text": "Anas reported God's messenger as saying, \"A morning or evening expedition in God's path is better than the world and what it contains. If one of the women of paradise were to look down to the earth she would illuminate the space in between, fill the space in between with fragrance, and her scarf on her head is better than the world and what it contains.\" \n\nBukhari transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5614",
        "url": "https://sunnah.com/mishkat:5614"
      },
      "grade": "صَحِيحٌ (الألباني)"
    },
    {
      "id": 88,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِن فِي الْجَنَّةِ شَجَرَةً يَسِيرُ الرَّاكِبُ فِي ظِلِّهَا مِائَةَ عَامٍ لَا يَقْطَعُهَا وَلَقَابَ قَوْسِ أَحَدِكُمْ فِي الْجَنَّةِ خَيْرٌ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ أَو تغرب» . مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported God's messenger as saying, \"In paradise there is a tree in whose shade a rider can travel for a hundred years without reaching the end of it, and the length of a bow of one of you in paradise is better than that on which the sun rises or sets.\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5615",
        "url": "https://sunnah.com/mishkat:5615"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 89,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي مُوسَى قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِنَّ لِلْمُؤْمِنِ فِي الْجَنَّةِ لَخَيْمَةً مِنْ لُؤْلُؤَةٍ وَاحِدَةٍ مُجَوَّفَةٍ عَرْضُهَا وَفِي رِوَايَةٍ: طُولُهَا سِتُّونَ مِيلًا فِي كُلِّ زَاوِيَةٍ مِنْهَا أَهْلٌ مَا يَرَوْنَ الْآخَرِينَ يَطُوفُ عَلَيْهِم المؤمنُ وجنَّتانِ من فضةٍ آنيتهما مَا فِيهِمَا وَجَنَّتَانِ مِنْ ذَهَبٍ آنِيَتُهُمَا وَمَا فِيهِمَا وَمَا بينَ أَنْ يَنْظُرُوا إِلَى رَبِّهِمْ إِلَّا رِدَاءُ الْكِبْرِيَاءِ على وجههِ فِي جنَّة عدْنٍ \". مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Abu Musa reported God's messenger as saying, \"In paradise the believer will have a tent of a single hollowed pearl whose breadth (a version saying, whose length) is sixty miles, in each corner of which there will be a family out of sight of one another, each of which the believer will visit in turn. He will also have two gardens whose vessels and contents will be of silver and two gardens whose vessels and contents will be of gold. The only thing intervening to hinder the people from looking at their Lord will be the mantle of grandeur over His face in the garden of Eden.\"\n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5616",
        "url": "https://sunnah.com/mishkat:5616"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 90,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ عُبَادَةَ بْنِ الصَّامِتِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «فِي الْجَنَّةِ مائةُ درجةٍ مَا بينَ كلِّ دَرَجَتَيْنِ كَمَا بَيْنَ السَّمَاءِ وَالْأَرْضِ وَالْفِرْدَوْسُ أَعْلَاهَا دَرَجَةً مِنْهَا تُفَجَّرُ أَنْهَارُ الْجَنَّةِ الْأَرْبَعَةُ وَمِنْ فَوْقِهَا يَكُونُ الْعَرْشُ فَإِذَا سَأَلْتُمُ اللَّهَ فَاسْأَلُوهُ الْفِرْدَوْسَ» رَوَاهُ التِّرْمِذِيُّ وَلَمْ أَجِدْهُ فِي الصَّحِيحَيْنِ وَلَا فِي كِتَابِ الْحُمَيْدِيِّ",
      "english": {
        "narrator": "",
        "text": "`Ubada b. as-Samit reported God's messenger as saying, \"In paradise there are a hundred stages between each two of which there is a distance like that between heaven and earth. Al-Firdaus from which issue the four rivers of paradise is the highest of them, and above it is the Throne; so, when you make request from God ask Him for al-Firdaus.\" \n\nTirmidhi transmitted it. I have not found it in the two Sahihs or al-Humaidi's book. \n*In Masabih as-sunna the source of each individual tradition is not given but those in section 1 are all called sahih and come from Bukhari or Muslim, or from both. One therefore does not expect to find a tradition from Tirmidhi in section 1. It occurs in his collection in Sifat al janna, 4. In Masabih as-sunna it does not say that this tradition comes from 'Ubada, but the Mishkat is correct in attributing it to him. There is one like it from Abu Huraira in Bukhari, jihad, 4, but the wording is not identical."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5617",
        "url": "https://sunnah.com/mishkat:5617"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 91,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ فِي الْجَنَّةِ لَسُوقًا يَأْتُونَهَا كُلَّ جُمُعَةٍ فَتَهُبُّ رِيحُ الشَّمَالِ فَتَحْثُو فِي وُجوهِهم وثيابِهم فيزدادونَ حُسنا وجمالاً فيرجعونَ إِلى أَهْليهمْ وَقَدِ ازْدَادُوا حُسُنًا وَجَمَالًا فَيَقُولُ لَهُمْ أَهْلُوهُمْ وَاللَّهِ لَقَدِ ازْدَدْتُمْ بَعْدَنَا حُسْنًا وَجَمَالًا فَيَقُولُونَ وَأَنْتُم واللَّهِ لقدِ ازددتم حسنا وجمالا».  رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Anas reported God's messenger as saying, \"In paradise there is a market to which they will come every Friday. The north wind will blow and will scatter  on their faces and their clothing, and they will be increased in beauty and loveliness. They will then return to their families, having been increased in beauty and loveliness, and their families will say to them, `We swear by God that you have been increased in beauty and loveliness since leaving us, to which they will reply, `You also, we swear by God, have been increased in beauty and loveliness since we left you'.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5618",
        "url": "https://sunnah.com/mishkat:5618"
      },
      "grade": null
    },
    {
      "id": 92,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن أبي هُرَيْرَة قا ل: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" إِنَّ أَوَّلَ زُمْرَةٍ يَدْخُلُونَ الْجَنَّةَ عَلَى صُورَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ ثُمَّ الَّذِينَ يَلُونَهُمْ كَأَشَدِّ كَوْكَبٍ دُرِّيٍّ فِي السَّمَاءِ إِضَاءَةً قُلُوبُهُمْ عَلَى قَلْبِ رَجُلٍ وَاحِدٍ لَا اخْتِلَافَ بَيْنَهُمْ وَلَا تَبَاغُضَ لِكُلِّ امْرِئٍ مِنْهُمْ زَوْجَتَانِ مِنَ الْحُورِ الْعِينِ يُرَى مُخُّ سُوقِهِنَّ مِنْ وَرَاءِ الْعَظْمِ وَاللَّحْمِ مِنَ الْحُسْنِ يُسَبِّحُونَ اللَّهَ بُكْرَةً وَعَشِيًّا لَا يَسْقَمُونُ وَلَا يَبُولُونَ وَلَا يَتَغَوَّطُونَ وَلَا يَتْفُلُونَ وَلَا يَتَمَخَّطُونَ آنِيَتُهُمُ الذَّهَبُ وَالْفِضَّةُ وَأَمْشَاطُهُمُ الذَّهَبُ وَوَقُودُ مَجَامِرِهِمُ الْأَلُوَّةُ وَرَشْحُهُمُ الْمِسْكُ عَلَى خُلُقِ رَجُلٍ وَاحِدٍ عَلَى صُورَةِ أَبِيهِمْ آدَمَ ستونَ ذِرَاعا فِي السَّمَاء. مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Aba Huraira reported God's messenger as saying, \"The first party to enter paradise will be in the form of the moon on the night when it is full; then will come those who will be near them, like the brightest shining planet in the sky, their hearts like one man's heart with no disagreement or mutual hatred among them. Every man among them will have two wives from the large-eyed maidens the marrow of whose legs will be visible through the bone and the flesh owing to their slender beauty. They will glorify God morning and evening, they will not become ill, or pass water, or void excrement, or spit, or suffer from catarrh. Their vessels will be of gold and silver, their combs will be of gold, the fuel of their braziers will be aloes, and their sweat will be musk. All will be alike in the form of their father Adam, sixty cubits tall.\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5619",
        "url": "https://sunnah.com/mishkat:5619"
      },
      "grade": null
    },
    {
      "id": 93,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ جَابِرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَهْلَ الْجَنَّةِ يَأْكُلُونَ فِيهَا وَيَشْرَبُونَ ولايتفلون ولايبولون وَلَا يَتَغَوَّطُونَ وَلَا يَتَمَخَّطُونَ» . قَالُوا: فَمَا بَالُ الطَّعَامِ؟ قَالَ: «جُشَاءٌ وَرَشْحٌ كَرَشْحِ الْمِسْكِ يُلْهَمُونَ التَّسْبِيحَ وَالتَّحْمِيدَ كَمَا تُلْهَمُونَ النَّفَسَ» . رَوَاهُ مُسْلِمٌ",
      "english": {
        "narrator": "",
        "text": "Jabir reported God's messenger as saying, \"The inhabitants of paradise will eat and drink in it, but they will not spit, or pass water, or void excrement, or suffer from catarrh.\" He was asked what would happen to the food and replied, \"It will produce belching and sweat like musk. They will give vent to glorifying and praising of God as easily as you breathe.\"\n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5620",
        "url": "https://sunnah.com/mishkat:5620"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 94,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَنْ يَدْخُلُ الْجَنَّةَ يَنْعَمُ وَلَا يَبْأَسُ وَلَا تَبْلَى ثِيَابُهُ وَلَا يفْنى شبابُه» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported God's messenger as saying, \"He who enters paradise will be in affluent circumstances and will not be destitute, his clothing will not wear out and his youth will not pass away.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5621",
        "url": "https://sunnah.com/mishkat:5621"
      },
      "grade": null
    },
    {
      "id": 95,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن أَبِي سَعِيدٍ وَأَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" يُنَادِي مُنَادٍ: إِنَّ لَكُمْ أَنْ تَصِحُّوا فَلَا تَسْقَمُوا أَبَدًا وَإِنَّ لَكُمْ أَنْ تَحْيَوْا فَلَا تَمُوتُوا أَبَدًا وَإِنَّ لَكُمْ أَنْ تَشِبُّوا فَلَا تَهْرَمُوا أَبَدًا وَإِنَّ لَكُمْ أَنْ تَنْعَمُوا فَلَا تَبْأَسُوا أبدا \" رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Abu Sa'id and Abu Huraira reported God's messenger as saying, \"A crier will call, `You will have the privilege of being healthy and never ailing, you will have the privilege of living and never dying, you will have the privilege of retaining your youth and never becoming decrepit, you will have the privilege of being in affluent circumstances and never being destitute'.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5622, 5623",
        "url": "https://sunnah.com/mishkat:5622"
      },
      "grade": null
    },
    {
      "id": 96,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيُّ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ أَهْلَ الْجَنَّةِ يَتَرَاءَوْنَ أَهْلَ الْغُرَفِ مِنْ فَوْقِهِمْ كَمَا تَتَرَاءَوْنَ الْكَوْكَبَ الدُّرِّيَّ الْغَابِرَ فِي الْأُفُقِ مِنَ الْمَشْرِقِ أَو الْمَغْرِبِ لِتَفَاضُلِ مَا بَيْنَهُمْ» قَالُوا يَا رَسُولَ اللَّهِ تِلْكَ مَنَازِلُ الْأَنْبِيَاءِ لَا يَبْلُغُهَا غَيْرُهُمْ قَالَ: «بَلَى وَالَّذِي نَفْسِي بِيَدِهِ رِجَالٌ آمَنُوا باللَّهِ وصدَّقوا الْمُرْسلين» . مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Abu Sa'id al-Khudri reported God's messenger as saying, \"The inhabitants of paradise will look at those in the upper apartments above them as you look at a shining planet which remains in the east or west horizon, on account of the superiority some have over others.\" God's messenger was asked whether those were the dwellings of the prophets which no one else would reach and replied, \"Yes, they will. By Him in whose hand my soul is, men who believed in God and acknowledged the truth of the messengers will reach them.\" \n*It can be seen in the morning after daybreak, or in the west before the darkness descends. \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5624",
        "url": "https://sunnah.com/mishkat:5624"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 97,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن أبي هُرَيْرَة قا ل: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَدْخُلُ الْجَنَّةَ أَقْوَامٌ أَفْئِدَتُهُمْ مِثْلُ أَفْئِدَةِ الطَّيْرِ» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "Abu Huraira reported God's messenger as saying, \"Peoples will enter paradise with hearts like the hearts of birds.\" \n*Mirqat, 5, 291, gives three possible meanings:",
        "text": "(1) with no jealousy, rancour, deceit, or hatred; (2) in trepidation, being on their guard; (3) with complete trust, as birds trust God for their food. \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5625",
        "url": "https://sunnah.com/mishkat:5625"
      },
      "grade": null
    },
    {
      "id": 98,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن أبي سعيد قا ل: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِنَّ اللَّهَ تَعَالَى يَقُولُ لِأَهْلِ الْجَنَّةِ يَا أهلَ الجنةِ فيقولونَ لَبَّيْكَ رَبَّنَا وَسَعْدَيْكَ وَالْخَيْرُ كُلُّهُ فِي يَدَيْكَ فَيَقُولُ: هَلْ رَضِيتُمْ؟ فَيَقُولُونَ: وَمَا لَنَا لَا نَرْضَى يَا رَبِّ وَقَدْ أَعْطَيْتَنَا مَا لَمْ تُعْطِ أَحَدًا مِنْ خَلْقِكَ؟ فَيَقُولُ أَلَا أُعْطِيكُمْ أَفْضَلَ مِنْ ذَلِكَ؟ فَيَقُولُونَ: يَا رَبِّ وَأَيُّ شَيْءٍ أَفْضَلُ مِنْ ذَلِكَ؟ فَيَقُولُ: أُحِلُّ عَلَيْكُمْ رِضْوَانِي فَلَا أَسْخَطُ عَلَيْكُمْ بَعْدَهُ أَبَدًا \". مُتَّفَقٌ عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Abu Sa'id reported God's messenger as telling that God most high will say to the inhabitants of paradise, \"O inhabitants of paradise,\" to which they will reply, \"At Thy service and pleasure, our Lord, in whose hands is all good.\" He will ask them if they are pleased, and they will reply, \"Why should we not be pleased, O Lord, when Thou hast given us what Thou hast not given to any of Thy creatures?\" He will say, \"Shall I not give you something more excellent than that?\" and they will reply, \"0 Lord, what can be more excellent than that?\" He will say, \"I shall cause my good pleasure to alight on you and I shall never afterwards be displeased with you.\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5626",
        "url": "https://sunnah.com/mishkat:5626"
      },
      "grade": "مُتَّفق عَلَيْهِ (الألباني)"
    },
    {
      "id": 99,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" إِنَّ أَدْنَى مَقْعَدِ أَحَدِكُمْ مِنَ الْجَنَّةِ أَنْ يَقُولَ لَهُ: تَمَنَّ فَيَتَمَنَّى وَيَتَمَنَّى فَيَقُولُ لَهُ: هَلْ تَمَنَّيْتَ؟ فَيَقُولُ نَعَمْ فَيَقُولُ لَهُ: فَإِنَّ لَكَ مَا تَمَنَّيْتَ ومثلَه معَه \". رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported God's messenger as saying, \"The lowest place of any of you in paradise will be that God will tell him to express his wish, and he will wish and wish. He will then ask him if he has expressed his wish and when he replies that he has, He will tell him that he will have what he has wished and an equal amount along with it.\"\n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5627",
        "url": "https://sunnah.com/mishkat:5627"
      },
      "grade": null
    },
    {
      "id": 100,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «سَيْحَانُ وَجَيْحَانُ وَالْفُرَاتُ وَالنِّيلُ كُلٌّ من أنهارِ الْجنَّة» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, `Saihan, Jaihan', * the Euphrates and the Nile are all among the rivers of paradise.\" \n*The Sarus and Pyramus respectively, frontier rivers in the early Muslim period between the Islamic territory and that of the Byzantines. See G. Le Strange, The Lands of the Eastern Caliphate (Cambridge, 1930), pp. 129 ff.\n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5628",
        "url": "https://sunnah.com/mishkat:5628"
      },
      "grade": null
    },
    {
      "id": 101,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ عُتْبَةَ بْنِ غَزْوَانَ قَالَ: ذُكِرَ لَنَا أَنَّ الْحَجَرَ يُلْقَى مِنْ شَفَةِ جَهَنَّمَ فَيَهْوِي فِيهَا سَبْعِينَ خَرِيفًا لَا يُدْرِكُ لَهَا قَعْرًا وَاللَّهِ لَتُمْلَأَنَّ وَلَقَدْ ذُكِرَ لَنَا أَنَّ مَا بَيْنَ مِصْرَاعَيْنِ مِنْ مَصَارِيعِ الْجَنَّةِ مَسِيرَةُ أَرْبَعِينَ سَنَةً وَلَيَأْتِيَنَّ عَلَيْهَا يَوْمٌ وَهُوَ كَظِيظٌ مِنَ الزحام \". رَوَاهُ مُسلم",
      "english": {
        "narrator": "`Utba b. Ghazwan said:",
        "text": "It was mentioned to us that a stone will be thrown from the lip of Jahannam and fall in it for the space of seventy years without reaching the bottom. 'I swear by God that Jahannam will certainly be filled. It was also mentioned to us that the space between the two halves of the gates of paradise is a distance of forty years journey, yet a day will come when they will be full because of the crowding. \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5629",
        "url": "https://sunnah.com/mishkat:5629"
      },
      "grade": null
    },
    {
      "id": 102,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَلْتُ: يَا رَسُولَ اللَّهِ مِمَّ خُلِقَ الْخَلْقُ؟ قَالَ: «مِنَ الْمَاءِ» . قُلْنَا: الْجَنَّةُ مَا بِنَاؤُهَا؟ قَالَ: «لَبِنَةٌ مِنْ ذَهَبٍ وَلَبِنَةٌ مِنْ فِضَّةٍ وَمِلَاطُهَا الْمِسْكُ الْأَذْفَرُ وَحَصْبَاؤُهَا اللُّؤْلُؤُ وَالْيَاقُوتُ وَتُرْبَتُهَا الزَّعْفَرَانُ مَنْ يَدْخُلُهَا يَنْعَمُ وَلَا يَبْأَسُ وَيَخْلُدُ وَلَا يَمُوتُ وَلَا يَبْلَى ثِيَابُهُمْ وَلَا يَفْنَى شَبَابُهُمْ» . رَوَاهُ أَحْمَدُ وَالتِّرْمِذِيّ والدارمي",
      "english": {
        "narrator": "",
        "text": "Abu Huraira told that he asked God's messenger what the creation was made of and he replied that it was made of water. He was asked what paradise was constructed of and replied, \"A brick of gold and a brick of silver with mortar of strong-scented musk; its pebbles are pearls and rubies and its soil is saffron. Those who enter it will be in affluent circumstances and will not be destitute, they will live forever and not die, their garments will not wear out, and their youth will not pass away.\" \n\nAhmad, Tirmidhi and Darimi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5630",
        "url": "https://sunnah.com/mishkat:5630"
      },
      "grade": "صَحِيح لشواهده (الألباني)"
    },
    {
      "id": 103,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا فِي الْجَنَّةِ شَجَرَةٌ إِلَّا وساقُها من ذهب» . رَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"The trunk of every tree in paradise is of gold.\" \n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5631",
        "url": "https://sunnah.com/mishkat:5631"
      },
      "grade": null
    },
    {
      "id": 104,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ فِي الْجَنَّةِ مِائَةَ دَرَجَةٍ مَا بَيْنَ كُلِّ دَرَجَتَيْنِ مِائَةُ عَامٍ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ غَرِيبٌ",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"There are a hundred grades in paradise with a distance of a hundred years between every two.\" \n\nTirmidhi transmitted it, saying this is a hasan gharib tradition."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5632",
        "url": "https://sunnah.com/mishkat:5632"
      },
      "grade": null
    },
    {
      "id": 105,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ فِي الْجَنَّةِ مِائَةَ دَرَجَةٍ لَوْ أَنَّ الْعَالَمِينَ اجْتَمَعُوا فِي إِحْدَاهُنَّ لَوَسِعَتْهُمْ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ",
      "english": {
        "narrator": "",
        "text": "Abu Sa'id reported God's messenger as saying, \"There are a hundred grades in paradise; if the universe were gathered in one of them it would hold it all.\" \n\nTirmidhi transmitted it, saying this is a gharib tradition."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5633",
        "url": "https://sunnah.com/mishkat:5633"
      },
      "grade": null
    },
    {
      "id": 106,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قَوْلِهِ تَعَالَى (وفُرُشٍ مرفوعةٍ) قَالَ: «ارْتِفَاعُهَا لَكَمَا بَيْنَ السَّمَاءِ وَالْأَرْضِ مَسِيرَةَ خَمْسِمِائَةِ سَنَةً» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ",
      "english": {
        "narrator": "",
        "text": "He reported the Prophet as saying regarding the words of God most high, \"And couches raised high,\" that their height is like the distance between heaven and earth, a distance of five hundred years. \n*Quran; 56:34\n\nTirmidhi transmitted it, saying this is a gharib tradition."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5634",
        "url": "https://sunnah.com/mishkat:5634"
      },
      "grade": null
    },
    {
      "id": 107,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَوَّلَ زُمْرَةٍ يَدْخُلُونَ الْجَنَّةَ يَوْمَ الْقِيَامَةِ ضَوْءُ وُجُوهِهِمْ عَلَى مِثْلِ ضَوْءِ القمرِ ليلةَ البدْرِ وَالزُّمْرَةُ الثَّانِيَةُ عَلَى مِثْلِ أَحْسَنِ كَوْكَبٍ دُرِّيٍّ فِي السَّمَاءِ لِكُلِّ رَجُلٍ مِنْهُمْ زَوْجَتَانِ عَلَى كُلِّ زَوْجَةٍ سَبْعُونَ حُلَّةً يُرَى مُخُّ سَاقِهَا من وَرَائِهَا» . رَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"The faces of the first company to enter paradise on the day of resurrection will be as bright as the moon on the night when it is full, and the second company will be like the most beautiful shining planet in the sky. Every man among them will have two wives, each wife wearing seventy mantles through which the marrow of her leg will be seen.\" \n\nTirmidhi transmitted.it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5635",
        "url": "https://sunnah.com/mishkat:5635"
      },
      "grade": null
    },
    {
      "id": 108,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَنَسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يُعْطَى الْمُؤْمِنُ فِي الْجَنَّةِ قُوَّةَ كَذَا وَكَذَا مِنَ الْجِمَاعِ» . قِيلَ: يَا رَسُولَ الله أَو يُطيق ذَلِكَ؟ قَالَ: «يُعْطَى قُوَّةَ مِائَةٍ» . رَوَاهُ التِّرْمِذِيُّ",
      "english": {
        "narrator": "",
        "text": "Anas reported the Prophet as saying, \"In paradise the believer will be given such and such power to conduct sexual intercourse.' He was asked whether he would be capable of that and replied that he would be given the capacity of a hundred men. \n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5636",
        "url": "https://sunnah.com/mishkat:5636"
      },
      "grade": "صَحِيح لشواهده (الألباني)"
    },
    {
      "id": 109,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَوْ أَنَّ مَا يُقِلُّ ظُفُرٌ مِمَّا فِي الْجَنَّةِ بَدَا لَتَزَخْرَفَتْ لَهُ مَا بَيْنَ خَوَافِقِ السَّمَاوَاتِ وَالْأَرْضِ وَلَوْ أَنَّ رَجُلًا مِنْ أَهْلِ الْجَنَّةِ اطَّلَعَ فَبَدَا أَسَاوِرُهُ لَطَمَسَ ضَوْؤُهُ ضَوْءَ الشَّمْسِ كَمَا تَطْمِسُ الشَّمْسُ ضَوْءَ النُّجُومِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ",
      "english": {
        "narrator": "",
        "text": "Sa'd b. Abu Waqqas reported the Prophet as saying, \"If as much of what is in paradise as could be carried by a fingernail were to appear the space between the cardinal points of the heavens and the earth would be adorned on account of it, and if a man of the inhabitants of paradise were to look down and his bracelets were to appear his light would obliterate the light of the sun just as the sun obliterates the light of the stars.\"\n\nTirmidhi transmitted it, saying this is a gharib tradition."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5637",
        "url": "https://sunnah.com/mishkat:5637"
      },
      "grade": null
    },
    {
      "id": 110,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَهْلُ الْجَنَّةِ جُرْدٌ مُرْدٌ كَحْلَى لَا يَفْنَى شَبَابُهُمْ وَلَا تَبْلَى ثِيَابهمْ» . رَوَاهُ التِّرْمِذِيّ والدارمي",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported God's messenger as saying, \"The inhabitants of paradise are hairless, beardless and have black eyes, their youth does not pass away and their garments do not wear out.\" \n\nTirmidhi and Darimi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5638",
        "url": "https://sunnah.com/mishkat:5638"
      },
      "grade": null
    },
    {
      "id": 111,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ مُعَاذِ بْنِ جَبَلٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَدْخُلُ أَهْلُ الْجَنَّةِ الْجَنَّةَ جُرْدًا مُرْدًا مُكَحَّلِينَ أَبْنَاءَ ثَلَاثِينَ - أَوْ ثلاثٍ وَثَلَاثِينَ - سنة» . رَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "Mu'adh b. Jabal reported the Prophet as saying, \"The inhabitants of paradise will enter paradise hairless, beardless with their eyes anointed with collyrium, aged thirty or thirty-three years.\" \n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5639",
        "url": "https://sunnah.com/mishkat:5639"
      },
      "grade": "حسن بِمَا قبله (الألباني)"
    },
    {
      "id": 112,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن أَسمَاء بنت أبي بكر قَالَتْ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَذُكِرَ لَهُ سِدْرَةُ الْمُنْتَهَى قَالَ: «يَسِيرُ الرَّاكِبُ فِي ظِلِّ الْفَنَنِ مِنْهَا مِائَةَ سَنَةٍ أَوْ يَسْتَظِلُّ بِظِلِّهَا مِائَةُ رَاكِبٍ - شَكَّ الرَّاوِي - فِيهَا فَرَاشُ الذَّهَبِ كَأَنَّ ثَمَرَهَا الْقِلَالُ» رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ",
      "english": {
        "narrator": "",
        "text": "Asma' daughter of Abu Bakr told that she heard God's messenger say when the lote-tree of the boundary was mentioned to him, \"A rider can travel in the shade of a branch of it for a hundred years,\" or \"a hundred riders can take shelter in its shade (the transmitter being in doubt); in it there are golden butterflies and its fruit looks like earthenware jars.\" \n*Quran; 53:14\n\nTirmidhi transmitted it, saying th is is a gharib tradition"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5640",
        "url": "https://sunnah.com/mishkat:5640"
      },
      "grade": null
    },
    {
      "id": 113,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَنَسٍ قَالَ سُئِلَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ماالكوثر؟ قَالَ: «ذَاكَ نَهْرٌ أَعْطَانِيهِ اللَّهُ يَعْنِي فِي الْجَنَّةِ أَشَدُّ بَيَاضًا مِنَ اللَّبَنِ وَأَحْلَى مِنَ الْعَسَلِ فِيهِ طَيْرٌ أَعْنَاقُهَا كَأَعْنَاقِ الْجُزُرِ» قَالَ عُمَرُ: إِنَّ هَذِهِ لَنَاعِمَةٌ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ «أَكَلَتُهَا أَنْعَمُ مِنْهَا» رَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "Anas told that when God's messenger was asked what al-Kauthar was he replied, \"That is a river God has given me (meaning in paradise), whiter than milk and sweeter than honey, containing birds whose necks are like the necks of sacrificial camels.\" `Umar remarked, \"These have a pleasant life,\" and God's messenger replied, \"Those who eat them have a pleasanter life.\" \n*Quran; 108\n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5641",
        "url": "https://sunnah.com/mishkat:5641"
      },
      "grade": null
    },
    {
      "id": 114,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن بُريدةَ أَنَّ رَجُلًا قَالَ: يَا رَسُولَ اللَّهِ هَلْ فِي الْجَنَّةِ مِنْ خَيْلٍ؟ قَالَ: «إِنِ اللَّهُ أَدْخَلَكَ الْجَنَّةَ فَلَا تَشَاءُ أَنْ تُحْمَلَ فِيهَا عَلَى فَرَسٍ مِنْ يَاقُوتَةٍ حَمْرَاءَ يَطِيرُ بِكَ فِي الْجَنَّةِ حَيْثُ شِئْتَ إِلَّا فَعَلْتَ» وَسَأَلَهُ رجل فَقَالَ: يارسول الله هَل فِي الجنةِ من إِبلٍ؟ قَالَ: فَلَمْ يَقُلْ لَهُ مَا قَالَ لِصَاحِبِهِ. فَقَالَ: «إِنْ يُدْخِلْكَ اللَّهُ الْجَنَّةَ يَكُنْ لَكَ فِيهَا مَا اشْتَهَتْ نَفْسُكَ وَلَذَّتْ عَيْنُكَ» رَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "Buraida told that when a man asked God's messenger whether there were any horses in paradise he replied, \" If God brings you into paradise you will not wish to be conveyed in it on a horse of red ruby which will fly with you in paradise wherever you wish without doing so.\" A man asked God's messenger whether there were any camels in paradise and he did not give him the same reply as he gave the other, but said, \"If God brings you into paradise, you will have what your soul desires and your eye takes pleasure in.\" \n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5642",
        "url": "https://sunnah.com/mishkat:5642"
      },
      "grade": null
    },
    {
      "id": 115,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي أَيُّوبَ قَالَ أَتَى النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْرَابِيٌّ فَقَالَ: يَا رَسُولَ اللَّهِ إِنِّي أُحِبُّ الْخَيْلَ أَفِي الْجَنَّةِ خَيْلٌ؟ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنْ أُدْخِلْتَ الْجَنَّةَ أُتِيتَ بِفَرَسٍ مِنْ يَاقُوتَةٍ لَهُ جَنَاحَانِ فَحُمِلْتَ عَلَيْهِ ثُمَّ طَارَ بِكَ حَيْثُ شِئْتَ» رَوَاهُ التِّرْمِذِيُّ. وَقَالَ هَذَا حَدِيثٌ لَيْسَ بِالْقَوِيِّ وَأَبُو سَوْرَةَ الرَّاوِي يُضَعَّفُ فِي الْحَدِيثِ وَسَمِعْتُ مُحَمَّدَ بْنَ إِسْمَاعِيلَ يَقُولُ: أَبُو سَوْرَةَ هَذَا مُنكر الحَدِيث يروي مَنَاكِير",
      "english": {
        "narrator": "",
        "text": "Abu Ayyub told that a nomadic Arab came to the Prophet and said, \"Messenger of God, I am fond of horses. Are there any horses in paradise?\" He replied, \"If you are granted entrance into paradise, you will be brought a winged horse made of a ruby and will be mounted on it, then it will fly with you wherever you wish.\" \n\nTirmidhi transmitted it, saying this is a tradition whose isnad is not strong, that Abu Saura its transmitter is declared to be a weak traditionist, and that he had heard Muhammad b. Isma'il, i.e., Bukhari say this Abu Saura's traditions were rejected, he being one who transmitted dis acknowledged traditions."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5643",
        "url": "https://sunnah.com/mishkat:5643"
      },
      "grade": null
    },
    {
      "id": 116,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ بُرَيْدَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَهْلُ الْجَنَّةِ عِشْرُونَ وَمِائَةُ صَفٍّ ثَمَانُونَ مِنْهَا مِنْ هَذِهِ الْأُمَّةِ وَأَرْبَعُونَ مِنْ سَائِرِ الْأُمَمِ» . رَوَاهُ التِّرْمِذِيُّ وَالدَّارِمِيُّ وَالْبَيْهَقِيُّ فِي كتاب الْبَعْث والنشور",
      "english": {
        "narrator": "",
        "text": "Buraida reported God's messenger as saying, \"The inhabitants of paradise will be in a hundred and twenty rows, eighty of them from this people and forty from the rest of the peoples,\" \n\nTirmidhi, Darimi and Baihaqi, in Kitab al-ba'th wan nushur, transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5644",
        "url": "https://sunnah.com/mishkat:5644"
      },
      "grade": null
    },
    {
      "id": 117,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن سَالم عَنْ أَبِيهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «بَابُ أُمَّتِي الَّذِينَ يَدْخُلُونَ مِنْهُ الْجَنَّةَ عَرْضُهُ مَسِيرَةُ الرَّاكِبِ الْمُجَوِّدِ ثَلَاثًا ثُمَّ إِنَّهُمْ لَيُضْغَطُونَ عَلَيْهِ حَتَّى تَكَادُ مَنَاكِبُهُمْ تَزُولُ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ هَذَا حَدِيثٌ ضَعِيفٌ وَسَأَلْتُ مُحَمَّدَ بْنَ إِسْمَاعِيلَ عَنْ هَذَا الْحَدِيثِ فَلَمْ يَعْرِفْهُ وَقَالَ: خَالِد بن أبي بكر يروي الْمَنَاكِير",
      "english": {
        "narrator": "",
        "text": "Salim quoted his father (Abdullah bin Umar) who reported God's messenger as saying. 'The breadth of the gate by which my people will enter paradise will be a three years journey for a fine rider, yet they will be so crushed that they will almost lose their shoulders.\" \n*The noun le not specified in the text. From the form of the numeral, it might be either nights or years. Mirqat 5, 207. expresses a preference for years, as that conveys better the idea of huge extent.\n\nTirmidhi transmitted it, saying that this is a weak tradition, and that when he asked Muhammad b. Ismail about this tradition he did not know it, adding that Yakhlud b.Abu Bakr transmitted dis acknowledged traditions."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5645",
        "url": "https://sunnah.com/mishkat:5645"
      },
      "grade": null
    },
    {
      "id": 118,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِن فِي الْجَنَّةِ لَسُوقًا مَا فِيهَا شِرًى وَلَا بَيْعٌ إِلَّا الصُّوَرَ مِنَ الرِّجَالِ وَالنِّسَاءِ فَإِذَا اشْتَهَى الرَّجُلُ صُورَةً دَخَلَ فِيهَا» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ غَرِيبٌ",
      "english": {
        "narrator": "",
        "text": "'Ali reported God's messenger as saying, \"In paradise there is a market in which there is no buying or selling, but only the forms of men and women; and when a man desires a form, he enters it.\" \n\nTirmidhi transmitted it, saying this is a gharib tradition."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5646",
        "url": "https://sunnah.com/mishkat:5646"
      },
      "grade": null
    },
    {
      "id": 119,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن سعيد بن الْمسيب أَنه لقيَ أَبَا هريرةَ فَقَالَ أَبُو هُرَيْرَةَ: أَسْأَلُ اللَّهَ أَنْ يَجْمَعَ بَيْنِي وَبَيْنَكَ فِي سُوقِ الْجَنَّةِ. فَقَالَ سَعِيدٌ: أَفِيهَا سُوقٌ؟ قَالَ: نَعَمْ أَخْبَرَنِي رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَهْلَ الْجَنَّةِ إِذَا دَخَلُوهَا نَزَلُوا فِيهَا بِفَضْلِ أَعْمَالِهِمْ ثُمَّ يُؤْذَنُ لَهُمْ فِي مِقْدَارِ يَوْمِ الْجُمُعَةِ مِنْ أَيَّامِ الدُّنْيَا فَيَزُورُونَ رَبَّهُمْ وَيَبْرُزُ لَهُمْ عَرْشُهُ وَيَتَبَدَّى لَهُم فِي روضةٍ من رياضِ الجنَّة فَيُوضَع لَهُم مَنَابِر من نور ومنابرمن لُؤْلُؤٍ وَمَنَابِرُ مِنْ يَاقُوتٍ وَمَنَابِرُ مِنْ زَبَرْجَدٍ وَمَنَابِرُ مِنْ ذَهَبٍ وَمَنَابِرُ مِنْ فِضَّةٍ وَيَجْلِسُ أَدْنَاهُم - وَمَا فيهم دنيٌّ - عَلَى كُثْبَانِ الْمِسْكِ وَالْكَافُورِ مَا يَرَوْنَ أَنَّ أَصْحَابَ الْكَرَاسِيِّ بِأَفْضَلَ مِنْهُمْ مَجْلِسًا» . قَالَ أَبُو هُرَيْرَةَ: قُلْتُ: يَا رَسُولَ اللَّهِ وَهَلْ نَرَى رَبَّنَا؟ قَالَ: «نَعَمْ هَلْ تَتَمَارَوْنَ فِي رُؤْيَةِ الشَّمْسِ وَالْقَمَرِ لَيْلَةَ الْبَدْرِ؟» قُلْنَا: لَا. قَالَ: \" كَذَلِكَ لَا تَتَمَارَوْنَ فِي رُؤْيَةِ رَبِّكُمْ وَلَا يَبْقَى فِي ذَلِكَ الْمَجْلِسِ رَجُلٌ إِلَّا حَاضَرَهُ اللَّهُ مُحَاضَرَةً حَتَّى يَقُولَ لِلرَّجُلِ مِنْهُمْ: يَا فلَان ابْن فلَان أَتَذكر يَوْم قلت كَذَا وَكَذَا؟ فيذكِّره بِبَعْض غدارته فِي الدُّنْيَا. فَيَقُولُ: يَا رَبِّ أَفَلَمْ تَغْفِرْ لِي؟ فَيَقُولُ: بَلَى فَبِسِعَةِ مَغْفِرَتِي بَلَغْتَ مَنْزِلَتَكَ هَذِهِ. فَبَيْنَا هُمْ عَلَى ذَلِكَ غَشِيتْهُمْ سَحَابَةٌ مِنْ فَوْقِهِمْ فَأَمْطَرَتْ عَلَيْهِمْ طِيبًا لَمْ يَجِدُوا مِثْلَ رِيحِهِ شَيْئًا قَطُّ وَيَقُولُ رَبُّنَا: قُومُوا إِلَى مَا أَعْدَدْتُ لَكُمْ مِنَ الْكَرَامَةِ فَخُذُوا مَا اشْتَهَيْتُمْ فَنَأْتِي سُوقًا قَدْ حَفَّتْ بِهِ الْمَلَائِكَةُ فِيهَا مَا لَمْ تَنْظُرِ الْعُيُونُ إِلَى مِثْلِهِ وَلَمْ تَسْمَعِ الْآذَانُ وَلَمْ يَخْطُرْ عَلَى الْقُلُوبِ فَيُحْمَلُ لَنَا مَا اشْتَهَيْنَا لَيْسَ يُبَاعُ فِيهَا وَلَا يُشْتَرَى وَفِي ذَلِكَ السُّوقِ يَلْقَى أَهْلُ الْجَنَّةِ بَعْضُهُمْ بَعْضًا \". قَالَ: \" فَيُقْبِلُ الرَّجُلُ ذُو الْمَنْزِلَةِ الْمُرْتَفِعَةِ فَيَلْقَى مَنْ هُوَ دُونَهُ - وَمَا فيهم دنيٌّ - فيروعُه مَا يرى عَلَيْهِ من اللباسِ فِيمَا يَنْقَضِي آخِرُ حَدِيثِهِ حَتَّى يَتَخَيَّلَ عَلَيْهِ مَا هُوَ أحسن مِنْهُ وَذَلِكَ أَنَّهُ لَا يَنْبَغِي لِأَحَدٍ أَنْ يَحْزَنَ فِيهَا ثُمَّ نَنْصَرِفُ إِلَى مَنَازِلِنَا فَيَتَلَقَّانَا أَزْوَاجُنَا فَيَقُلْنَ: مَرْحَبًا وَأَهْلًا لَقَدْ جِئْتَ وَإِنَّ بِكَ مِنَ الْجَمَالِ أَفْضَلَ مِمَّا فَارَقْتَنَا عَلَيْهِ فَيَقُولُ: إِنَّا جَالَسْنَا الْيَوْمَ رَبَّنَا الْجَبَّارَ وَيَحِقُّنَا أَنْ نَنْقَلِبَ بِمِثْلِ مَا انْقَلَبْنَا \". رَوَاهُ التِّرْمِذِيُّ وَابْنُ مَاجَهْ وَقَالَ التِّرْمِذِيُّ: هَذَا حَدِيث غَرِيب",
      "english": {
        "narrator": "",
        "text": "Sa'id b. al-Musayyib told that he met Abu Huraira who said, \"I ask God to bring us together in the market of paradise.\" Sa'id asked if it contained a market and he replied that it did, for God's messenger had informed him that when the inhabitants of paradise enter it they will alight in it by virtue of their deeds. They will then be granted permission for the period of a Friday in this world and will visit their Lord whose throne will be shown to them, and He will appear to them in one of the gardens of paradise. Pulpits of light, pulpits of pearls, pulpits of rubies, pulpits of chrysoprase, pulpits of gold and pulpits of silver will be placed for them, and the humblest of them, for there is no one worthless among them, will sit on mounds of musk and camphor, not considering that those who are on the chairs are in a more excellent position than they. Abu Huraira told that he asked, \"Messenger of God, shall we see our Lord?\" to which he replied, \"Yes, are you in doubt about seeing the sun and the moon on the night when it is full?\" On receiving the reply that they were not, he said, \"Similarly you will have no doubts about the vision of your Lord, and no man will remain in that assembly without God conversing with him, till he says to one of them, `So and so son of so and so, do you remember the day you said such and such?' and He will remind him of one of the dishonest things he did in the world. He will say, `0 my Lord, hast Thou not forgiven me?' and He will reply, `Yes; by the wideness of my forgiveness, you have reached this station of yours.' While that is taking place a cloud will overshadow them from above and rain on them perfume whose fragrance will be such as they have never experienced my thing to compare with, and our Lord will say, `Get up and go to the honour I have prepared for you, and take what you desire.' We shall then come to a market surrounded by angels containing such things as eyes have never seen, ears have never heard, and hearts have never thought of. What we desire will be conveyed to us, there being no buying or selling in it, and in that market the inhabitants of paradise will meet one another. A man of exalted station will come forward and meet one who is humbler than he, though there is no one worthless among them, who will be charmed by the clothing he sees him wearing, but before their talk comes to an end, he will imagine that he has something more beautiful than the other. That is because it is not fitting for anyone to grieve in it. We shall then go to our dwellings and our wives will meet us and say, `Welcome; you have come with more excellent beauty than you had when you left us.' We shall reply, To-day we have had a meeting with our Lord, the Overpowering One, and it is fitting that we should come away as we have done'.\" \n\nTirmidhi and Ibn Majah trans - mitted it, Tirmidhi saying this is a gharib tradition"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5647",
        "url": "https://sunnah.com/mishkat:5647"
      },
      "grade": null
    },
    {
      "id": 120,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي سَعِيدٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَدْنَى أَهْلِ الْجَنَّةِ الَّذِي لَهُ ثَمَانُونَ أَلْفَ خَادِمٍ وَاثْنَتَانِ وَسَبْعُونَ زَوْجَةً وَتُنْصَبُ لَهُ قُبَّةٌ مِنْ لُؤْلُؤٍ وَزَبَرْجَدٍ وَيَاقُوتٍ كَمَا بَيْنَ الْجَابِيَةِ إِلَى صَنْعَاءَ»\nوَبِهَذَا الْإِسْنَاد قَالَ (ضَعِيف)\n: «وَمَنْ مَاتَ مِنْ أَهْلِ الْجَنَّةِ مِنْ صَغِيرٍ أَوْ كَبِيرٍ يُرَدُّونَ بَنِي ثَلَاثِينَ فِي الْجَنَّةِ لَا يَزِيدُونَ عَلَيْهَا أَبَدًا وَكَذَلِكَ أَهْلُ النَّارِ»\nوَبِهَذَا الْإِسْنَاد قَالَ (ضَعِيف)\n: «إِنَّ عليهمُ التيجانَ أَدْنَى لُؤْلُؤَةٍ مِنْهَا لَتُضِيءُ مَا بَيْنَ الْمَشْرِقِ والمغربِ»\nوَبِهَذَا الإِسناد قَالَ (صَحِيح لغيره)\n: «الْمُؤْمِنُ إِذَا اشْتَهَى الْوَلَدَ فِي الْجَنَّةِ كَانَ حَمْلُهُ وَوَضْعُهُ وَسِنُّهُ فِي سَاعَةٍ كَمَا يُشْتَهَى» وَقَالَ إِسْحَاقُ بْنُ إِبْرَاهِيمَ فِي هَذَا الْحَدِيثِ: إِذَا اشْتَهَى الْمُؤْمِنُ فِي الْجَنَّةِ الْوَلَدَ كَانَ فِي سَاعَة وَلَكِن لَا يَشْتَهِي (قَول اسحاق لَيْسَ من الحَدِيث)\nرَوَاهُ التِّرْمِذِيّ وَقَالَ: هَذَا حَدِيث غَرِيب. روى ابْن مَاجَه الرَّابِعَة والدارمي الْأَخِيرَة",
      "english": {
        "narrator": "",
        "text": "Abu Sa'id reported God's messenger as saying, \"The lowliest of the inhabitants of paradise will be he who has eighty thousand servants, seventy-two wives, and for whom a round pavilion of pearls, chrysoprase and rubies as large as the distance between al-Jabiya will be set up.\" By the same isnad he said, \"Those who are to go to paradise who die whether young or old will come into paradise aged thirty and never grow older. The same applies to those who will go to hell.\" By the same isnad he said, \"They will wear crowns the smallest pearl of which will illuminate the space between the east and the west.\" By the same isnad he said, \"When a believer in paradise wishes a child, its conception, delivery and growth to full age will be accomplished in a moment as he wishes.\" Ishaq b. Ibrahim said regarding this tradition that when a believer in paradise wishes a child it will come in a moment, \"But he will not wish one.\"\n    To the NE of the Lake of Tiberias. \n    Capital of the Yemen.\n\nTirmidhi transmitted it, saying this is a gharib tradition. Ibn Majah transmitted the fourth part, and Darimi the last statement."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5648",
        "url": "https://sunnah.com/mishkat:5648"
      },
      "grade": null
    },
    {
      "id": 121,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ عَلِيٍّ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:\nإِنَّ فِي الْجَنَّةِ لَمُجْتَمَعًا لِلْحُورِ الْعِينِ يَرْفَعْنَ بِأَصْوَاتٍ لَمْ تَسْمَعِ الْخَلَائِقُ مِثْلَهَا يَقُلْنَ: نَحْنُ الْخَالِدَاتُ فَلَا نَبِيدُ وَنَحْنُ النَّاعِمَاتُ فَلَا نَبْأَسُ وَنَحْنُ الرَّاضِيَاتُ فَلَا نَسْخَطُ طُوبَى لِمَنْ كانَ لنا وَكُنَّا لَهُ \". رَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "`Ali reported God's messenger as saying, \"In paradise there is a meeting-place for the large-eyed maidens who will raise voices such as created beings have never heard and say, `We are the women who live forever and do not pass away, we are the women in affluent circumstances who will not be destitute, we are the women who are pleased and not displeased. Blessed are those who belong to us and to whom we belong!\" \n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5649",
        "url": "https://sunnah.com/mishkat:5649"
      },
      "grade": null
    },
    {
      "id": 122,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن حكيمِ بن مُعَاوِيَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ فِي الْجَنَّةِ بَحْرُ الْمَاءِ وَبَحْرُ الْعَسَلِ وَبَحْرُ اللَّبَنِ وَبَحْرُ الْخَمْرِ ثُمَّ تشقَّقُ الأنهارُ بعدُ» . رَوَاهُ التِّرْمِذِيّ\nرَوَاهُ الدَّارمِيّ\nعَن مُعَاوِيَة",
      "english": {
        "narrator": "",
        "text": "Hakim b. Mu'awiya reported God's messenger as saying, \"In paradise there are a great river of water, a great river of honey, a great river of milk and a great river of wine; then the smaller rivers will be divided off.\" \n\nTirmidhi transmitted it, and Darimi transmitted it from Mu'awiya. (Mirqat, 5, 301 says this is most probably Mu'awiya b. Abu Sufyan because Hakim's father is not known to have been a Companion of the Prophet.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5650, 5651",
        "url": "https://sunnah.com/mishkat:5650"
      },
      "grade": "لم تتمّ دراسته (الألباني)"
    },
    {
      "id": 123,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "عَنْ أَبِي سَعِيدٍ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" إِنَّ الرَّجُلَ فِي الْجَنَّةِ لَيَتَّكِئُ فِي الْجَنَّةِ سَبْعِينَ مَسْنَدًا قَبْلَ أَنْ يَتَحَوَّلَ ثُمَّ تَأْتِيهِ امْرَأَةٌ فَتَضْرِبُ عَلَى مَنْكِبِهِ فَيَنْظُرُ وَجْهَهُ فِي خَدِّهَا أَصْفَى مِنَ الْمِرْآةِ وَإِنَّ أَدْنَى لُؤْلُؤَةٍ عَلَيْهَا تُضِيءُ مَا بينَ المشرقِ والمغربِ فتسلِّمُ عَلَيْهِ فيردُّ السلامَ وَيَسْأَلُهَا: مَنْ أَنْتِ؟ فَتَقُولُ: أَنَا مِنَ الْمَزِيدِ وَإِنَّهُ لَيَكُونُ عَلَيْهَا سَبْعُونَ ثَوْبًا فَيَنْفُذُهَا بَصَرُهُ حَتَّى يَرَى مُخَّ سَاقِهَا مِنْ وَرَاءِ ذَلِكَ وإِنَّ عَلَيْهَا من التيجان أَن أدنىلؤلؤة مِنْهَا لَتُضِيءُ مَا بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ \". رَوَاهُ أَحْمد",
      "english": {
        "narrator": "",
        "text": "Abu Sa'id reported God's messenger as saying, \"A man will recline in paradise on seventy pillows before he turns round. A woman will then come and strike him on the shoulder and he will see his face in her cheek clearer than a mirror. The smallest pearl she wears will illuminate the space between the east and the west. She will give him a salutation to which he will respond, and when he asks her who she is she will reply that she is some of the extra. She will be wearing seventy garments through which his eye will pierce so that he will see the marrow of her leg through them, and she will be wearing crowns the smallest pearl of which will illuminate the space between the east and the west.\" \n*Quran, 1, 35.\n\nAhmad transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5652",
        "url": "https://sunnah.com/mishkat:5652"
      },
      "grade": null
    },
    {
      "id": 124,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَحَدَّثُ - وَعِنْدَهُ رَجُلٌ مِنْ أَهْلِ الْبَادِيَةِ -: \n\" إِنَّ رَجُلًا مِنْ أَهْلِ الْجَنَّةِ اسْتَأْذَنَ رَبَّهُ فِي الزَّرْعِ. فَقَالَ لَهُ: أَلَسْتَ فِيمَا شِئْتَ؟ قَالَ: بَلَى وَلَكِنْ أُحِبُّ أَنْ أَزْرَعَ فَبَذَرَ فَبَادَرَ الطَّرْفَ نَبَاتُهُ وَاسْتِوَاؤُهُ وَاسْتِحْصَادُهُ فَكَانَ أَمْثَالَ الْجِبَالِ. فَيَقُولُ اللَّهُ تَعَالَى: دُونَكَ يَا ابْن آدم فَإِنَّهُ يُشْبِعُكَ شَيْءٌ \". فَقَالَ الْأَعْرَابِيُّ: وَاللَّهِ لَا تَجِدُهُ إِلَّا قُرَشِيًّا أَوْ أَنْصَارِيًّا فَإِنَّهُمْ أَصْحَابُ زَرْعٍ وَأَمَّا نَحْنُ فَلَسْنَا بِأَصْحَابِ زَرْعٍ فَضَحِكَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. رَوَاهُ الْبُخَارِيُّ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira said that one of the people of the desert was with the Prophet when he was telling that one of the inhabitants of paradise will ask his Lord's permission to cultivate crops, and He will reply, \"Do you not have what you have wished for?\" He will say, \"Yes; but I should like to cultivate crops.\" He will then sow seed and in less than the twinkling of an eye it will appear, grow to maturity and be reaped, like mountains in magnitude. God most high will then say, \"There you are, son of Adam, for nothing will satisfy you.\" Then the desert Arab said, \"I swear by God that we shall find him belonging to Quraish or to the Ansar, for they are agriculturists; but as for us, we are not agriculturists.\" Thereupon God's messenger laughed. \n\nBukhari transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5653",
        "url": "https://sunnah.com/mishkat:5653"
      },
      "grade": null
    },
    {
      "id": 125,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ جَابِرٍ قَالَ: سَأَلَ رَجُلٌ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: أَيَنَامُ أَهْلُ الْجَنَّةِ؟ قَالَ: «النَّوْمُ أَخُو الْمَوْتِ وَلَا يَمُوتُ أَهْلُ الجنةِ» . رواهُ البيهقيُّ فِي «شعب الْإِيمَان»",
      "english": {
        "narrator": "",
        "text": "Jabir told that when a man asked God's messenger whether the inhabitants of paradise would sleep, he replied, \"Sleep is the brother of death, and the inhabitants of paradise do not die.\" \n\nBaihaqi transmitted it in Shu'ab al-iman."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5654",
        "url": "https://sunnah.com/mishkat:5654"
      },
      "grade": null
    },
    {
      "id": 126,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "عَن جَرِيرِ بْنِ عَبْدُ اللَّهِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّكُمْ سَتَرَوْنَ رَبَّكُمْ عِيَانًا» . وَفِي رِوَايَةٍ: قَالَ: كُنَّا جُلُوسًا عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَنَظَرَ إِلَى الْقَمَرِ لَيْلَةَ الْبَدْرِ فَقَالَ: «إِنَّكُمْ سَتَرَوْنَ رَبَّكُمْ كَمَا تَرَوْنَ هَذَا الْقَمَرَ لَا تُضَامُونَ فِي رُؤْيَتِهِ فَإِنِ اسْتَطَعْتُمْ أَنْ لَا تُغْلَبُوا عَلَى صَلَاةٍ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ غُرُوبِهَا فَافْعَلُوا» ثُمَّ قَرَأَ (وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ غُرُوبهَا)\nمُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Jarir b. 'Abdallah reported God's messenger as saying, \"You will have ocular vision of your Lord.\" In a version he told that when they were sitting with God's messenger, he looked at the moon on the night when it was full and said, \"You will see your Lord as you see this moon and have no doubts about seeing Him. If, therefore, you can keep from being prevented from prayer before the sun rises and before it sets, do so.\" He then recited, \"Celebrate the praise of your Lord before the rising of the sun and before its setting.\" \n*Quran; 20:130\n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5655",
        "url": "https://sunnah.com/mishkat:5655"
      },
      "grade": "مُتَّفق عَلَيْهِ (الألباني)"
    },
    {
      "id": 127,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن صُهَيْب عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" إِذَا دَخَلَ أَهْلُ الْجَنَّةِ الْجَنَّةَ يَقُولُ اللَّهُ تَعَالَى: تُرِيدُونَ شَيْئًا أَزِيدُكُمْ؟ فَيَقُولُونَ: أَلَمْ تُبَيِّضْ وُجُوهَنَا؟ أَلَمْ تُدْخِلْنَا الْجَنَّةَ وَتُنَجِّنَا مِنَ النَّارِ؟ \" قَالَ: «فَيُرْفَعُ الْحِجَابُ فَيَنْظُرُونَ إِلَى وَجْهِ اللَّهِ فَمَا أُعْطُوا شَيْئًا أَحَبَّ إِلَيْهِمْ مِنَ النَّظَرِ إِلَى رَبِّهِمْ» ثُمَّ تَلَا (لِلَّذِينَ أَحْسَنُوا الْحُسْنَى وَزِيَادَة)\nرَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Suhaib reported the Prophet as saying, \"When the inhabitants of paradise enter it God most high will ask, `Do you wish me to give you anything more?' and they will reply, `Hast Thou not whitened our faces, hast Thou not brought us into paradise and saved us from hell?' The veil will then be removed, they will look at God's face, and will not have been given anything dearer to them than looking at their Lord.\" He then recited, \"Those who do good will have the best reward and something more.\"\n*Quran; 10:26\n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5656",
        "url": "https://sunnah.com/mishkat:5656"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 128,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "عَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَدْنَى أَهْلِ الْجَنَّةِ مَنْزِلَةً لَمَنْ يَنْظُرُ إِلَى جِنَانِهِ وَأَزْوَاجِهِ وَنَعِيمِهِ وَخَدَمِهِ وَسُرُرِهِ مَسِيرَةَ أَلْفِ سَنَةٍ وَأَكْرَمَهُمْ عَلَى اللَّهِ مَنْ يَنْظُرُ إِلَى وَجْهِهِ غُدْوَةً وَعَشِيَّةً» ثُمَّ قَرَأَ (وُجُوهٌ يَوْمَئِذٍ نَاضِرَةٌ إِلَى ربّها ناظرة)\nرَوَاهُ أَحْمد وَالتِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "Ibn `Umar reported God's messenger as saying. \"The lowest in station among the inhabitants of paradise will be he who looks at his gardens, his wives, his bliss, his servants, and his couches stretching a thousand years' journey, and the one who will be most honoured by God will be he who looks at His face morning and evening.\" He then recited, \"Faces on that day will be bright, looking at their Lord.\"\n*Quran; 75:22 f.\n\nAhmad and Tirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5657",
        "url": "https://sunnah.com/mishkat:5657"
      },
      "grade": "ضَعِيف (الألباني)"
    },
    {
      "id": 129,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن أبي رزين الْعقيلِيّ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ أَكُلُّنَا يَرَى رَبَّهُ مُخْلِيًا بِهِ يَوْمَ الْقِيَامَةِ؟ قَالَ: «بَلَى» . قَالَ: وَمَا آيَةُ ذَلِكَ فِي خَلْقِهِ؟ قَالَ: «يَا أَبَا رَزِينٍ أَلَيْسَ كُلُّكُمْ يَرَى الْقَمَرَ لَيْلَةَ البدرِ مُخْلِيًا بِهِ؟» قَالَ: بَلَى. قَالَ: «فَإِنَّمَا هُوَ خَلْقٌ مِنْ خَلْقِ اللَّهِ وَاللَّهُ أَجَلُّ وَأَعْظَمُ» . رَوَاهُ أَبُو دَاوُد",
      "english": {
        "narrator": "",
        "text": "Abu Razin al-`Uqaili told that he asked, \"Messenger of God, will each one of us see his Lord, being alone with Him, on the day of resurrection?\" and received the reply, \"Certainly.\" He asked, \"What sign is there of that in His creation?\" and received the reply, \"Abu Razin, does each one of you not see the moon on the night when it is full, being alone with it?\" When he agreed, he said, \"It is only a part of God's creation, but God is more glorious and greater.\" \n\nAbu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5658",
        "url": "https://sunnah.com/mishkat:5658"
      },
      "grade": null
    },
    {
      "id": 130,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "عَنْ أَبِي ذَرٍّ قَالَ سَأَلَتْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: هَلْ رَأَيْتَ رَبَّكَ؟ قَالَ: «نُورٌ أَنَّى أَرَاهُ» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Abu Dharr told that he asked God's messenger whether he had seen his Lord and received the reply, \"He is Light; how can I see Him?\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5659",
        "url": "https://sunnah.com/mishkat:5659"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 131,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن ابْن عَبَّاس: (مَا كَذَبَ الْفُؤَادُ مَا رَأَى. . . . وَلَقَدْ رَآهُ نزلة أُخْرَى)\nقَالَ: رَآهُ بِفُؤَادِهِ مَرَّتَيْنِ. رَوَاهُ مُسْلِمٌ\nوَفِي رِوَايَة لِلتِّرْمِذِي قَالَ: رَأَى مُحَمَّدٌ رَبَّهُ. قَالَ عِكْرِمَةُ قُلْتُ: أَلَيْسَ اللَّهُ يَقُولُ:\n(لَا تُدْرِكُهُ الْأَبْصَارُ وَهُوَ يدْرك الْأَبْصَار)\n؟ قَالَ: وَيحك إِذَا تَجَلَّى بِنُورِهِ الَّذِي هُوَ نُورُهُ وَقَدْ رأى ربه مرَّتَيْنِ",
      "english": {
        "narrator": "",
        "text": "Ibn `Abbas quoted, \"The heart did not belie what it saw,\" saying that he saw Him twice in his heart. \n    Quran; 53:11\n    Quran; 53:13\n\nMuslim transmitted it.\n\nIn Tirmidhi's version he said Muhammad saw his Lord. `Ikrima said he asked whether God does not say, \"The eyes do not perceive Him but He perceives the eyes,\" and he replied, \"Out upon you! That is when He shines forth with His own essential light; but he has seen his Lord twice.\"\n*Quran; 6:103\n\nTirmidhi."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5660",
        "url": "https://sunnah.com/mishkat:5660"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 132,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن الشّعبِيّ قَالَ: لَقِيَ ابْنُ عَبَّاسٍ كَعْبًا بِعَرَفَةَ فَسَأَلَهُ عَنْ شَيْءٍ فَكَبَّرَ حَتَّى جَاوَبَتْهُ الْجِبَالُ. فَقَالَ ابْنُ عَبَّاسٍ: إِنَّا بَنُو هَاشِمٍ. فَقَالَ كَعْبٌ: إِنَّ اللَّهَ قَسَّمَ رُؤْيَتَهُ وَكَلَامَهُ بَيْنَ مُحَمَّدٍ وَمُوسَى فَكَلَّمَ مُوسَى مَرَّتَيْنِ وَرَآهُ مُحَمَّدٌ مَرَّتَيْنِ. قَالَ مسروقٌ: فَدخلت على عَائِشَة فَقلت: هَل رَأَى مُحَمَّدٌ رَبَّهُ؟ فَقَالَتْ: لَقَدْ تَكَلَّمْتَ بِشَيْءٍ قَفَّ لَهُ شَعَرِي قُلْتُ: رُوَيْدًا ثُمَّ قَرَأْتُ (لقد رأى من آيَات ربّه الْكُبْرَى)\nفَقَالَتْ: أَيْنَ تَذْهَبُ بِكَ؟ إِنَّمَا هُوَ جِبْرِيلُ. مَنْ أَخْبَرَكَ أَنَّ مُحَمَّدًا رَأَى رَبَّهُ أَوْ كَتَمَ شَيْئًا مِمَّا أُمِرَ بِهِ أَوْ يَعْلَمُ الْخَمْسَ الَّتِي قَالَ اللَّهُ تَعَالَى: (إِنَّ اللَّهَ عِنْدَهُ عِلْمُ السَّاعَةِ وَيُنَزِّلُ الْغَيْثَ)\nفَقَدْ أَعْظَمَ الْفِرْيَةَ وَلَكِنَّهُ رَأَى جِبْرِيلَ لَمْ يَرَهُ فِي صُورَتِهِ إِلَّا مَرَّتَيْنِ: مَرَّةً عِنْدَ سِدْرَةِ الْمُنْتَهَى وَمَرَّةً فِي أَجْيَادٍ لَهُ سِتُّمِائَةِ جَنَاحٍ قَدْ سَدَّ الْأُفُقَ \" رَوَاهُ التِّرْمِذِيُّ\nوَرَوَى الشَّيْخَانِ مَعَ زِيَادَةٍ وَاخْتِلَافٍ وَفِي رِوَايَتِهِمَا: قَالَ: قُلْتُ لِعَائِشَةَ: فَأَيْنَ قَوْلُهُ (ثُمَّ دَنَا فَتَدَلَّى فَكَانَ قَابَ قَوْسَيْنِ أَوْ أَدْنَى)\n؟ قَالَتْ: ذَاكَ جِبْرِيلُ عَلَيْهِ السَّلَامُ كَانَ يَأْتِيهِ فِي صُورَةِ الرَّجُلِ وَإِنَّهُ أَتَاهُ هَذِهِ الْمَرَّةَ فِي صُورَتِهِ الَّتِي هِيَ صُورَتُهُ فَسَدَّ الْأُفُقَ",
      "english": {
        "narrator": "",
        "text": "Ash-Sha'bi told that Ibn `Abbas met Ka`b at `Arafa and asked him about something, whereupon he said \"God is most great\" so loudly that the mountains re-echoed his voice. Ibn `Abbas said, \"We are the B. Hashim,\" and Ka'b replied, \"God has divided the vision of Him and His speech between Muhammad and Moses, for He spoke twice to Moses and Muhammad saw Him twice.\" Masruq said he went to visit `A'isha and asked whether Muhammad had seen his Lord, whereupon she replied, \"You have said something that makes my hair stand on end.\" Telling her not to be excited he recited, \"He has indeed seen the greatest of the signs of his Lord1.\" She replied, \"where is it leading you? It was only Gabriel. Who told you that Muhammad saw his Lord, or concealed any command given him, or knew the five things of which God most high said, `God has knowledge of the last hour, He sends down the rain 2? He considered falsehood to be serious. But he saw Gabriel, seeing him in bodily form only twice, once at the lote-tree of the boundary, and once at Ajyad3 with six hundred wings blocking out the horizon.\" \n\n Quran; 53:18\n Quran; 31:34\n A place in the neighbourhood of Makkah.\n\nTirmidhi transmitted it, and the two shaikhs transmitted it with an addition and a difference.\n\nIn their version he told that he asked `A'isha the meaning of His words, \"Then he drew near and was suspended, and was two bows' length away or nearer, \"and she replied, \"That was Gabriel who used to come to him in human form, but on this occasion he came to him in his own form in which he was fashioned and blocked out the horizon.\"\n\n Quran; 53:8"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5661",
        "url": "https://sunnah.com/mishkat:5661"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 133,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن ابْن مَسْعُود فِي قَوْلِهِ: (فَكَانَ قَابَ قَوْسَيْنِ أَوْ أَدْنَى)\nوَفِي قَوْلِهِ: (مَا كَذَبَ الْفُؤَادُ مَا رَأَى)\nوَفِي قَوْلِهِ: (رَأَى مِنْ آيَاتِ رَبِّهِ الْكُبْرَى)\nقَالَ فِيهَا كُلِّهَا: رَأَى جِبْرِيلَ عَلَيْهِ السَّلَامُ لَهُ سِتُّمِائَةِ جَنَاحٍ. مُتَّفَقٌ عَلَيْهِ\nوَفِي رِوَايَةِ التِّرْمِذِيِّ قَالَ: (مَا كَذَبَ الْفُؤَادُ مَا رَأَى)\nقَالَ: رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جِبْرِيلَ فِي حُلَّةٍ مِنْ رَفْرَفٍ قَدْ مَلَأَ مَا بَيْنَ السَّمَاءِ وَالْأَرْضِ\nوَلَهُ وَلِلْبُخَارِيِّ فِي قَوْلِهِ: (لَقَدْ رَأَى مِنْ آيَاتِ رَبِّهِ الْكُبْرَى)\nقَالَ: رَأَى رَفْرَفًا أَخْضَرَ سَدَّ أُفُقَ السَّمَاءِ",
      "english": {
        "narrator": "",
        "text": "Ibn Mas'ud said regarding God's words, \"He was two bows' length away or nearer,\" \"The heart did not belie what it saw,\" and \"He has indeed seen the greatest of the signs of his Lord,\" that they all refer to his seeing Gabriel who had six hundred wings. \n\n(Bukhari and Muslim.)\n\nIn Tirmidhi's version he said regarding \"The eye did not belie what it saw\" that God's messenger saw Gabriel in a mantle of thin brocade, filling the space between the sky and the earth. \n\nTirmidhi and Bukhari tell regarding His words, \"He has indeed seen the greatest of the signs of his Lord,\" that he saw thin green brocade which blocked out the horizon in the sky."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5662",
        "url": "https://sunnah.com/mishkat:5662"
      },
      "grade": "مُتَّفق عَلَيْهِ (الألباني)"
    },
    {
      "id": 134,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وسُئل مَالك بن أَنسٍ عَن قَوْله تَعَالَى (إِلى ربِّها ناظرة)\nفَقِيلَ: قَوْمٌ يَقُولُونَ: إِلَى ثَوَابِهِ. فَقَالَ مَالِكٌ: كَذَبُوا فَأَيْنَ هُمْ عَنْ قَوْلُهُ تَعَالَى: (كَلَّا إِنَّهُمْ عَنْ رَبِّهِمْ يَوْمَئِذٍ لمحجوبونَ)\n؟ قَالَ مَالِكٌ النَّاسُ يَنْظُرُونَ إِلَى اللَّهِ يَوْمَ الْقِيَامَةِ بِأَعْيُنِهِمْ وَقَالَ: لَوْ لَمْ يَرَ الْمُؤْمِنُونَ رَبَّهُمْ يَوْمَ الْقِيَامَةِ لَمْ يُعَيِّرِ اللَّهُ الْكَفَّارَ بِالْحِجَابِ فَقَالَ (كَلَّا إِنَّهُمْ عَنْ رَبِّهِمْ يَوْمَئِذٍ لمحجوبون)\nرَوَاهُ فِي «شرح السّنة»",
      "english": {
        "narrator": "",
        "text": "Malik b. Anas was asked about the words of God most high, \"Looking towards their Lord?\" Malik said men would look at their Lord with their eyes on the day of resurrection, adding, \"If the believers were not to look at their Lord on the day of resurrection God would not have reproached the infidels with being veiled saying, `Nay, on that day they shall be veiled from their Lord'.\" \n Quran; 75:23\n Quran; 83:15. This verse refers to unbelievers.\n\nIt is transmitted in Sharh as-sunna."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5663",
        "url": "https://sunnah.com/mishkat:5663"
      },
      "grade": "لم تتمّ دراسته (الألباني)"
    },
    {
      "id": 135,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ جَابِرٌ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" بَيْنَا أَهْلُ الْجَنَّةِ فِي نَعِيمِهِمْ إِذْ سَطَعَ نورٌ فَرفعُوا رؤوسَهم فَإِذَا الرَّبُّ قَدْ أَشْرَفَ عَلَيْهِمْ مِنْ فَوْقِهِمْ فَقَالَ: السَّلَامُ عَلَيْكُمْ يَا أَهْلَ الْجَنَّةِ قَالَ: وَذَلِكَ قَوْلُهُ تَعَالَى (سَلَامٌ قَوْلًا مِنْ رَبٍّ رحيمٍ)\nقَالَ: فَيَنْظُرُ إِلَيْهِمْ وَيَنْظُرُونَ إِلَيْهِ فَلَا يَلْتَفِتُونَ إِلَى شَيْءٍ مِنَ النَّعِيمِ مَا دَامُوا يَنْظُرُونَ إِلَيْهِ حَتَّى يَحْتَجِبَ عَنْهُمْ وَيَبْقَى نُورُهُ وَبَرَكَتُهُ عَلَيْهِم فِي دِيَارهمْ \". رَوَاهُ ابْن مَاجَه",
      "english": {
        "narrator": "",
        "text": "Jabir reported the Prophet as saying, \"While the inhabitants of paradise are in their bliss a light will shine out to them, and raising their heads they will see that their Lord has looked down on them from above. He will then say, `Peace be to you, inhabitants of paradise,' the proof of that being the words of God most high, `Peace, a word from a merciful Lord.' He will then look at them and they will look at Him, and they will not turn aside to any of their bliss as long as they are looking at Him till He veils Himself from them and His light remains.\" \n*Quran; 36:58\n\nIbn Majah transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5664",
        "url": "https://sunnah.com/mishkat:5664"
      },
      "grade": null
    },
    {
      "id": 136,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «نَارُكُمْ جُزْءٌ مِنْ سَبْعِينَ جُزْءًا مِنْ نَارِ جَهَنَّمَ» قِيلَ: يَا رَسُولَ اللَّهِ إِنْ كَانَتْ لَكَافِيَةً قَالَ: «فُضِّلَتْ عَلَيْهِنَّ بِتِسْعَةٍ وَسِتِّينَ جُزْءًا كُلُّهُنَّ مِثْلُ حَرِّهَا» . مُتَّفَقٌ عَلَيْهِ. وَاللَّفْظُ لِلْبُخَارِيِّ. وَفِي رِوَايَةِ مُسْلِمٍ: «نَارُكُمُ الَّتِي يُوقِدُ ابْنُ آدَمَ» . وَفِيهَا: «عَلَيْهَا» و «كلهَا» بدل «عَلَيْهِنَّ» و «كُلهنَّ»",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported God's messenger as saying, \"The fire you have is one-seventieth part of the fire of Jahannam.\" Someone suggested that if it were ordinary fire, it would be enough, but he replied, \"It has sixty-nine parts in excess of fires in this world, each of them being equivalent to their heat.\" \n\n(Bukhari and Muslim, the wording being Bukhari's.) Muslim's version has \"Your fire which the son of Adam kindles,\" and uses the feminine singular pronoun instead of the feminine plural. (This is a matter which makes no difference to the translation, but is purely connected with different forms of expression allowable in Arabic grammar."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5665",
        "url": "https://sunnah.com/mishkat:5665"
      },
      "grade": "مُتَّفق عَلَيْهِ (الألباني)"
    },
    {
      "id": 137,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنِ ابْنِ مَسْعُودٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يُؤْتَى بِجَهَنَّمَ يَوْمَئِذٍ لَهَا سَبْعُونَ أَلْفَ زِمَامٍ مَعَ كُلِّ زِمَامٍ سبعونَ ألفَ مَلَكٍ يجرُّونها» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Ibn Mas'ud reported God's messenger as saying, \"Jahannam will be brought on that day having seventy thousand halters, each being pulled by seventy thousand angels.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5666",
        "url": "https://sunnah.com/mishkat:5666"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 138,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنِ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَهْوَنَ أَهْلِ النَّارِ عَذَابًا مَنْ لَهُ نَعْلَانِ وَشِرَاكَانِ مِنْ نَارٍ يَغْلِي مِنْهُمَا دِمَاغُهُ كَمَا يَغْلِي الْمِرْجَلُ مَا يُرَى أَنَّ أَحَدًا أَشَدُّ مِنْهُ عَذَابًا وَإِنَّهُ لَأَهْوَنُهُمْ عَذَابًا» . مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "An-Nu`man b. Bashir reported God's messenger as saying, \"The inhabitant of hell who will have the lightest punishment will be he who has two sandals and two sandal-straps of fire from which his brain will bubble like a pot, and he will think that no one is having a more severe punishment than he, although he is having the lightest punishment.\" \n\n(Bukhari and Muslim;)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5667",
        "url": "https://sunnah.com/mishkat:5667"
      },
      "grade": "مُتَّفق عَلَيْهِ (الألباني)"
    },
    {
      "id": 139,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ أَهْوَنَ أَهْلِ النَّارِ عَذَابًا أَبُو طَالِبٍ وَهُوَ مُنْتَعِلٌ بِنَعْلَيْنِ يغلي مِنْهُمَا دماغه» . رَوَاهُ البُخَارِيّ",
      "english": {
        "narrator": "",
        "text": "Ibn `Abbas reported God's messenger as saying, \"The inhabitant of hell who will have the lightest punishment will be Abu Talib, and he will be wearing two sandals from which his brain will bubble.\" \n\nBukhari transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5668",
        "url": "https://sunnah.com/mishkat:5668"
      },
      "grade": "صَحِيحٌ (الألباني)"
    },
    {
      "id": 140,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَنَسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" يُؤْتَى بِأَنْعَمِ أَهْلِ الدُّنْيَا مِنْ أَهْلِ النَّارِ يَوْمَ الْقِيَامَةِ فَيُصْبَغُ فِي النارِ صَبْغَةً ثمَّ يُقَال: يَا ابْنَ آدَمَ هَلْ رَأَيْتَ خَيْرًا قَطُّ؟ هَلْ مَرَّ بِكَ نَعِيمٌ قَطُّ؟ فَيَقُولُ: لَا وَاللَّهِ يَا رَبِّ وَيُؤْتَى بِأَشَدِّ النَّاسِ بُؤْسًا فِي الدُّنْيَا مِنْ أَهْلِ الْجَنَّةِ فَيُصْبَغُ صَبْغَةً فِي الْجَنَّةِ فَيُقَالُ لَهُ: يَا ابْنَ آدَمَ هَلْ رَأَيْتَ بُؤْسًا قَطُّ؟ وَهَلْ مَرَّ بِكَ شِدَّةٌ قَطُّ. فَيَقُولُ: لَا وَاللَّهِ يَا رَبِّ مَا مَرَّ بِي بُؤْسٌ قَطُّ وَلَا رَأَيْتُ شدَّة قطّ \". رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Anas reported God's messenger as saying, \"The one among the inhabitants of hell who had the pleasantest life in the world will be brought on the day of resurrection and dipped once in hell. Then will be said, `Son of Adam, have you ever experienced any good? Has any pleasantness come your way?' to which he will reply, `No, my Lord, I swear by God.' Then the one among the inhabitants of paradise who had the most miserable life in the world will be brought and dipped once in paradise. Then will be said, `Son of Adam, have you ever experienced any misfortune? Has any distress come your way?' to which he will reply, `No, my Lord, I swear by God, no misfortune has ever come my way, and I have never experienced any distress'.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5669",
        "url": "https://sunnah.com/mishkat:5669"
      },
      "grade": "صَحِيحٌ (الألباني)"
    },
    {
      "id": 141,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" يَقُولُ اللَّهُ لِأَهْوَنِ أَهْلِ النَّارِ عَذَابًا يَوْمَ الْقِيَامَةِ: لَوْ أَنَّ لَكَ مَا فِي الْأَرْضِ مِنْ شَيْءٍ أَكَنْتَ تَفْتَدِي بِهِ؟ فَيَقُولُ: نَعَمْ. فَيَقُولُ: أَرَدْتُ مِنْكَ أَهْوَنَ مِنْ هَذَا وَأَنْتَ فِي صُلْبِ آدَمَ أَنْ لَا تُشْرِكَ بِي شَيْئًا فَأَبَيْتَ إِلَّا أَنْ تُشْرِكَ بِي \". مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "He quoted the Prophet as stating that on the day of resurrection God will say to the inhabitant of hell who has the lightest punishment, \" If you had everything the earth contains would you seek to ransom yourself with it? \" and when he replies that he would, He will say, \"I desired less than that from you when you were in Adam's loins, viz. that you should associate nothing with Me, but you insisted on associating others with Me.\" \n*The reference here is to what is mentioned in Quran, 7:172, regarding the covenant with the descendants of Adam. \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5670",
        "url": "https://sunnah.com/mishkat:5670"
      },
      "grade": "مُتَّفق عَلَيْهِ (الألباني)"
    },
    {
      "id": 142,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ سَمُرَةَ بْنِ جُنْدُبٍ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «مِنْهُمْ مَنْ تَأْخُذُهُ النَّارُ إِلَى كَعْبَيْهِ وَمِنْهُمْ مَنْ تَأْخُذُهُ النَّارُ إِلَى رُكْبَتَيْهِ وَمِنْهُمْ مَنْ تَأْخُذُهُ النَّارُ إِلَى حُجْزَتِهِ وَمِنْهُمْ مَنْ تَأْخُذُهُ النَّار إِلَى ترقوته» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Samura b. Jundub reported the Prophet as saying, \"There will be some to whose ankles the fire will reach, some to whose knees the fire will reach, some to whose waist the fire will reach, and some to whose collar-bone the fire will reach.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5671",
        "url": "https://sunnah.com/mishkat:5671"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 143,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا بَيْنَ مَنْكِبَيِ الْكَافِرِ فِي النَّارِ مَسِيرَةَ ثَلَاثَةِ أَيَّامٍ لِلرَّاكِبِ الْمُسْرِعِ» . وَفِي رِوَايَةٍ: «ضِرْسُ الْكَافِرِ مِثْلُ أُحُدٍ وَغِلَظُ جِلْدِهِ مَسِيرَةُ ثَلَاثٍ» . رَوَاهُ مُسْلِمٌ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported God's messenger as saying, \"The distance between the shoulders of an infidel in hell will be a three days' journey for a swift rider.\" A version says the molar tooth of an infidel will be like Uhud and the thickness of his skin a three nights' journey. \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5672",
        "url": "https://sunnah.com/mishkat:5672"
      },
      "grade": null
    },
    {
      "id": 144,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أُوقِدَ عَلَى النَّارِ أَلْفَ سَنَةٍ حَتَّى احْمَرَّتْ ثُمَّ أُوقِدَ عَلَيْهَا أَلْفَ سَنَةٍ حَتَّى ابْيَضَّتْ ثُمَّ أُوقِدَ عَلَيْهَا أَلْفَ سَنَةٍ حَتَّى اسْوَدَّتْ فَهِيَ سَوْدَاءُ مُظْلِمَةٌ» . رَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported the Prophet as saying, \"Hell was kindled for a thousand years till it became red, then it was kindled for a thousand years till it became white, then it was kindled for a thousand years till it became black, and it is black and dark.\" \n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5673",
        "url": "https://sunnah.com/mishkat:5673"
      },
      "grade": "ضَعِيف (الألباني)"
    },
    {
      "id": 145,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «ضِرْسُ الْكَافِرِ يَوْمَ الْقِيَامَةِ مِثْلُ أُحُدٍ وَفَخِذُهُ مِثْلُ الْبَيْضَاءِ وَمَقْعَدُهُ مِنَ النَّارِ مسيرَة ثَلَاث مثل الربذَة» . رَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"On the day of resurrection the molar tooth of an infidel will be like Uhud, his thigh like al-Baida'.\"\n  There are various places with this name. Mirqat, 5, 314, quotes the vague statement that it is a mountain. It is the name of an acclivity near Mecca leading to at-Tanim. Cf. Yaqut, Mu'jam, 1, 792 ff., for different explanations. \n  A place not far from Madinah. There is another in Najd. Cf., Yaqut, Mu'jam, 2, 749.\n   \nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5674",
        "url": "https://sunnah.com/mishkat:5674"
      },
      "grade": null
    },
    {
      "id": 146,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ غِلَظَ جِلْدِ الْكَافِرِ اثْنَانِ وَأَرْبَعُونَ ذِرَاعًا وَإِنَّ ضِرْسَهُ مِثْلُ أُحُدٍ وَإِنَّ مَجْلِسَهُ مِنْ جَهَنَّمَ مَا بَيْنَ مَكَّةَ وَالْمَدِينَةِ» . رَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"The thickness of an infidel's skin will be forty-two cubits, his molar tooth will be like Uhud, and his seat in Jahannam will be like the distance between Mecca and Medina.\" \n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5675",
        "url": "https://sunnah.com/mishkat:5675"
      },
      "grade": null
    },
    {
      "id": 147,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الْكَافِرَ لَيُسْحَبُ لسانُه الفرسَخ والفرسخين يتوطَّؤُه النَّاس» . رَوَاهُ أَحْمد وَالتِّرْمِذِيّ وَقَالَ: هَذَا حَيْثُ غَرِيب",
      "english": {
        "narrator": "",
        "text": "Ibn `Umar reported God's messenger as saying, \"The infidel will drag his tongue a league and two leagues with people treading on it.\" \n\nAhmad and Tirmidhi transmitted it, the latter saying this is a gharib tradition."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5676",
        "url": "https://sunnah.com/mishkat:5676"
      },
      "grade": null
    },
    {
      "id": 148,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن أبي سعيد  عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الصَّعُودُ جَبَلٌ مِنْ نَارٍ يُتَصَعَّدُ فِيهِ سَبْعِينَ خَرِيفًا وَيُهْوَى بِهِ كَذَلِكَ فِيهِ أَبَدًا» . رَوَاهُ التِّرْمِذِي",
      "english": {
        "narrator": "",
        "text": "Abu Sa`id reported God's messenger as saying, \"The ascent is a mountain in hell up which people will be made to climb for seventy years and down which they will be made to fall a like distance, and so on forever.\" \n*Quran; 74:17.\n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5677",
        "url": "https://sunnah.com/mishkat:5677"
      },
      "grade": null
    },
    {
      "id": 149,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ فِي قَوْله: (كَالْمهْلِ) أَيْ كَعَكَرِ الزَّيْتِ فَإِذَا قُرِّبَ إِلَى وَجْهِهِ سَقَطت فَرْوَة وَجهه فِيهِ\nرَوَاهُ التِّرْمِذِيّّّّّّّ",
      "english": {
        "narrator": "",
        "text": "He reported the Prophet as saying about God's words, \"Like molten copper,\" that it is like the sediment of olive-oil, and that when it approaches one's face the skin of one's face will fall into it.\" \n*Quran; 18:29; 44:45; 70:8\n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5678",
        "url": "https://sunnah.com/mishkat:5678"
      },
      "grade": null
    },
    {
      "id": 150,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّ الْحَمِيمَ لَيُصَبُّ عَلَى رؤوسهم فَينفذ الْحَمِيم حَتَّى يخلص إِلَى جَوْفه فسلت مَا فِي جَوْفِهِ حَتَّى يَمْرُقَ مِنْ قَدَمَيْهِ وَهُوَ الصَّهْرُ ثُمَّ يُعَادُ كَمَا كَانَ» . رَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported the Prophet as saying, \"The hot water.\" \n    Quran; 22:19\n    Quran; 22:20\n    Quran; 4:56\n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5679",
        "url": "https://sunnah.com/mishkat:5679"
      },
      "grade": null
    },
    {
      "id": 151,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي أُمَامَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي قَوْلِهِ: (يُسْقَى مِنْ مَاءٍ صديد يتجرَّعُه)\nقَالَ: \" يُقَرَّبُ إِلَى فِيهِ فَيَكْرَهُهُ فَإِذَا أُدْنِي مِنْهُ شَوَى وَجْهَهُ وَوَقَعَتْ فَرْوَةُ رَأْسِهِ فَإِذَا شَرِبَهُ قَطَّعَ أَمْعَاءَهُ حَتَّى يَخْرُجَ مِنْ دُبُرِهِ. يَقُولُ اللَّهُ تَعَالَى: (وَسُقُوا مَاءً حَمِيمًا فَقَطَّعَ أمعاءهم)\nوَيَقُولُ: (وَإِنْ يَسْتَغِيثُوا يُغَاثُوا بِمَاءٍ كَالْمُهْلِ يَشْوِي الْوُجُوه بئس الشَّرَاب)\nرَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "Abu Umama reported the Prophet as saying about God's words, \"He will be given to drink some liquid pus which he will gulp!\" \n    Quran; 14:16 f.\n    Quran; 47:15\n    Quran; 18:29\n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5680",
        "url": "https://sunnah.com/mishkat:5680"
      },
      "grade": null
    },
    {
      "id": 152,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: لِسُرَادِقِ النَّارِ أَرْبَعَةُ جُدُرِ كِثَف كل جِدَار مسيرَة أَرْبَعِينَ سنة \". رَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "Abu Sa'id al-Khudri reported the Prophet as saying, \"The awnings of hell have four thick walls, each wall a distance of forty years.\" \n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5681",
        "url": "https://sunnah.com/mishkat:5681"
      },
      "grade": null
    },
    {
      "id": 153,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَوْ أَنَّ دَلْوًا مِنْ غَسَّاقٍ يَهَرَاقُ فِي الدُّنْيَا لَأَنْتَنَ أَهْلُ الدُّنْيَا» . رَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"If a bucket of the pus of the inhabitants of hell were poured into the world, the people in the world would have an offensive stench.\" \n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5682",
        "url": "https://sunnah.com/mishkat:5682"
      },
      "grade": null
    },
    {
      "id": 154,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنِ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَرَأَ هَذِهِ الْآيَةَ: (اتَّقُوا اللَّهَ حَقَّ تُقَاتِهِ وَلَا تَمُوتُنَّ إِلَّا وَأَنْتُم مُسلمُونَ)\nقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَو أَن قَطْرَة من الزقوم قطرات فِي دَارِ الدُّنْيَا لَأَفْسَدَتْ عَلَى أَهْلِ الْأَرْضِ مَعَايِشَهُمْ فَكَيْفَ بِمَنْ يَكُونُ طَعَامَهُ؟» رَوَاهُ التِّرْمِذِيُّ وَقَالَ: هَذَا حَدِيثٌ حَسَنٌ صَحِيحٌ",
      "english": {
        "narrator": "",
        "text": "Ibn `Abbas told that God's messenger recited this verse, \"Fear God as He ought to be feared, and die only as Muslims were to fall on this world it would corrupt the people's means of livelihood, so what about those whose food it is?\" \n    Quran; 3:102\n    A tree growing in the bottom of hell. Cf. Quran; 37:62, 44:43; also 17:60.\n\nTirmidhi transmitted it, saying this is a hasan sahih tradition."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5683",
        "url": "https://sunnah.com/mishkat:5683"
      },
      "grade": "صَحِيحٌ (الألباني)"
    },
    {
      "id": 155,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي سَعِيدٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: (وهم فِيهَا كَالِحُونَ) قَالَ: «تَشْوِيهِ النَّارُ فَتَقَلَّصُ شَفَتُهُ الْعُلْيَا حَتَّى تَبْلُغَ وَسْطَ رَأْسِهِ وَتَسْتَرْخِي شَفَتُهُ السُّفْلَى حَتَّى تضرب سُرَّتَهُ» . رَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "Abu Sa'id reported the Prophet as saying regarding \"And they in it will be showing their teeth,\" that the fire will roast a person and his upper lip will retract till it reaches the middle of his head, and his lower lip will hang down till it strikes his navel.\" \n*Quran; 23:104\n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5684",
        "url": "https://sunnah.com/mishkat:5684"
      },
      "grade": null
    },
    {
      "id": 156,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَنَسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَا أَيُّهَا النَّاسُ ابْكُوا فَإِنْ لَمْ تَسْتَطِيعُوا فَتَبَاكَوْا فَإِنَّ أَهْلَ النَّارِ يَبْكُونَ فِي النَّارِ حَتَّى تَسِيلَ دُمُوعُهُمْ فِي وُجُوهِهِمْ كَأَنَّهَا جَدَاوِلُ حَتَّى تَنْقَطِعَ الدُّمُوعُ فَتَسِيلَ الدِّمَاءُ فَتَقَرَّحَ الْعُيُونُ فَلَوْ أَنَّ سُفُنًا أُزْجِيَتْ فِيهَا لجَرَتْ» . رَوَاهُ فِي «شرح السّنة»",
      "english": {
        "narrator": "",
        "text": "Anas reported the Prophet as saying, \"O people, weep, but if you are unable to do so, then pretend to weep, for the inhabitants of hell will weep in hell till their tears flow on their faces as though they were streams, and when the tears stop blood will flow and the eyes will be made sore. If ships were blown along in them, they could sail.\" \n\nIt is transmitted in Sharh as-sunna."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5685",
        "url": "https://sunnah.com/mishkat:5685"
      },
      "grade": null
    },
    {
      "id": 157,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي الدَّرْدَاءِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" يُلْقَى عَلَى أَهْلِ النَّارِ الْجُوعُ فَيَعْدِلُ مَا هُمْ فِيهِ مِنَ الْعَذَابِ فَيَسْتَغِيثُونَ فَيُغَاثُونَ بِطَعَامٍ مِنْ ضَرِيعٍ لَا يُسْمِنُ وَلَا يُغْنِي مِنْ جُوعٍ فَيَسْتَغِيثُونَ بِالطَّعَامِ فَيُغَاثُونَ بِطَعَامٍ ذِي غُصَّةٍ فَيَذْكُرُونَ أَنَّهُمْ كَانُوا يُجِيزُونَ الْغُصَصَ فِي الدُّنْيَا بِالشَّرَابِ فَيَسْتَغِيثُونَ بِالشَّرَابِ فَيُرْفَعُ إِلَيْهِمُ الْحَمِيمُ بِكَلَالِيبِ الْحَدِيدِ فَإِذَا دَنَتْ مِنْ وُجُوهِهِمْ شَوَتْ وُجُوهَهُمْ فَإِذَا دَخَلَتْ بُطُونَهُمْ قطعتْ مَا فِي بطونِهم فيقولونَ: ادْعوا خَزَنَةَ جهنمَ فيقولونَ: أَلمْ تَكُ تَأْتِيكُمْ رُسُلُكُمْ بِالْبَيِّنَاتِ؟ قَالُوا: بَلَى. قَالُوا: فَادْعُوا وَمَا دُعَاءُ الْكَافِرِينَ إِلَّا فِي ضَلَالٍ \" قَالَ: \" فيقولونَ: ادْعوا مَالِكًا فيقولونَ: يَا مالكُ ليَقْضِ علَينا ربُّكَ \" قَالَ: «فيُجيبُهم إِنَّكم ماكِثونَ» . قَالَ الْأَعْمَشُ: نُبِّئْتُ أَنَّ بَيْنَ دُعَائِهِمْ وَإِجَابَةِ مَالِكٍ إِيَّاهُمْ أَلْفَ عَامٍ. قَالَ: \" فَيَقُولُونَ: ادْعُوا رَبَّكُمْ فَلَا أَحَدَ خَيْرٌ مِنْ رَبِّكُمْ فَيَقُولُونَ: رَبَّنَا غَلَبَتْ عَلَيْنَا شِقْوَتُنَا وَكُنَّا قَوْمًا ضَالِّينَ رَبَّنَا أَخْرِجْنَا مِنْهَا فَإِنْ عُدْنَا فَإِنَّا ظَالِمُونَ \" قَالَ: \" فيُجيبُهم: اخْسَؤوا فِيهَا وَلَا تُكلمونِ \" قَالَ: «فَعِنْدَ ذَلِكَ يَئِسُوا مِنْ كُلِّ خَيْرٍ وَعِنْدَ ذَلِكَ يَأْخُذُونَ فِي الزَّفِيرِ وَالْحَسْرَةِ وَالْوَيْلِ» . قَالَ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ: وَالنَّاسُ لَا يرفعونَ هَذَا الحديثَ. رَوَاهُ الترمذيُّ",
      "english": {
        "narrator": "",
        "text": "Abud Darda' reported God's messenger as saying, \"Hunger will be cast upon the inhabitants of hell and will be equal to the punishment they are experiencing. They will cry for help and will be helped with food of dari'  said that people do not trace this tradition back to the Prophet. \n1. Cf. Qur'an, 88:6. The name of a thorny plant which animals avoid. It is used in the Qur'an of some substance which, as Taj al-'arus says, is more bitter than aloes, more offensive than a corpse, and hotter than fire. \n2. Cf. Qur'an, 73:13. \n3. Cf. Qur'an, 22:19 f. \n4. Qur'an, 40:50. \n5. Qur'an, 43:77. Malik is the angel in charge of hell. \n6. One of the transmitters of the tradition. \n7. Qur'an, 23:106 ff. \n8. i.e., Darimi, whose Musnad is frequently quoted.\n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5686",
        "url": "https://sunnah.com/mishkat:5686"
      },
      "grade": null
    },
    {
      "id": 158,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنِ النُّعْمَانِ بْنِ بَشِيرٍ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: «أَنْذَرْتُكُمُ النَّارَ أَنْذَرْتُكُمُ النَّارَ» فَمَا زَالَ يَقُولُهَا حَتَّى لَوْ كَانَ فِي مَقَامِي هَذَا سَمِعَهُ أَهْلُ السُّوقِ وَحَتَّى سَقَطَتْ خَمِيصَةٌ كَانَتْ عَلَيْهِ عِنْدَ رجلَيْهِ. رَوَاهُ الدَّارمِيّ",
      "english": {
        "narrator": "An-Nu'man b. Bashir said:",
        "text": "I heard God's messenger say, \"I have warned you of hell, I have warned you of hell,\" and he kept on saying it so loudly that if he had been where I am just now the people in the street would be able to hear it. He went on till a cloak he was wearing fell down at his feet. \n\nDarimi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5687",
        "url": "https://sunnah.com/mishkat:5687"
      },
      "grade": null
    },
    {
      "id": 159,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَوْ أَنَّ رَصَاصَةً مِثْلَ هَذِهِ - وَأَشَارَ إِلَى مِثْلِ الْجُمْجُمَةِ - أُرْسِلَتْ مِنَ السَّمَاءِ إِلَى الْأَرْضِ وَهِيَ مَسِيرَةُ خَمْسِمِائَةِ سَنَةٍ لَبَلَغَتِ الْأَرْضَ قَبْلَ اللَّيْلِ وَلَوْ أَنَّهَا أُرْسِلَتْ مِنْ رَأْسِ السِّلْسِلَةِ لَسَارَتْ أَرْبَعِينَ خَرِيفًا اللَّيْلَ وَالنَّهَارَ قَبْلَ أنْ تبلع أَصْلهَا أَو قعرها» رَوَاهُ التِّرْمِذِيّ",
      "english": {
        "narrator": "",
        "text": "`Abdallah b. `Amr b. al-`As told that God's messenger pointed to something like a bowl and said, \"If a piece of lead like this were sent from heaven to earth, which is a journey of five hundred years, it would reach the earth before night; and if it were sent from the top of the chain it would travel forty years night and day before reaching its foot (or, its bottom).\" \n*Quran; 69:32\n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5688",
        "url": "https://sunnah.com/mishkat:5688"
      },
      "grade": null
    },
    {
      "id": 160,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن أبي بُردةَ عَنْ أَبِيهِ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" إِنَّ فِي جَهَنَّمَ لَوَادِيًا يُقَالُ لَهُ: هَبْهَبُ يسكنُه كلُّ جبَّارٍ \" رَوَاهُ الدَّارمِيّ",
      "english": {
        "narrator": "",
        "text": "Abu Burda told on his father's authority that the Prophet said, \"In jahannam there is a wadi called Habhab which every oppressor will inhabit.\" \n\nTirmidhi transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5689",
        "url": "https://sunnah.com/mishkat:5689"
      },
      "grade": null
    },
    {
      "id": 161,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "عَنِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «يَعْظُمُ أَهْلُ النَّارِ فِي النَّارِ حَتَّى إِنَّ بَيْنَ شَحْمَةِ أُذُنِ أَحَدِهِمْ إِلَى عَاتِقِهِ مَسِيرَةَ سبعمائةِ عامٍ وإِنَّ غِلَظَ جلدِه سَبْعُونَ ذراعان وَإِن ضرسه مثل أحد»",
      "english": {
        "narrator": "",
        "text": "Ibn `Umar reported the Prophet as saying, \"The inhabitants of hell will become huge in hell so that the space between the lobe of the ear and the shoulder of one of them will be a journey of seven hundred years, the thickness of his skin will be seventy cubits, and his molar tooth will be like Uhud.\""
      },
      "reference": {
        "text": "Mishkat al-Masabih 5690",
        "url": "https://sunnah.com/mishkat:5690"
      },
      "grade": null
    },
    {
      "id": 162,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ جَزْءٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ فِي النَّارِ حَيَّاتٍ كَأَمْثَالِ الْبُخْتِ تَلْسَعُ إِحْدَاهُنَّ اللَّسْعَةَ فَيَجِدُ حَمْوَتَهَا أَرْبَعِينَ خَرِيفًا وَإِنَّ فِي النَّارِ عَقَارِبَ كَأَمْثَالِ الْبِغَالِ الْمُؤْكَفَةِ تَلْسَعُ إِحْدَاهُنَّ اللَّسْعَةَ فَيَجِدُ حَمْوَتَهَا أَرْبَعِينَ خَرِيفًا» . رَوَاهُمَا أَحْمد",
      "english": {
        "narrator": "",
        "text": "`Abdallah b. al-Harith b. Jaz' reported God's messenger as saying, \"In hell there are snakes like Bactrian camels, one of which can give a sting the effect of which will be felt for forty years; and in hell there are scorpions like saddled mules, one of which can give a sting the effect of which will be felt for forty years.\" \n\nAhmad transmitted both traditions."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5691",
        "url": "https://sunnah.com/mishkat:5691"
      },
      "grade": null
    },
    {
      "id": 163,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن الحسنِ قَالَ: حَدَّثَنَا أَبُو هُرَيْرَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «الشَّمْسُ وَالْقَمَرُ ثَوْرَانِ مُكَوَّرَانِ فِي النَّارِ يَوْمَ الْقِيَامَةِ» . فَقَالَ الْحَسَنُ: وَمَا ذَنْبُهُمَا؟ فَقَالَ: أُحَدِّثُكَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَسَكَتَ الْحَسَنُ. رَوَاهُ البيهقيُّ فِي «كتاب الْبَعْث والنشور»",
      "english": {
        "narrator": "",
        "text": "Al-Hasan said Abu Huraira told him that God's messenger said, \"The sun and the moon are two oxen which will be cast away into hell on the day of resurrection.\" Al-Hasan asked what sin they had committed, and on receiving the reply, \"I am telling you on the authority of God's messenger,\" al-Hasan said no more. \n\nBaihaqi transmitted it in Kitab al-ba'th wan nushur."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5692",
        "url": "https://sunnah.com/mishkat:5692"
      },
      "grade": null
    },
    {
      "id": 164,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا يَدْخُلُ النَّارَ إِلَّا شَقِيٌّ» . قِيلَ: يَا رَسُولَ اللَّهِ وَمَنِ الشَّقِيُّ؟ قَالَ: «مَنْ لَمْ يَعْمَلْ لِلَّهِ بِطَاعَةٍ وَلم يتركْ لَهُ مَعْصِيّة» . رَوَاهُ ابْنُ مَاجَهْ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported God's messenger as saying, \"Only he who is miserable will enter hell.\" He was asked to whom that referred and replied, \"He who has not done an act of obedience for God's sake, or left an act of disobedience undone.\" \n\nIbn Majah transmitted it"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5693",
        "url": "https://sunnah.com/mishkat:5693"
      },
      "grade": null
    },
    {
      "id": 165,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" تَحَاجَّتِ الْجَنَّةُ وَالنَّارُ فَقَالَتِ النَّارُ: أُوثِرْتُ بِالْمُتَكَبِّرِينَ وَالْمُتَجَبِّرِينَ وَقَالَتِ الْجَنَّةُ: فَمَا لِي لَا يَدْخُلُنِي إِلَّا ضُعَفَاءُ النَّاسِ وَسَقَطُهُمْ وَغِرَّتُهُمْ. قَالَ اللَّهُ تَعَالَى لِلْجَنَّةِ: إِنَّمَا أَنْتِ رَحْمَتِي أَرْحَمُ بِكِ مَنْ أَشَاءُ مِنْ عِبَادِي وَقَالَ لِلنَّارِ: إِنَّمَا أَنْتِ عَذَابِي أُعَذِّبُ بِكِ مَنْ أَشَاءُ مِنْ عِبَادِي وَلِكُلِّ وَاحِدَةٍ مِنْكُمَا مِلْؤُهَا فَأَمَّا النَّارُ فَلَا تَمْتَلِئُ حَتَّى يَضَعَ اللَّهُ رِجْلَهُ. تَقُولُ: قَطْ قَطْ قَطْ فَهُنَالِكَ تَمْتَلِئُ وَيُزْوَى بَعْضُهَا إِلَى بَعْضٍ فَلَا يَظْلِمُ اللَّهُ مِنْ خَلْقِهِ أَحَدًا وَأَمَّا الْجَنَّةُ فإِنَّ اللَّهَ ينشئ لَهَا خلقا \". مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported God's messenger as saying, \"Paradise and hell had a dispute and hell said, `I have been distinguished by the proud and mighty ones.' Paradise said, `What is the matter with me that only weak, lowly and inexperienced people enter me?' God then said to paradise, `You are only my mercy by whom I show mercy to those of my servants whom I wish;' and He said to hell, `You are only my punishment by whom I punish those of my servants whom I wish. Both of you will be full.' Hell will not be filled till God puts down His foot. `It will say, `Enough, enough, enough,' and at that time it will be full with all its parts collected together, and God will not wrong any of His creatures. For paradise God will create people.\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5694",
        "url": "https://sunnah.com/mishkat:5694"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 166,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَنَسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" لَا تَزَالُ جَهَنَّمَ يُلْقَى فِيهَا وَتَقُولُ: هَلْ مِنْ مَزِيدٍ؟ حَتَّى يَضَعَ رَبُّ العزَّةِ فِيهَا قدَمَه فينزَوي بَعْضُهَا إِلَى بَعْضٍ فَتَقُولُ: قَطْ قَطْ بِعِزَّتِكَ وَكَرَمِكَ وَلَا يَزَالُ فِي الْجَنَّةِ فَضْلٌ حَتَّى يُنْشِئَ اللَّهُ لَهَا خَلْقًا فَيُسْكِنُهُمْ فَضْلَ الْجَنَّةِ \". مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Anas reported the Prophet as saying, \"Hell will continue to have people thrown into it and ask if there are any more till the Lord of might puts down His foot on it and its parts are collected together. It will then say, `Enough, enough, by Thy might and generosity.' In paradise there will continue to be more room till God creates people for it and causes them to dwell in the extra space in paradise.\" \n*Quran; 1:30\n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5695",
        "url": "https://sunnah.com/mishkat:5695"
      },
      "grade": null
    },
    {
      "id": 167,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \" لَمَّا خَلَقَ اللَّهُ الْجَنَّةَ قَالَ لِجِبْرِيلَ: اذْهَبْ فَانْظُرْ إِلَيْهَا فَذَهَبَ فَنَظَرَ إِلَيْهَا وَإِلَى مَا أَعَدَّ اللَّهُ لِأَهْلِهَا فِيهَا ثُمَّ جَاءَ فَقَالَ: أَيْ رَبِّ وَعِزَّتِكَ لَا يَسْمَعُ بِهَا أَحَدٌ إِلَّا دَخَلَهَا ثُمَّ حَفَّهَا بالمكارِه ثُمَّ قَالَ: يَا جِبْرِيلُ اذْهَبْ فَانْظُرْ إِلَيْهَا فَذَهَبَ فَنَظَرَ إِلَيْهَا ثُمَّ جَاءَ فَقَالَ: أَيْ رَبِّ وَعِزَّتِكَ لَقَدْ خَشِيتُ أَنْ لَا يَدْخُلَهَا أَحَدٌ \". قَالَ: \" فَلَمَّا خَلَقَ اللَّهُ النَّارَ قَالَ: يَا جبريلُ اذهبْ فانظرْ إِليها فذهبَ فنظرَ إِليها فَقَالَ: أَيْ رَبِّ وَعِزَّتِكَ لَا يَسْمَعُ بِهَا أَحَدٌ فَيَدْخُلُهَا فَحَفَّهَا بِالشَّهَوَاتِ ثُمَّ قَالَ: يَا جبريلُ اذهبْ فانظرْ إِليها فذهبَ فَنَظَرَ إِلَيْهَا فَقَالَ: أَيْ رَبِّ وَعِزَّتِكَ لَقَدْ خَشِيتُ أَنْ لَا يَبْقَى أَحَدٌ إِلَّا دَخَلَهَا \". رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُدَ وَالنَّسَائِيُّ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported the Prophet as telling that when God created paradise, He said to Gabriel, \"Go and look at it.\" He went and looked at it and at what God had prepared in it for its inhabitants, then came and said, \"0 my Lord, by Thy might, no one who hears of it will fail to enter it. He then surrounded it with disagreeable things and said, \"Go and look at it, Gabriel.\" He went and looked at it, then came and said, \"0 my Lord, by Thy might, I am afraid that no one will enter it.\" When God created hell He said, \"Go and look at it, Gabriel.\" He went and looked at it, then came and said, \"O my Lord, by Thy might, no one who hears of it will enter it.\" He then surrounded it with desirable things and said, \"Go and look at it, Gabriel.\" He went and looked at it, then said, \"0 my Lord, by Thy might, I am afraid that no one will remain who does not enter it.\" \n\nTirmidhi, Abu Dawud and Nasa'i transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5696",
        "url": "https://sunnah.com/mishkat:5696"
      },
      "grade": "حسن (الألباني)"
    },
    {
      "id": 168,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "عَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صلى بِنَا يَوْمًا الصَّلَاةَ ثُمَّ رَقِيَ الْمِنْبَرَ فَأَشَارَ بِيَدِهِ قِبَلَ قِبْلَةِ الْمَسْجِدِ فَقَالَ: «قَدْ أُرِيتُ الْآنَ مُذْ صَلَّيْتُ لَكُمُ الصَّلَاةَ الْجَنَّةَ وَالنَّارَ مُمَثَّلَتَيْنِ فِي قِبَلِ هَذَا الْجِدَارِ فَلَمْ أَرَ كَالْيَوْمِ فِي الْخَيْر وَالشَّر» . رَوَاهُ البُخَارِيّ",
      "english": {
        "narrator": "",
        "text": "Anas told that God's messenger led them in prayer one day, then mounted the pulpit and, pointing to the qibla in the mosque, said, \"I have just now been shown, since I led you in prayer, paradise and hell pictured in front of this wall, and I have never seen such good and evil as I have seen to-day.\" \n\nBukhari transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5697",
        "url": "https://sunnah.com/mishkat:5697"
      },
      "grade": null
    },
    {
      "id": 169,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "عَنْ عِمْرَانَ بْنِ حُصَيْنٍ قَالَ: إِنِّي كُنْتُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذْ جَاءَ قومٌ منْ بَني تميمٍ فَقَالَ: «اقْبَلُوا الْبُشْرَى يَا بَنِي تَمِيمٍ» قَالُوا: بَشَّرْتَنَا فَأَعْطِنَا فَدَخَلَ نَاسٌ مِنْ أَهْلِ الْيَمَنِ فَقَالَ: «اقْبَلُوا الْبُشْرَى يَا أَهْلَ الْيَمَنِ إِذْ لَمْ يَقْبَلْهَا بَنُو تَمِيمٍ» . قَالُوا: قَبِلْنَا جِئْنَاكَ لِنَتَفَقَّهَ فِي الدِّينِ وَلِنَسْأَلَكَ عَنْ أَوَّلِ هَذَا الْأَمْرِ مَا كَانَ؟ قَالَ: «كَانَ اللَّهُ وَلَمْ يَكُنْ شَيْءٌ قَبْلَهُ وَكَانَ عَرْشُهُ عَلَى الْمَاءِ ثُمَّ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ وَكَتَبَ فِي الذِّكْرِ كلَّ شيءٍ» ثُمَّ أَتَانِي رَجُلٌ فَقَالَ: يَا عِمْرَانُ أَدْرِكْ ناقتَكَ فقدْ ذهبتْ فانطلقتُ أطلبُها وايمُ اللَّهِ لَوَدِدْتُ أَنَّهَا قَدْ ذَهَبَتْ وَلَمْ أَقُمْ. رَوَاهُ البُخَارِيّ",
      "english": {
        "narrator": "'Imran b. Husain said:",
        "text": "I was with God's messenger when some people of Tamim came to him. He said, \"Receive the good news, B. Tamim,\" and they replied, \"You have given us good news, so grant us something.\" Some of the people of the Yemen then entered and he said, \"Receive the good news, people of the Yemen, since the B. Tamim have not accepted it.\" They replied, \"We have accepted it. We have come to you to become versed in the religion and to ask you about what was the beginning of this matter.\" He said, \"God existed and there was nothing before Him, His Throne being upon the water. He then created the heavens and the earth and inscribed everything in the memorial.\" At that point a man came to me and said, \"Catch up on your she-camel, `Imran,\" for it had gone away. I therefore went off to look for it, but I swear by God that I wish it had been lost and that I had not got up and left. \n*i.e., the Preserved Tablet.\n\nBukhari transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5698",
        "url": "https://sunnah.com/mishkat:5698"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 170,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن عمر قَالَ: قَامَ فِينَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مَقَامًا فَأَخْبَرَنَا عَنْ بَدْءِ الْخَلْقِ حَتَّى دَخَلَ أَهْلُ الْجَنَّةِ مَنَازِلَهُمْ وَأَهْلُ النَّارِ مَنَازِلَهُمْ حَفِظَ ذَلِكَ مَنْ حَفِظَهُ وَنَسِيَهُ مَنْ نسيَه \". رَوَاهُ البُخَارِيّ",
      "english": {
        "narrator": "",
        "text": "`Umar told that God's messenger stood up among them and told them about the beginning of creation up to the time when the inhabitants of paradise will enter their abodes and the inhabitants of hell will enter theirs, saying that some remembered that and others forgot. \n\nBukhari transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5699",
        "url": "https://sunnah.com/mishkat:5699"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 171,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: \n\" إِنَّ اللَّهَ تَعَالَى كَتَبَ كِتَابًا قَبْلَ أَنْ يَخْلُقَ الْخَلْقَ: إِنَّ رَحْمَتِي سَبَقَتْ غَضَبِي فَهُوَ مَكْتُوب عِنْده فَوق الْعَرْش \". مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira told that he heard God's messenger say God most high had inscribed a document before bringing the creation into being, \"My mercy has preceded my anger,\" and that it is written in His presence above the throne. \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5700",
        "url": "https://sunnah.com/mishkat:5700"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 172,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ عَائِشَةَ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «خُلِقَتِ الْمَلَائِكَةُ مِنْ نُورٍ وَخُلِقَ الْجَانُّ مِنْ مَارِجٍ مِنْ نَارٍ وَخُلِقَ آدَمُ مِمَّا وصف لكم» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "`A'isha reported God's messenger as saying, \"The angels were created from light, the jinn from smokeless fire.\"\n    Quran; 4:13, \n    Quran; 3:59 (dust); 15:26, 28:33; 55:14 (crackling clay).\n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5701",
        "url": "https://sunnah.com/mishkat:5701"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 173,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَنَسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «لَمَّا صَوَّرَ اللَّهُ آدَمَ فِي الْجَنَّةِ تَرَكَهُ مَا شَاءَ أَنْ يَتْرُكَهُ فَجَعَلَ إِبْلِيسُ يُطِيفُ بِهِ يَنْظُرُ مَا هُوَ فَلَمَّا رَآهُ أَجْوَفَ عَرَفَ أَنَّهُ خُلِقَ خَلْقًا لَا يتمالَكُ» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "Anas reported God's messenger as saying, \"When God fashioned Adam in paradise, He left him as long as God wished to leave him; then Iblis began to visit him and consider what kind of being he was, and when he saw that he had a hollow space within he recognised that he had been created as a being not possessed of self-control.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5702",
        "url": "https://sunnah.com/mishkat:5702"
      },
      "grade": "صَحِيح (الألباني)"
    },
    {
      "id": 174,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «اخْتَتَنَ إِبْرَاهِيمُ النَّبِيُّ وَهُوَ ابْنُ ثَمَانِينَ سَنَةً بِالْقَدُومِ» . مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported God's messenger as saying, \"Abraham the prophet circumcised himself with an axe when he was eighty years old.\" \n*The Arabic is bil-qadum which has the meaning above. Another reading is bil-qaddum which is said to mean at al-Qaddum' (a village in Syria); but this version with the doubled letter is not considered correct. \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5703",
        "url": "https://sunnah.com/mishkat:5703"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 175,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" لَمْ يَكْذِبْ إِبْرَاهِيمُ إِلَّا فِي ثَلَاثَ كَذَبَاتٍ: ثِنْتَيْنِ مِنْهُنَّ فِي ذَاتِ اللَّهِ قولُه (إِني سَقيمٌ)\nوقولُه (بلْ فعلَه كبيرُهم هَذَا)\nوَقَالَ: بَيْنَا هُوَ ذَاتَ يَوْمٍ وَسَارَةُ إِذْ أَتَى عَلَى جَبَّارٍ مِنَ الْجَبَابِرَةِ فَقِيلَ لَهُ: إِن هَهُنَا رَجُلًا مَعَهُ امْرَأَةٌ مِنْ أَحْسَنِ النَّاسِ فَأَرْسَلَ إِلَيْهِ فَسَأَلَهُ عَنْهَا: مَنْ هَذِهِ؟ قَالَ: أُخْتِي فَأَتَى سَارَةَ فَقَالَ لَهَا: إِنَّ هَذَا الْجَبَّارَ إِنْ يَعْلَمْ أَنَّكِ امْرَأَتِي يَغْلِبُنِي عَلَيْكِ فَإِنْ سألكِ فأخبِريهِ أنَّكِ أُختي فإِنكِ أُخْتِي فِي الْإِسْلَامِ لَيْسَ عَلَى وَجْهِ الْأَرْضِ مُؤْمِنٌ غَيْرِي وَغَيْرُكِ فَأَرْسَلَ إِلَيْهَا فَأُتِيَ بِهَا قَامَ إِبْرَاهِيمُ يُصَلِّي فَلَمَّا دَخَلَتْ عَلَيْهِ ذَهَبَ يَتَنَاوَلُهَا بِيَدِهِ. فَأُخِذَ - وَيُرْوَى فَغُطَّ - حَتَّى رَكَضَ بِرِجْلِهِ فَقَالَ: ادْعِي اللَّهَ لِي وَلَا أَضُرُّكِ فَدَعَتِ اللَّهَ فَأُطْلِقَ ثُمَّ تَنَاوَلَهَا الثَّانِيَةَ فَأُخِذَ مِثْلَهَا أَوْ أَشَدُّ فَقَالَ: ادْعِي اللَّهَ لِي وَلَا أَضُرُّكِ فَدَعَتِ اللَّهَ فَأُطْلِقَ فَدَعَا بَعْضَ حجَبتِه فَقَالَ: إِنَّكَ لم تأتِني بِإِنْسَانٍ إِنَّمَا أَتَيْتَنِي بِشَيْطَانٍ فَأَخْدَمَهَا هَاجَرَ فَأَتَتْهُ وَهُوَ قائمٌ يُصلي فأوْمأَ بيدِه مَهْيَمْ؟ قَالَتْ: رَدَّ اللَّهُ كَيْدَ الْكَافِرِ فِي نَحْرِهِ وَأَخْدَمَ هَاجَرَ \" قَالَ أَبُو هُرَيْرَةَ: تِلْكَ أُمُّكُمْ يَا بَنِي مَاءِ السَّمَاءِ. مُتَّفَقٌ عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"Abraham told only, three lies two of which were for God's sake, his words, `I am indeed sick \n    Quran, 37: 89. \n    Quran, 21: 63. \n    Cf. Genesis, 12:11 ff. \n    This is said to be a general term for the Arabs because they sought out places where rain fell. \nMa' as-sama' means literally \"the water of the sky.\" Ma' as-sama' was a laqab of Mawiya, mother of al-Mundhir III, king of al-Hira, but it is difficult to see how that has any connection here. Ma' as sama' is also said to be applied to Zamzam, which is traditionally said to be the well which the angel revealed to Hagar and her son Ishmael. That might justify the suggestion that Abu Huraira is here referring to the northern Arabs in particular.\n   \n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5704",
        "url": "https://sunnah.com/mishkat:5704"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 176,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" نَحْنُ أَحَقُّ بِالشَّكِّ مِنْ إِبْرَاهِيمَ إِذْ قَالَ: (رَبِّ أَرِنِي كَيْفَ تحيي الْمَوْتَى)\nوَيَرْحَمُ اللَّهُ لُوطًا لَقَدْ كَانَ يَأْوِي إِلَى رُكْنٍ شَدِيدٍ وَلَوْ لَبِثْتُ فِي السِّجْنِ طُولَ مَا لَبِثَ يُوسُفُ لَأَجَبْتُ الدَّاعِيَ \". مُتَّفَقٌ عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"We have more right to doubt than Abraham when he said, `My Lord, show me how Thou wilt raise the dead to life.'.\" \n1. Quran, 2:260. \n2. Quran, 11:80 \n3. Quran, 12:50.\n(Bukhari and Muslim)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5705",
        "url": "https://sunnah.com/mishkat:5705"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 177,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" إِنَّ مُوسَى كَانَ رَجُلًا حَيِيًّا سِتِّيرًا لَا يُرَى مِنْ جِلْدِهِ شَيْءٌ اسْتِحْيَاءً فَآذَاهُ مَنْ آذَاهُ مِنْ بَنِي إِسْرَائِيلَ فَقَالُوا: مَا تَسَتَّرَ هَذَا التَّسَتُّرَ إِلَّا مِنْ عَيْبٍ بِجِلْدِهِ: إِمَّا بَرَصٌ أَوْ أُدْرَةٌ وَإِنَّ اللَّهَ أَرَادَ أَنْ يُبَرِّئَهُ فَخَلَا يَوْمًا وَحده ليغتسل فَوَضَعَ ثَوْبَهُ عَلَى حَجَرٍ فَفَرَّ الْحَجَرُ بِثَوْبِهِ فَجمع مُوسَى فِي إِثْرِهِ يَقُولُ: ثَوْبِي يَا حَجَرُ ثَوْبِي يَا حَجَرُ حَتَّى انْتَهَى إِلَى مَلَأٍ مِنْ بَنِي إِسْرَائِيلَ فَرَأَوْهُ عُرْيَانًا أَحْسَنَ مَا خَلَقَ اللَّهُ وَقَالُوا: وَاللَّهِ مَا بِمُوسَى مِنْ بَأْسٍ وَأَخْذَ ثَوْبَهُ وَطَفِقَ بِالْحَجَرِ ضَرْبًا فَوَاللَّهِ إِنَّ بِالْحَجَرِ لَنَدَبًا مِنْ أَثَرِ ضَرْبِهِ ثَلَاثًا أَو أَرْبعا أَو خمْسا \". مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"Moses was a modest man who kept himself covered, none of his skin being seen because pf modesty. Some of the B. Isra'il annoyed him by saying that he concealed himself to this extent only because of some skin trouble such as leprosy or a scrotal hernia, but God wished to clear him. So, one day when he was alone having a bath, he placed his garment on a stone and the stone flew away with his garment. Moses raced after it saying, `My garment, stone; my garment, stone,' till he came to a company of the B. Isra'il who, seeing him naked in the most beautiful form God had created, said, `We swear by God that there is nothing wrong with Moses.' He took his garment and began to beat the stone, and I swear by God that there were three, four, or five scars on the stone from the effect of his beating.\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5706",
        "url": "https://sunnah.com/mishkat:5706"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 178,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" بَيْنَا أَيُّوبُ يَغْتَسِلُ عُرْيَانًا فَخَرَّ عَلَيْهِ جَرَادٌ مِنْ ذَهَبٍ فَجَعَلَ أَيُّوبُ يَحْثِي فِي ثَوْبِهِ فَنَادَاهُ رَبُّهُ: يَا أَيُّوبُ أَلَمْ أَكُنْ أَغْنَيْتُكَ عَمَّا تَرَى؟ قَالَ: بَلَى وَعِزَّتِكَ وَلَكِن لَا غنى بِي عَن بركتك \". رَوَاهُ البُخَارِيّ",
      "english": {
        "narrator": "",
        "text": "He reported-God's messenger as saying, \"While Job was naked having a bath some golden locusts alighted on him and Job began to gather them in his garment. His Lord called to him, `Job, have I not enriched you from what you see?' and he replied, 'Certainly, by Thy might, but I cannot dispense with Thy blessing'.\" \n\nBukhari transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5707",
        "url": "https://sunnah.com/mishkat:5707"
      },
      "grade": null
    },
    {
      "id": 179,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: اسْتَبَّ رَجُلٌ مِنَ الْمُسْلِمِينَ وَرَجُلٌ مِنَ الْيَهُودِ. فَقَالَ الْمُسْلِمُ: وَالَّذِي اصْطَفَى مُحَمَّدًا عَلَى الْعَالَمِينَ. فَقَالَ الْيَهُودِيُّ: وَالَّذِي اصْطَفَى مُوسَى عَلَى الْعَالَمِينَ. فَرَفَعَ الْمُسْلِمُ يَدَهُ عِنْدَ ذَلِكَ فَلَطَمَ وَجْهَ الْيَهُودِيِّ فَذَهَبَ الْيَهُودِيُّ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَأَخْبَرَهُ بِمَا كَانَ من أمره وأمرِ الْمُسلم فَدَعَا النَّبِي صلى اللَّهُ عَلَيْهِ وَسَلَّمَ الْمُسْلِمَ فَسَأَلَهُ عَنْ ذَلِكَ فَأَخْبَرَهُ فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لَا تُخَيِّرُونِي عَلَى مُوسَى فَإِنَّ النَّاسَ يُصْعَقُونَ يَوْمَ الْقِيَامَةِ فَأُصْعَقُ مَعَهُمْ فَأَكُونُ أَوَّلَ مَنْ يُفِيقُ فَإِذَا مُوسَى بَاطِشٌ بِجَانِبِ الْعَرْشِ فَلَا أَدْرَى كَانَ فِيمَنْ صُعِقَ فَأَفَاقَ قَبْلِي أَوْ كَانَ فِيمَنِ اسْتَثْنَى اللَّهُ.» . وَفِي رِوَايَةٍ: \n\" فَلَا أَدْرِي أَحُوسِبَ بِصَعْقَةِ يَوْمِ الطُّورِ أَوْ بُعِثَ قَبْلِي؟ وَلَا أَقُولُ: أَنَّ أَحَدًا أَفْضَلَ مِنْ يُونُسَ بنِ مَتَّى \"\nوَفِي رِوَايَةِ أَبِي سَعِيدٍ قَالَ: «لَا تُخَيِّرُوا بَيْنَ الْأَنْبِيَاءِ» . مُتَّفَقٌ عَلَيْهِ. وَفِي رِوَايَةِ أَبِي هُرَيْرَة: «لَا تفضلوا بَين أَنْبيَاء الله»",
      "english": {
        "narrator": "",
        "text": "He told that a man among the Muslims and a man among the Jews reviled one another. The Muslim said, \"By Him who chose Muhammad above the universe,\" and the Jew said, \"By Him who chose Moses above the universe.\" Thereupon the Muslim raised his hand and struck the Jew on his face, and the Jew went to the Prophet and told him what had happened between him and the Muslim. The Prophet summoned the Muslim and asked him about that, and when he informed him, the Prophet said, \"Do not make me superior to Moses, for mankind will swoon on the day of resurrection or was resurrected before me. And I do not say that anyone is more excellent than Jonah, son of Matta.\" In Abu Sa'id's version he said, \"Do not make distinctions between the prophets.\" Abu Huraira's version has \"Do not treat some of the prophets of God most high as superior to others.\"\n Quran, 39:68. \n Quran, 7:143. \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5708, 5709",
        "url": "https://sunnah.com/mishkat:5708"
      },
      "grade": "مُتَّفق عَلَيْهِ (الألباني)"
    },
    {
      "id": 180,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" مَا يَنْبَغِي لِعَبْدٍ أَنْ يَقُولَ: إِنِّي خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى \". مُتَّفَقٌ عَلَيْهِ\nوَفِي رِوَايَةِ البُخَارِيّ قَالَ: \" من قَالَ: أَنَا خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى فقد كذب \"",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported God's messenger as saying, \"It is not fitting for a man to say I am better than Jonah son of Matta.\" \n\n(Bukhari and Muslim.)\n\nIn a version by Bukhari he said, \"Whoever says I am better than Jonah son of Matta has lied.\" \n\nBukhari"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5710",
        "url": "https://sunnah.com/mishkat:5710"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 181,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أُبَيِّ بْنِ كَعْبٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ الْغُلَامَ الَّذِي قَتَلَهُ الْخَضِرُ طُبِعَ كَافِرًا وَلَوْ عَاشَ لَأَرْهَقَ أَبَوَيْهِ طُغْيَانًا وَكُفْرًا» . مُتَّفَقٌ عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Ubayy b. Ka'b reported God's messenger as saying, \"The youth whom al-Khidr killed was given the nature of an infidel, and if he had lived, he would certainly have imposed on his parents insolence and unbelief.\" \n*Cf. Quran, 28:80.\n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5711",
        "url": "https://sunnah.com/mishkat:5711"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 182,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «إِنَّمَا سُمِّيَ الْخَضِرُ لِأَنَّهُ جَلَسَ عَلَى فَرْوَةٍ بَيْضَاءَ فَإِذَا هِيَ تَهْتَزُّ من خَلْفِه خضراء» . رَوَاهُ البُخَارِيّ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported the Prophet as saying, \"The reason why al Khidr was so called was because he sat on some white waste land and it sprouted green (khadra') behind him.\" \n\nBukhari transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5712",
        "url": "https://sunnah.com/mishkat:5712"
      },
      "grade": null
    },
    {
      "id": 183,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" جَاءَ مَلَكُ الْمَوْتِ إِلَى مُوسَى ابْنِ عِمْرَانَ فَقَالَ لَهُ: أَجِبْ رَبَّكَ \". قَالَ: «فَلَطَمَ مُوسَى عَيْنَ مَلَكَ الْمَوْتِ فَفَقَأَهَا» قَالَ: \" فَرَجَعَ الْمَلَكُ إِلَى اللَّهِ فَقَالَ: إِنَّكَ أَرْسَلْتَنِي إِلَى عَبْدٍ لَكَ لَا يُرِيدُ الْمَوْتَ وَقَدْ فَقَأَ عَيْنِي \" قَالَ: \" فَرَدَّ اللَّهُ إِلَيْهِ عَيْنَهُ وَقَالَ: ارْجِعْ إِلَى عَبْدِي فَقُلْ: الْحَيَاةَ تُرِيدُ؟ فَإِنْ كُنْتَ تُرِيدُ الْحَيَاةَ فَضَعْ يَدَكَ عَلَى مَتْنِ ثَوْرٍ فَمَا تَوَارَتْ يَدُكَ مِنْ شَعْرِهِ فَإِنَّكَ تَعِيشُ بِهَا سَنَةً قَالَ: ثُمَّ مَهْ؟ قَالَ: ثُمَّ تَمُوتُ. قَالَ: فَالْآنَ مِنْ قَرِيبٍ رَبِّ أَدْنِنِي مِنَ الْأَرْضِ الْمُقَدَّسَةِ رَمْيَةً بِحَجَرٍ \". قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «وَاللَّهِ لَوْ أَنِّي عِنْدَهُ لَأَرَيْتُكُمْ قَبْرَهُ إِلَى جَنْبِ الطَّرِيقِ عِنْدَ الْكَثِيبِ الْأَحْمَرِ» . مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"The angel of death came to Moses, son of Imran and told him to answer his Lord's summons, whereupon Moses gave the angel of death a blow in the eye and knocked it out. The angel then returned to God most high and said, `Thou didst send me to a servant of Thine who does not wish to die, and he has put out my eye.' God restored his eye to him and said, `Go back to my servant and ask him if it is life he wants, then tell him that if he wants life he must place his hand on an ox's back, and he will live a year for every hair which covers his hand.'  \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5713",
        "url": "https://sunnah.com/mishkat:5713"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 184,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ جَابِرٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «عُرِضَ عَلَيَّ الْأَنْبِيَاءُ فَإِذَا مُوسَى ضَرْبٌ مِنَ الرِّجَالِ كَأَنَّهُ مِنْ رِجَالِ شَنوءَةَ ورأيتُ عِيسَى بن مَرْيَم فإِذا أقربُ مَن رأيتُ بِهِ شَبَهًا عُرْوَةُ بْنُ مَسْعُودٍ وَرَأَيْتُ إِبْرَاهِيمَ فَإِذَا أَقْرَبُ مَنْ رَأَيْتُ بِهِ شَبَهًا صَاحِبُكُمْ - يَعْنِي نَفْسَهُ - وَرَأَيْتُ جِبْرِيلَ فَإِذَا أَقْرَبُ مَنْ رَأَيْتُ بِهِ شَبَهًا دِحْيَةُ بْنُ خَلِيفَةَ» . رَوَاهُ مُسْلِمٌ",
      "english": {
        "narrator": "",
        "text": "Jabir reported God's messenger as saying, \"The prophets were presented before me and I saw Moses of a type which resembled one of the men of Shanu'a. I saw Jesus, son of Mary, and the nearest to him in appearance whom I have seen is `Urwa b. Mas'ud. I saw Abraham, and the nearest to him in appearance whom I have seen is your companion (meaning himself). I also saw Gabriel, and the nearest to him in appearance whom I have seen is Dihya b. Khalifa.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5714",
        "url": "https://sunnah.com/mishkat:5714"
      },
      "grade": null
    },
    {
      "id": 185,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنِ ابْنِ عَبَّاسٍ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «رَأَيْتُ لَيْلَةَ أُسْرِيَ بِي مُوسَى رَجُلًا آدَمَ طُوَالًا جَعْدًا كَأَنَّهُ شنُوءَة وَرَأَيْت رَجُلًا مَرْبُوعَ الْخَلْقِ إِلَى الْحُمْرَةِ وَالْبَيَاضِ سَبْطَ الرَّأْسِ وَرَأَيْتُ مَالِكًا خَازِنَ النَّارِ وَالدَّجَّالَ فِي آيَاتٍ أَرَاهُنَّ اللَّهُ إِيَّاهُ فَلَا تَكُنْ فِي مرية من لِقَائِه» . مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Ibn `Abbas reported the Prophet as saying, \"On the night when I was taken up to heaven I saw Moses, a dark, tall, curly-headed man, looking as though he were one of the men of Shanu'a. I saw Jesus, a man of medium height, reddish fair, with long hair. And I saw Malik, the guardian of hell, and the dajjal (with signs which God showed him) *. Now do not be in doubt about meeting him.\" \n*The phrase in brackets is an insertion by the transmitter who tells that God showed Muhammad miracles which the dajjal will perform\n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5715",
        "url": "https://sunnah.com/mishkat:5715"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 186,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" لَيْلَةً أُسْرِيَ بِي لَقِيتُ مُوسَى - فَنَعَتَهُ -: فَإِذَا رَجُلٌ مُضْطَرِبٌ رَجِلُ الشَّعْرِ كَأَنَّهُ مِنْ رِجَالِ شَنُوءَةَ وَلَقِيتُ عِيسَى رَبْعَةً أَحْمَرَ كَأَنَّمَا خَرَجَ مِنْ دِيمَاسٍ - يَعْنِي الْحَمَّامَ - وَرَأَيْتُ إِبْرَاهِيمَ وَأَنَا أَشْبَهُ وَلَدِهِ بِهِ \" قَالَ: \" فَأُتِيتُ بِإِنَاءَيْنِ: أَحَدُهُمَا لَبَنٌ وَالْآخَرُ فِيهِ خَمْرٌ. فَقِيلَ لِي: خُذْ أَيَّهُمَا شِئْتَ. فَأَخَذْتُ اللَّبَنَ فَشَرِبْتُهُ فَقِيلَ لِي: هُدِيتَ الْفِطْرَةَ أَمَا إِنَّكَ لَوْ أَخَذْتَ الْخَمْرَ غَوَتْ أمتك \". مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported God's messenger as saying, \"On the night when I was taken up to heaven, I met Moses who may be described as a lanky man with somewhat curly hair who resembled one of the men of Shanu'a; I met Jesus who was of medium height and red as though he had come out of a dimas (i.e., a hot bath); and I saw Abraham to whom I am the one among his descendants who bears the closest resemblance. I was brought two vessels, one containing milk and the other wine, and was told to take whichever oi them I wished. I took the milk and drank it and was told I had been guided to the true religion, for if I had taken the wine my people would have gone astray.\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5716",
        "url": "https://sunnah.com/mishkat:5716"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 187,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن ابنِ عبَّاسٍ قَالَ: سِرْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَيْنَ مَكَّةَ وَالْمَدِينَةِ فَمَرَرْنَا بِوَادٍ فَقَالَ: «أَيُّ وَادٍ هَذَا؟» . فَقَالُوا: وَادِي الْأَزْرَقِ. قَالَ: «كَأَنِّي أَنْظُرُ إِلَى مُوسَى» فَذَكَرَ مِنْ لَوْنِهِ وَشَعْرِهِ شَيْئًا وَاضِعًا أُصْبُعَيْهِ فِي أُذُنَيْهِ لَهُ جُؤَارٌ إِلَى اللَّهِ بِالتَّلْبِيَةِ مَارًّا بِهَذَا الْوَادِي \". قَالَ: ثُمَّ سِرْنَا حَتَّى أَتَيْنَا عَلَى ثَنِيَّةٍ. فَقَالَ: «أَيُّ ثَنِيَّةٍ هَذِهِ؟» قَالُوا: هَرْشَى - أَوْ لِفْتُ -. فَقَالَ: «كَأَنِّي أَنْظُرُ إِلَى يُونُسَ عَلَى نَاقَةٍ حَمْرَاءَ عَلَيْهِ جُبَّةُ صُوفٍ خِطَامُ نَاقَتِهِ خُلْبَةٌ مَارًّا بِهَذَا الْوَادِي مُلَبِّيًا» رَوَاهُ مُسلم",
      "english": {
        "narrator": "Ibn `Abbas said:",
        "text": "We travelled with God's messenger between Mecca and Medina, and when we passed a wadi he asked its name. On being told it was the wadi al-Azraq he said, \"I can fancy myself looking at Moses (and he mentioned something about his colour and his hair) putting two fingers in his ears, making loud supplication to God saying, `At Thy service,' while passing this wadi.'' He said: We journeyed till we came to a mountain pass and he asked its name. On being told that it was Harsha, or Lift, he said, \"I can fancy myself looking at Jonah on a red she-camel with a nose-rein of palm fibre, wearing a woolen mantle and saying `At Thy service' while passing this wadi.\n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5717",
        "url": "https://sunnah.com/mishkat:5717"
      },
      "grade": null
    },
    {
      "id": 188,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «خُفِّفَ عَلَى دَاوُدَ الْقُرْآنُ فَكَانَ يَأْمُرُ بِدَوَابِّهِ فَتُسَرَّحَ فَيَقْرَأُ الْقُرْآنَ قَبْلَ أَنْ تُسَرَّحَ دَوَابُّهُ وَلَا يَأْكُلُ إِلَّا مِنْ عملِ يدَيهِ» . رَوَاهُ البُخَارِيّ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported the Prophet as saying, \"Recitation of Scripture was made easy for David, who would order his beasts to be saddled and recite the Scripture before they had been saddled; and he \nwould eat only what his hands had earned.'' \n\nBukhari transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5718",
        "url": "https://sunnah.com/mishkat:5718"
      },
      "grade": null
    },
    {
      "id": 189,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" كَانَتِ امْرَأَتَانِ مَعَهُمَا ابْنَاهُمَا جَاءَ الذِّئْبُ فَذَهَبَ بِابْنِ إِحْدَاهُمَا فَقَالَتْ صَاحِبَتُهَا: إِنَّمَا ذَهَبَ بابنك. وَقَالَت الْأُخْرَى: إِنَّمَا ذهب بابنك فتحاكما إِلَى دَاوُدَ فَقَضَى بِهِ لِلْكُبْرَى فَخَرَجَتَا عَلَى سُلَيْمَانَ بْنِ دَاوُدَ فَأَخْبَرَتَاهُ فَقَالَ: ائْتُونِي بِالسِّكِّينِ أَشُقُّهُ بَيْنَكُمَا. فَقَالَتِ الصُّغْرَى: لَا تَفْعَلُ يَرْحَمُكَ اللَّهُ هُوَ ابْنُهَا فَقَضَى بِهِ لِلصُّغْرَى \" مُتَّفَقٌ عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "He reported the Prophet as saying, \"There were two women both of whom had a son, and a wolf went off with the son of one of them. Her companion said, `It has gone off with your son,' but the other \nreplied, `It is with your son it has gone off.' They took the case before David and he decided that the child belonged to the elder. They then went out to Solomon, son of David and told him, and he said, `Bring me, a knife and let me divide it between you.' The younger woman then said, `Don't do it, God have mercy on you; He is her son.' So, he decided that the child belonged to the younger woman.'' \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5719",
        "url": "https://sunnah.com/mishkat:5719"
      },
      "grade": "مُتَّفق عَلَيْهِ (الألباني)"
    },
    {
      "id": 190,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \n\" قَالَ سُلَيْمَانُ: لَأَطُوفَنَّ اللَّيْلَةَ عَلَى تِسْعِينَ امْرَأَةٍ - وَفِي رِوَايَةٍ: بِمِائَةِ امْرَأَةٍ - كُلُّهُنَّ تَأْتِي بِفَارِسٍ يُجَاهِدُ فِي سَبِيلِ اللَّهِ. فَقَالَ لَهُ الْمَلَكُ: قُلْ إِنْ شَاءَ اللَّهُ. فَلَمْ يَقُلْ وَنَسِيَ فَطَافَ عَلَيْهِنَّ فَلَمْ تحملْ منهنَّ إِلا امرأةٌ واحدةٌ جاءتْ بشقِّ رَجُلٍ وَأَيْمُ الَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَوْ قَالَ: إِنْ شَاءَ اللَّهُ لَجَاهَدُوا فِي سَبِيلِ الله فُرْسَانًا أجمعونَ \". مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as telling that Solomon said, \"I shall to-night visit ninety women \n(a version has a hundred) all of whom will give birth to a horseman who will fight in God's path.\" The angel told him to say, \"If God will,\" but he forgot and did not say it. He visited them and none of them bore a child except one of them who gave birth to half a man. He added, \"By Him in whose hand Muhammad's soul is, if he had said, `If God will,' they would all have striven as horsemen in God's path.\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5720",
        "url": "https://sunnah.com/mishkat:5720"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 191,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كَانَ زَكَرِيَّاء نجارا» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying that Zechariah was a carpenter. \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5721",
        "url": "https://sunnah.com/mishkat:5721"
      },
      "grade": null
    },
    {
      "id": 192,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَنَا أَوْلَى النَّاسِ بِعِيسَى بن مَرْيَمَ فِي الْأُولَى وَالْآخِرَةِ الْأَنْبِيَاءُ أُخْوَةٌ مِنْ عَلَّاتٍ وَأُمَّهَاتُهُمْ شَتَّى وَدِينُهُمْ وَاحِدٌ وَلَيْسَ بَيْنَنَا نَبِي» . مُتَّفق عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"I am the nearest of kin to Jesus, son of Mary in this world and the next. The prophets are brothers, sons of one father by co-wives. Their mothers are different, but their religion is one. There has been no prophet between us.\" \n*This saying is explained as meaning that all prophets have the same religion, which is figuratively called their lather, but they differ in their law and in a number of regulations, these being figuratively called their mothers. Cf. Mirqat, 5:346.\n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5722",
        "url": "https://sunnah.com/mishkat:5722"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 193,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «كُلُّ بَنِي آدَمَ يَطْعَنُ الشَّيْطَانُ فِي جَنْبَيْهِ بِإِصْبَعَيْهِ حِينَ يُوَلَدُ غَيْرَ عِيسَى بْنِ مَرْيَمَ ذَهَبَ يَطْعَنُ فَطَعَنَ فِي الْحِجَابِ» . مُتَّفَقٌ عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"All the descendants of Adam have their sides pierced by the devil with two of his fingers at birth, except the son of Mary. He went to pierce him, but pierced the \nmembrane covering him.\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5723",
        "url": "https://sunnah.com/mishkat:5723"
      },
      "grade": "مُتَّفَقٌ عَلَيْهِ (الألباني)"
    },
    {
      "id": 194,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي مُوسَى عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كَمُلَ مِنَ الرِّجَالِ كَثِيرٌ وَلَمْ يَكْمُلْ مِنَ النساءِ إِلا مريمُ بنتُ عِمْرَانَ وَآسِيَةُ امْرَأَةُ فِرْعَوْنَ وَفَضْلُ عَائِشَةَ عَلَى النِّسَاءِ كَفَضْلِ الثَّرِيدِ عَلَى سَائِرِ الطَّعَامِ» . مُتَّفَقٌ عَلَيْهِ",
      "english": {
        "narrator": "",
        "text": "Abu Musa reported the Prophet as saying, \"Many men have been perfect, but among women only Mary the daughter of `Imran and Asiya the wife of Pharaoh were perfect; and `A'isha's superiority over women is like the superiority of tharid over other kinds of food.\" \n\n(Bukhari and Muslim.)"
      },
      "reference": {
        "text": "Mishkat al-Masabih 5724",
        "url": "https://sunnah.com/mishkat:5724"
      },
      "grade": null
    },
    {
      "id": 195,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "عَن أبي رزين قَالَ: قلت: يَا رَسُول الله أَيْن رَبُّنَا قَبْلَ أَنْ يَخْلُقَ خَلْقَهُ؟ قَالَ: «كَانَ فِي عَمَاءٍ مَا تَحْتَهُ هَوَاءٌ وَمَا فَوْقَهُ هَوَاءٌ وَخَلَقَ عَرْشَهُ عَلَى الْمَاءِ» . رَوَاهُ التِّرْمِذِيُّ وَقَالَ: قَالَ يَزِيدُ بْنُ هَارُونَ: الْعَمَاءُ: أَيْ لَيْسَ مَعَه شَيْء",
      "english": {
        "narrator": "",
        "text": "Abu Razin told that he asked God's messenger, \"Where was our Lord before He created the creation?\" to which he replied, \"He was in obscurity ('ama') with no air below Him and no air above Him, and He created His Throne on the water.\"\n\n Tirmidhi transmitted it. Yazid b. Harun.\n Al-Wasiti (d.206), a highly estimated authority who appears in the course of the isnad.\n The word 'ama' presents difficulty. It commonly means `clouds', but this is felt to be inappropriate here unless figuratively in the sense of God being veiled. It is suggested that this means it is a matter which the mind cannot grasp. Cf. Mirqat, 5:349."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5725",
        "url": "https://sunnah.com/mishkat:5725"
      },
      "grade": null
    },
    {
      "id": 196,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن العبَّاس بن عبد الْمطلب زعم أَنَّهُ كَانَ جَالِسًا فِي الْبَطْحَاءِ فِي عِصَابَةٍ وَرَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَالِسٌ فِيهِمْ فَمَرَّتْ سَحَابَةٌ فَنَظَرُوا إِلَيْهَا فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «مَا تُسَمُّونَ هَذِهِ؟» . قَالُوا: السَّحَابَ. قَالَ: «وَالْمُزْنَ؟» قَالُوا: وَالْمُزْنَ. قَالَ: «وَالْعَنَانَ؟» قَالُوا: وَالْعَنَانَ. قَالَ: «هَلْ تَدْرُونَ مَا بعد مابين السَّمَاءِ وَالْأَرْضِ؟ » قَالُوا: لَا نَدْرِي. قَالَ: «إِنَّ بُعْدَ مَا بَيْنَهُمَا إِمَّا وَاحِدَةٌ وَإِمَّا اثْنَتَانِ أَوْ ثَلَاثٌ وَسَبْعُونَ سَنَةً وَالسَّمَاءُ الَّتِي فَوْقَهَا كَذَلِكَ» حَتَّى عَدَّ سَبْعَ سَمَاوَاتٍ. ثُمَّ «فَوْقَ السَّمَاء السَّابِعَة بَحر بَين أَعْلَاهُ وأسفله مَا بَيْنَ سَمَاءٍ إِلَى سَمَاءٍ ثُمَّ فَوْقَ ذَلِكَ ثَمَانِيَة أَو عَال بَيْنَ أَظْلَافِهِنَّ وَوُرُكِهِنَّ مِثْلُ مَا بَيْنَ سَمَاءٍ إِلَى سَمَاءٍ ثُمَّ عَلَى ظُهُورِهِنَّ الْعَرْشُ بَيْنَ أَسْفَلِهِ وَأَعْلَاهُ مَا بَيْنَ سَمَاءٍ إِلَى سَمَاءٍ ثُمَّ اللَّهُ فَوْقَ ذَلِكَ» . رَوَاهُ التِّرْمِذِيُّ وَأَبُو دَاوُد",
      "english": {
        "narrator": "",
        "text": "Al- `Abbas b. `Abd al-Muttalib asserted that he was sitting in al Batha' with a company among whom God's messenger was sitting when a cloud passed. They looked at it and God's messenger asked, \"What do you call this?\" and received the reply \"Clouds (sahab).\" He said, \"And rain-clouds (muzn),\" to which they agreed. He said, \"And clouds (`aman),\" to which they agreed. He asked, \"Do you know the distance between heaven and earth?\" and when they replied that they did not, he said, \"The distance between them is seventy-one, seventy-two, or seventy-three years, the heaven which is above it is at a similar distance (going on till he counted seven heavens). Above the seventh heaven there is a sea the distance between whose surface and bottom is like that between one heaven and the next. Above that there are eight mountain goats the distance between whose hoofs and haunches is like that between one heaven and the next. On their backs is the Throne the extent of which from top to bottom is like the distance between one heaven and the next. Then God is above that.\" \n*A stony valley at Mecca.\n\nTirmidhi and Abu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5726",
        "url": "https://sunnah.com/mishkat:5726"
      },
      "grade": null
    },
    {
      "id": 197,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ جُبَيْرِ بْنِ مُطْعِمٍ قَالَ: أَتَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَعْرَابِيٌّ فَقَالَ: جَهِدَتِ الْأَنْفُسُ وَجَاعَ الْعِيَالُ وَنُهِكَتِ الْأَمْوَالُ وَهَلَكَتِ الْأَنْعَام فَاسْتَسْقِ اللَّهَ لَنَا فَإِنَّا نَسْتَشْفِعُ بِكَ عَلَى الله نستشفع بِاللَّهِ عَلَيْكَ. فَقَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «سُبْحَانَ اللَّهِ سُبْحَانَ اللَّهِ» . فَمَا زَالَ يسبّح حَتَّى عُرف ذَلِك فِي وُجُوه أَصْحَابه ثُمَّ قَالَ: «وَيْحَكَ إِنَّهُ لَا يُسْتَشْفَعُ بِاللَّهِ عَلَى أَحَدٍ شَأْنُ اللَّهِ أَعْظَمُ مِنْ ذَلِكَ وَيْحَكَ أَتَدْرِي مَا اللَّهُ؟ إِنَّ عَرْشَهُ عَلَى سَمَاوَاتِهِ لَهَكَذَا» وَقَالَ بِأَصَابِعِهِ مَثْلَ الْقُبَّةِ عَلَيْهِ «وإِنه ليئط أطيط الرحل بالراكب» رَوَاهُ أَبُو دَاوُد",
      "english": {
        "narrator": "",
        "text": "Jubair b. Mut'im told that a nomadic Arab came to God's messenger and said, \"People are suffering distress, the children are hungry, the crops are withered and the animals are perishing, so ask God to grant us rain, for we seek you as our intercessor with God and God as our intercessor with you.\" Thereupon the Prophet said, \"Glory be to God, glory be to God,\" and he continued declaring God's glory till the effect of that was apparent in the faces of his companions. He then said, \"Woe to you! God is not to be sought as intercessor with anyone. God's state is greater than that. Woe to you! Do you know how great God is? His Throne is above the heavens thus (indicating with his fingers something like a dome over him), and it groans on account of Him as a saddle does because of the rider.\" \n\nAbu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5727",
        "url": "https://sunnah.com/mishkat:5727"
      },
      "grade": null
    },
    {
      "id": 198,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «أُذِنَ لِي أَنْ أُحَدِّثَ عَنْ مَلَكٍ مِنْ مَلَائِكَةِ اللَّهِ مِنْ حَمَلَةِ الْعَرْشِ أَنَّ مَا بَيْنَ شحمة أُذُنَيْهِ إِلَى عَاتِقَيْهِ مَسِيرَةُ سَبْعِمِائَةِ عَامٍ» . رَوَاهُ أَبُو دَاوُد",
      "english": {
        "narrator": "",
        "text": "Jabir b. `Abdallah reported God's messenger as saying, \"I have been permitted to tell about one of God's angels who bear the Throne that the distance between the lobe of his ear and his shoulder is a journey of seven hundred years.\" \n\nAbu Dawud transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5728",
        "url": "https://sunnah.com/mishkat:5728"
      },
      "grade": null
    },
    {
      "id": 199,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَن زُرَارَة بن أوفى أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ لِجِبْرِيلَ: \n\" هَلْ رَأَيْتَ رَبَّكَ؟ فَانْتَفَضَ جِبْرِيلُ وَقَالَ: يَا مُحَمَّدُ إِنَّ بَيْنِي وَبَيْنَهُ سَبْعِينَ حِجَابًا مِنْ نُورٍ لَوْ دَنَوْتُ مِنْ بَعْضِهَا لاحترقت «. هَكَذَا فِي» المصابيح \"\nوَرَوَاهُ أَبُو نُعَيْمٍ فِي «الْحِلْيَةِ» عَنْ أَنَسٍ إِلَّا أَنه لم يذكر: «فانتفض جِبْرِيل»",
      "english": {
        "narrator": "",
        "text": "Zurara b. Aufa told that God's messenger asked Gabriel, \"Have you seen your Lord?\" Gabriel trembled and replied, \"Between Him and me, Muhammad, there are seventy veils of light, and if I approached \none of them I would be burned.\" \n\nThus, it is given in al-Masabih. Abu Nu'aim transmitted it in al-Hilya on the authority of Anas, but did not mention that Gabriel trembled."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5729, 5730",
        "url": "https://sunnah.com/mishkat:5729"
      },
      "grade": null
    },
    {
      "id": 200,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «إِنَّ اللَّهَ خَلَقَ إِسْرَافِيلَ مُنْذُ يَوْمَ خَلْقَهُ صَافًّا قَدَمَيْهِ لَا يَرْفَعُ بَصَرَهُ بَيْنَهُ وَبَيْنَ الرَّبِّ تَبَارَكَ وَتَعَالَى سَبْعُونَ نورا مَا مِنْهَا من نورٍ يدنو مِنْهُ إِلاّ احْتَرَقَ» . رَوَاهُ التِّرْمِذِيّ وَصَححهُ",
      "english": {
        "narrator": "",
        "text": "Ibn `Abbas reported God's messenger as saying, \"God created Israfil who has been keeping his feet in line from the day he was created and not raising his glance. Between him and the Lord who is blessed and exalted there are seventy lights not one of which he could approach without being burned.\" \n\nTirmidhi transmitted it and called it sahih."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5731",
        "url": "https://sunnah.com/mishkat:5731"
      },
      "grade": null
    },
    {
      "id": 201,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ جَابِرٌ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \n\" لَمَّا خَلَقَ اللَّهُ آدَمَ وَذُرِّيَّتَهُ قَالَتِ: الْمَلَائِكَةُ: يَا رَبِّ خَلَقْتَهُمْ يَأْكُلُونَ وَيَشْرَبُونَ وَيَنْكِحُونَ وَيَرْكَبُونَ فَاجْعَلْ لَهُمُ الدُّنْيَا وَلَنَا الْآخِرَةَ. قَالَ اللَّهُ تَعَالَى: لَا أَجْعَلُ مَنْ خَلَقْتُهُ بيديَّ ونفخت فِيهِ مِنْ رُوحِي كَمَنْ قُلْتُ لَهُ: كُنْ فَكَانَ «. رَوَاهُ الْبَيْهَقِيُّ فِي» شُعَبِ الْإِيمَانِ \"",
      "english": {
        "narrator": "",
        "text": "Jabir reported the Prophet as saying that when God created Adam and his offspring the angels said, \"O Lord, Thou hast created them eating, drinking, marrying and riding, so appoint the world for them and the next world for us.\" God most high replied, \"I shall not make him whom I have created with My hand and in whom I have breathed of My spirit like one to whom I say `Be' and he comes into existence.\" \n*Mirqat, 5:333, says this refers to riding on animals and sailing on ships. The verb rakiba can have either meaning.\n\nBaihaqi transmitted it in Shu'ab al-lman."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5732",
        "url": "https://sunnah.com/mishkat:5732"
      },
      "grade": null
    },
    {
      "id": 202,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "عَنْ أَبِي هُرَيْرَةَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الْمُؤْمِنُ أَكْرَمُ عَلَى اللَّهِ مِنْ بَعْضِ مَلَائِكَتِهِ» . رَوَاهُ ابْنُ مَاجَهْ",
      "english": {
        "narrator": "",
        "text": "Abu Huraira reported God's messenger as saying, \"A believer is held by God in more honour than some of His angels.\" \n\nIbn Majah transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5733",
        "url": "https://sunnah.com/mishkat:5733"
      },
      "grade": null
    },
    {
      "id": 203,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: أَخَذَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِيَدَيَّ فَقَالَ: «خلق الله الْبَريَّة يَوْمَ السَّبْتِ وَخَلَقَ فِيهَا الْجِبَالَ يَوْمَ الْأَحَدِ وَخلق الشّجر يَوْم الِاثْنَيْنِ وَخلق الْمَكْرُوه يَوْمَ الثُّلَاثَاءِ وَخَلَقَ النُّورَ يَوْمَ الْأَرْبِعَاءِ وَبَثَّ فِيهَا الدَّوَابَّ يَوْمَ الْخَمِيسِ وَخَلَقَ آدَمَ بَعْدَ الْعَصْرِ مِنْ يَوْمِ الْجُمُعَةِ فِي آخِرِ الْخَلْقِ وَآخِرِ سَاعَةٍ مِنَ النَّهَارِ فِيمَا بَيْنَ الْعَصْرِ إِلى اللَّيْل» . رَوَاهُ مُسلم",
      "english": {
        "narrator": "He said:",
        "text": "God's messenger took me by the hand and said, \"God created the earth on Saturday, created the mountains in it on Sunday, created the trees on Monday, created what is objectionable on Tuesday, created the light on Wednesday, sent forth the animals in the earth on Thursday, and created Adam in the late afternoon on Friday, at the end of the creation and at the last hour of the day between the afternoon and the night.\" \n\nMuslim transmitted it."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5734",
        "url": "https://sunnah.com/mishkat:5734"
      },
      "grade": null
    },
    {
      "id": 204,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ قَالَ: بَيْنَمَا نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ جَالِسٌ وَأَصْحَابُهُ إِذْ أَتَى عَلَيْهِمْ سَحَابٌ فَقَالَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «هَلْ تَدْرُونَ مَا هَذَا؟» . قَالُوا: اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: «هَذِهِ الْعَنَانُ هَذِهِ رَوَايَا الْأَرْضِ يَسُوقُهَا اللَّهُ إِلَى قَوْمٍ لَا يَشْكُرُونَهُ وَلَا يَدعُونَهُ» . ثمَّ قَالَ: «هَل تَدْرُونَ من فَوْقَكُمْ؟» قَالُوا: اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: «فَإِنَّهَا الرَّقِيعُ سَقْفٌ مَحْفُوظٌ وَمَوْجٌ مَكْفُوفٌ» . ثُمَّ قَالَ: «هَلْ تَدْرُونَ مَا بَيْنَكُمْ وَبَيْنَهَا؟» قَالُوا: اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: «بَيْنَكُمْ وَبَيْنَهَا خَمْسُمِائَةِ عَامٍ» ثُمَّ قَالَ: «هَلْ تَدْرُونَ مَا فَوْقَ ذَلِكَ؟» . قَالُوا: اللَّهُ ورسولُه أعلمُ. قَالَ: «سماءانِ بُعْدُ مَا بَيْنَهُمَا خَمْسُمِائَةِ سَنَةٍ» . ثُمَّ قَالَ كَذَلِكَ حَتَّى عَدَّ سَبْعَ سَمَاوَاتٍ «مَا بَيْنَ كُلِّ سَمَاءَيْنِ مَا بَيْنَ السَّمَاءِ وَالْأَرْضِ» . ثُمَّ قَالَ: «هَلْ تَدْرُونَ مَا فَوْقَ ذَلِكَ؟» قَالُوا: اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: «إِنَّ فَوْقَ ذَلِكَ الْعَرْشُ وَبَيْنَهُ وَبَيْنَ السَّمَاءِ بُعْدُ مَا بَيْنَ السَّماءين» . ثُمَّ قَالَ: «هَلْ تَدْرُونَ مَا تَحْتَ ذَلِكَ؟» . قَالُوا: اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: «إِنَّ تَحْتَهَا أَرْضًا أُخْرَى بَيْنَهُمَا مَسِيرَةُ خَمْسِمِائَةِ سَنَةٍ» . حَتَّى عدَّ سَبْعَ أَرضين بَين كلَّ أَرضين مسيرَة خَمْسمِائَة سنة \" قَالَ: «وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَوْ أَنَّكُمْ دَلَّيْتُمْ بِحَبْلٍ إِلَى الْأَرْضِ السُّفْلَى لَهَبَطَ عَلَى اللَّهِ» ثُمَّ قَرَأَ (هُوَ الْأَوَّلُ وَالْآخِرُ وَالظَّاهِرُ وَالْبَاطِنُ وَهُوَ بِكُلِّ شيءٍ عليم)\nرَوَاهُ أَحْمَدُ وَالتِّرْمِذِيُّ. وَقَالَ التِّرْمِذِيُّ: قِرَاءَةُ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْآيَةَ تَدُلُّ على أَنه أَرَادَ الهبط عَلَى عِلْمِ اللَّهِ وَقُدْرَتِهِ وَسُلْطَانِهِ وَعِلْمُ اللَّهِ وَقُدْرَتُهُ وَسُلْطَانُهُ فِي كُلِّ مَكَانٍ وَهُوَ عَلَى الْعَرْش كَمَا وصف نَفسه فِي كِتَابه",
      "english": {
        "narrator": "",
        "text": "He told that while God's prophet and his companions were sitting clouds came over them and God's prophet asked, \"Do you know what these are?\" On their replying that God and His messenger knew best, he said, \"These are the clouds (`anan), these are the water-carriers of the earth which God drives to people who do not thank Him or call upon Him.\" He then asked, \"Do you know what is above you?\" On their replying that God and His messenger knew best, he said, \"It is the firmament, a ceiling which is guarded and waves which are kept back.\" He then asked, \"Do you know what is between you and it?\" On their replying that God and His messenger knew best, he said, \"Between you and it are five hundred years.\" He then asked, \"Do you knew what is above that?\" On their replying that God and His messenger knew best, he said, \"Two heavens with a distance of five hundred years between them.\" He went on speaking like that till he counted seven heavens, the distance between each pair being like that between the heaven and the earth. He then asked, \"Do you know what is above that?\" On their replying that God and His messenger knew best, he said, \"Above that is the Throne, and the distance between it and the .\n This is the reading in the text on the margin of Mirqat. In Tirmidhi, in his book on Tafsir al Quran, the tradition occurs in his section on sura 57 (al-hadid), the reading being \"if you were to drop a man with a rope...\"\n Literally, \"it would fall upon God.\" \n Quran, 57:3.\n  Tirmidhi says in the passage cited above, \"some of the learned have expounded this tradition...\"\n Cf. Quran; 7:54; 10:3, etc."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5735",
        "url": "https://sunnah.com/mishkat:5735"
      },
      "grade": null
    },
    {
      "id": 205,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْهُ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: «كَانَ طُولُ آدَمَ سِتِّينَ ذِرَاعًا فِي سبع أَذْرع عرضا»",
      "english": {
        "narrator": "",
        "text": "He reported God's messenger as saying, \"Adam was sixty cubits tall and seven cubits broad.\""
      },
      "reference": {
        "text": "Mishkat al-Masabih 5736",
        "url": "https://sunnah.com/mishkat:5736"
      },
      "grade": null
    },
    {
      "id": 206,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنْ أَبِي ذَرٍّ قَالَ: قُلْتُ: يَا رَسُولَ اللَّهِ أَيُّ الْأَنْبِيَاءِ كَانَ أَوَّلَ؟ قَالَ: «آدَمُ» . قُلْتُ: يَا رَسُولَ اللَّهِ وَنَبِيٌّ كَانَ؟ قَالَ: «نَعَمْ نَبِيٌّ مُكَلَّمٌ» . قُلْتُ: يَا رَسُولَ اللَّهِ كم المُرْسَلُونَ؟ قَالَ: «ثَلَاثمِائَة وبضع عشر جماً غفيراً»\nوَفِي رِوَايَة عَنْ أَبِي أُمَامَةَ قَالَ أَبُو ذَرٍّ: قَلْتُ يَا رَسُولَ اللَّهِ كَمْ وَفَاءُ عِدَّةِ الْأَنْبِيَاءِ؟ قَالَ: «مِائَةُ أَلْفٍ وَأَرْبَعَةٌ وَعِشْرُونَ أَلْفًا الرُّسُلُ مِنْ ذَلِكَ ثَلَاثُمِائَةٍ وَخَمْسَةَ عَشَرَ جَمًّا غَفِيرًا»",
      "english": {
        "narrator": "",
        "text": "Abu Dharr told that he asked God's messenger who was the first of the prophets and he replied that it was Adam. He asked if he was really a prophet and he replied, \"Yes, he was a prophet to whom a message was given.\" He asked God's messenger how many messengers there had been, and he replied, \"There have been three hundred and between ten and twenty all told.\" In a version on the authority of Abu Umama Abu Dharr told that he had asked God's messenger the number which made up the full complement of the prophets, and he replied, \"A hundred and twenty-four thousand among whom were three hundred and fifteen messengers all told.\""
      },
      "reference": {
        "text": "Mishkat al-Masabih 5737",
        "url": "https://sunnah.com/mishkat:5737"
      },
      "grade": null
    },
    {
      "id": 207,
      "chapterId": 28,
      "bookId": 14,
      "arabic": "وَعَنِ ابْنِ عَبَّاسٍ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" لَيْسَ الْخَبَرُ كَالْمُعَايَنَةِ إِنَّ اللَّهَ تَعَالَى أَخْبَرَ مُوسَى بِمَا صَنَعَ قَوْمُهُ فِي الْعِجْلِ فَلَمْ يُلْقِ الْأَلْوَاحَ فَلَمَّا عَايَنَ مَا صَنَعُوا أَلْقَى الْأَلْوَاحَ فَانْكَسَرَتْ. رَوَى الْأَحَادِيث الثَّلَاثَة أَحْمد",
      "english": {
        "narrator": "",
        "text": "Ibn 'Abbas reported God's messenger as saying, \"Being given information is not like seeing. God most high gave Moses information about what his people had done regarding the calf and he did not throw down the tablets, but when he saw what they did he threw down the tablets and they were broken.\" \n\nAhmad transmitted the three traditions."
      },
      "reference": {
        "text": "Mishkat al-Masabih 5738",
        "url": "https://sunnah.com/mishkat:5738"
      },
      "grade": null
    }
  ],
  "chapter": {
    "id": 28,
    "bookId": 14,
    "arabic": "كتاب أحوال القيامة وبدء الخلق",
    "english": "Events of the Day of Resurrection and the Beginning of Creation"
  }
}